     A*%%TS  SD  20140228  164732  LYNNM       REL-V6R1M0  5761-WDS
     A*----------------------------------------------------------------
     A*   Copyright (C) 2009 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  CW325FM    View CWLOG History Display
     A*  Lynn McMahon
     A*
     A*  Revisions
     A*
650 AA*    02/27/14  LMC  6.50
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      ERRSFL
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A*
     A          R SFL1                      SFL
     A*%%TS  SD  20140228  094719  LYNNM       REL-V6R1M0  5761-WDS
     A  21                                  SFLNXTCHG
     A            SFLHIDE      110A  H
     A            OPTION         2A  B  8  2
     A  20                                  DSPATR(PC)
     A N21N90                               DSPATR(UL)
     A  21                                  DSPATR(RI)
     A                                      DSPATR(PR)
     A  50                                  COLOR(RED)
     A                                      DSPATR(ND)
     A            W1EMP#NAM     24A  O  8 36
     A  50                                  COLOR(RED)
     A            W1ADDED       19A  O  8 61
     A  50                                  COLOR(RED)
     A            W1LBL#         7S 0O  8  5
     A  50                                  COLOR(RED)
     A            W1WGTLBS       9Y 2O  8 13EDTWRD('       .  ')
     A  50                                  COLOR(RED)
     A            W1ENTRY       10A  O  8 24
     A  50                                  COLOR(RED)
     A*
     A          R SF1CTL                    SFLCTL(SFL1)
     A*%%TS  SD  20140228  094719  LYNNM       REL-V6R1M0  5761-WDS
     A                                      SFLSIZ(0034)
     A                                      SFLPAG(0014)
     A                                      ROLLUP
     A                                      OVERLAY
     A                                      SFLCSRRRN(&CSRRRN)
     A N32                                  SFLDSP
     A N31                                  SFLDSPCTL
     A  31                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A            RRN1           4S 0H      SFLRCDNBR(CURSOR)
     A            CSRRRN         5S 0H
     A            SCRNAME        8A  O  1  2
     A                                  1 31'View Catch Weight History'
     A                                      DSPATR(HI)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A            SCHEAD        58A  O  2 12
     A                                  2 71TIME
     A            SCOPT1        75A  O  4  2COLOR(BLU)
     A            SCOPT2        75A  O  5  2COLOR(BLU)
     A                                  7  1'Opt'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                      DSPATR(ND)
     A                                  7  5'Label  '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 36'Employee                '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 61'Added Date and Time'
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 13'Weight    '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A                                  7 24'Entry     '
     A                                      DSPATR(HI)
     A                                      DSPATR(UL)
     A*
     A          R FKEY1
     A*%%TS  SD  20090226  172828  DAVE        REL-V6R1M0  5761-WDS
     A                                 23  2'F3=Exit  F5=Refresh               -
     A                                                                       F1-
     A                                      2=Cancel'
     A                                      COLOR(BLU)
