     A*%%TS  SD  20121205  112753  RETHA       REL-V6R1M0  5761-WDS
500aAA*----------------------------------------------------------------
500aAA*   Multilingual Version
500aAA*   Every screen has a corresponding Spanish screen.
500aAA*   All Spanish screens are at the end.
500aAA*   Any changes must be made to both screens.
500aAA*   If necessary, contact appropriate person to do translation.
414 AA* ***************************************************************
414 AA* *****  If the position of any slot entry field is changed *****
414 AA* *****  you must change the WOROW/WOCOL values in the RPG  *****
414 AA* *****  program.                                           *****
414 AA* ***************************************************************
     A********************************************************************
     A*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved    *
     A*   BFC Software, Inc.                                             *
     A*   799 Roosevelt Rd.  Bldg 6, Suite 108                           *
     A*   Glen Ellyn, IL  60137                                          *
     A*   (630) 790-8383                                                 *
     A********************************************************************
     A*
     A*  LT105FM      RF Let-Down - Automated
     A*  01 March 2000
     A*  Max Blacknik
     A*
     A********************************************************************
     A*
     A*  Revisions:
     A*
414aAA*     07/25/00  MLB  4.14a
     A*       - Major revisions to display file.  All other previous changes
     A*         have been removed. All changes will not be documented.
414bAA*     08/23/00  MLB  4.14b
     A*       - Removed F10=Excpt from SCREEN3.
     A*
416 AA*     10/15/01  MLB  4.16
     A*       - Revised MSGCLR to clear 17 lines, starting at line 8-24.
416aAA*     03/29/02  MLB  4.16a
     A*       - Revised screen 8 to add new field W8ORSL - Original slot
     A*         replenishment was taken.
416bAA*     09/18/02  MLB  4.16b
     A*       - Enh: Added F8 = List to screen 2. This will allow a user to
     A*         zero out a letdown and goto create a specific slot replen.
     A*
417 AA*     12/09/02  MLB  4.17
     A*       - Enh: Added new Screen 9 to capture new lot#/license plate when
     A*         product is split between slots.
417aAA*     07/24/03  MLB  4.17a
     A*       - Enh: Revised Screen 7 to add support for Pushback/Eaches
     A*         Priority replenishments.
500 AA*     10/15/04  DAS  5.00
     A*       - Enh: Changed Pushback to FlowRack, Eaches to Breakdown.
     A*
500aAA*   05/31/06  JCJ  5.00
     A*     - Merged Spanish screens from PIRS.
     A*
510 AA*   02/13/07  JCJ  5.10
     A*     - Enh: Added Replenishmnt type 'R' (repack)
     A*     - Enh: Added Scrn10 Replenishment Type (window)
510aAA*   10/24/07  LMC  5.10a
     A*     - Enh: Added 16 x 20 handheld screens
510bAA*   12/07/07  RH   5.10b
     A*     - Enh: Added F11 call transfer program.
     A*
600 AA*   07/06/08  DAS  6.00   P#00045
     A*     - License Tracking
     A*     - 520 version used as base.
     A*
600aAA*   04/22/05  DAS  6.00a
     A*     - Enh: Added *IN93 to prevent entry on sc2.
     A*     - Enh: Added Side field.
610aAA*   08/04/09  RH   6.10a
     A*     - Enh: Rename format to LT10502
     A*     - Enh: Add 16 X 20 screens SCREEN72, SCREEN73
     A*     - Enh: Change 'Y,N' to output field, allow 1,9 to be
     A*            displayed for Saval.
640aAA*   08/22/11  RH   6.40a
     A*     - Enh: Rename format to LT10503
     A*     - Enh: Add SCREN6A, SCREN66A, SCN6ASP, SCN66ASP to display
     A*       when all JIT for selected area have been processed.
     A*
640bAA*   11/16/12  RBD  6.40b
     A*     - Enh: Renamed format to LT10504.
     A*     - Changed all screen headings from 'Repl/Let Downs' to just
     A*       'Replenishments' because we don't have let downs anymore.
     A*     - Enh: Added scrn11, scrn11sp, scrn611, and scr611sp to advise
     A*       user during specific slot replenishment that a JIT exists
     A*       with an option to go into JIT repl's as if he went back to
     A*       the first screen and pressed Enter.
     A*     - Enh: Added *ALL selection for Department on screen7,
     A*       scrn7sp, screen67, and scrn67sp.
700aAA*   05/11/15  RH   7.00a
     A*     - Enh: Renamed format to LT10505.
     A*       Move ORDQ to left side of screen so 20 line can see with
     A*       out shifting screen.move other fields down
700bAA*   01/08/16  RH   7.00b
     A*     - Fix: Increase W3TIE to 4.0 was causing reciever value
     A*       too small error.  Field in ITEMDEF is 4.0
700cAA*   05/06/16  JCJ  7.00c
     A*     - Enh: Renamed format to LT10507.
     A*     - Add new Fkey=F14=< 5 Cases.
     A*
710aAA*   06/14/17  LMC  7.10a
     A*     - Fix: Disable F10 key on screen 8, if an error was
     A*       encountered on the slot being entered in the RtnTo field.
     A*     - Renamed display file LT10506 to LT10507.
710bAA*   06/28/17  NLK  7.10b
     A*     - Enh: Renamed display file LT10507 to LT10508.
     A*     - Add in44 F10 not allow if same slot
     A*
720aAA*   02/27/18  LMC  7.20a
     A*     - Enh: Renamed display file LT10508 to LT10509.
     A*     - Added logic to show text on screen1 that allows the
     A*       scanning of the license or the pick slot.
     A*
720cAA*   03/12/18  KDE  7.20c
     A*     - Enh: Added Staging to Replenishment type prompt screen
     A********************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA05
     A          R SCREEN1
     A                                      CA03
     A                                      CA12
700cAA                                      CA14
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW WOCOL)
     A                                      OVERLAY
     A            WOROW          3  0H
     A            WOCOL          3  0H
     A                                  1  2'LT105.01'
     A                                  1 12'Specific Slot Repl. '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  3  2'Type changes, press Enter.'
     A                                      COLOR(BLU)
     A                                  4  2'Warehouse . . .'
     A            W1WHSE         3Y 0B  4 19
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                  5  2'Department  . .'
     A            W1WHDP         5A  B  5 19
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
720aDA*                                 6  2'Pick slot . . .'
720aMA N83                              6  2'Pick slot . . .'
720aAA  83                              6  2'Pick slot/Lcns.'
720aDA*           W1TDIS        12A  B  6 19CHECK(ER)
720aMA            W1SCAN        15A  B  6 19CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
     A                                  7  1'F3=Exit'
     A                                      COLOR(BLU)
     A                                  7 10'F5=Refresh'
     A                                      COLOR(BLU)
     A                                  7 22'F12=Cancel'
     A                                      COLOR(BLU)
700cAA            F14DSC        15A  O  7 34COLOR(BLU)
     A*
     A          R SCREEN2
     A*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
     A                                      CA03
     A N70                                  CF07
416bAA N70                                  CF08
     A N70                                  CF09
710bD *                                     CF10
710bMA N44                                  CF10
510b A N70                                  CF11
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.02'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W2ITEM        65A  O  2  1
     A                                  3  1'Frm slot:'
     A            W2FMSL        12A  O  3 11
     A                                  3 24'To:'
     A            W2TOSL        12A  O  3 28
     A                                  4  1'Slot qty  :'
     A            W2SLTQ         7Y 0O  4 13EDTCDE(3)
     A            W2UM1A         2A  O  4 21
     A                                  4 24'Ti/Hi:'
     A            W2TIE          3Y 0O  4 31EDTCDE(4)
     A                                  4 35'/'
     A            W2HIGH         3Y 0O  4 37EDTCDE(4)
     A                                  5  1'Repl qty  :'
     A            W2REPQ         7Y 0O  5 13EDTCDE(3)
     A            W2UM2A         2A  O  5 21
     A                                  5 24'Ordq :'
     A N61                                  DSPATR(ND)
     A            W2ORDQ         5Y 0O  5 31EDTCDE(L)
     A N61                                  DSPATR(ND)
CBI1 A            W2TPRP         5Y 0O  5 38EDTCDE(4)
CBI1 A                                      DSPATR(ND)
     A                                  6  1'Qty pulled:'
     A            W2NQTY         7Y 0B  6 13EDTCDE(4)
     A  23                                  DSPATR(RI)
600aMA N23N90N93                            DSPATR(UL)
     A  03                                  DSPATR(PC)
600aAA  93
600aMAO 90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W2UM3A         2A  O  6 21
     A                                  6 24'From'
     A            W2SCAN        12A  B  6 29CHECK(ER)
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A N04
     AO 04                                  DSPATR(PC)
     A  70
     AO 90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W2QTY          7S 0O  6 60DSPATR(ND)
416bDA*N70                              7  1'F7=Specific'
416bMA N70                              7  1'F7=Specifc'
     A                                      COLOR(BLU)
416bAA N70                              7 12'F8=List'
416bAA                                      COLOR(BLU)
416bMA N70                              7 20'F9=Skip'
     A                                      COLOR(BLU)
416bMA                                  7 28'F10=Excpt'
710bAA  44                                  DSPATR(ND)
     A                                      COLOR(BLU)
510bDA*                                 7 38'F12=Cancel'
510bMA  70                              7 38'F12=Cancel'
510bMA N70                              7 38'F11=Transf'
     A                                      COLOR(BLU)
     A*
     A          R SCREEN3
     A*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
414bDA*                                     CF10
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.03'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W3ITEM        65A  O  2  1
     A                                  3  2'To slot :'
     A            W3TOSL        12A  O  3 12
     A                                  4  2'Pull qty:'
     A            W3PULQ         7Y 0O  4 12EDTCDE(3)
     A            W3UM1A         2A  O  4 21
     A                                  4 24'Tie/Hi:'
700bDA*           W3TIE          3Y 0O  4 32EDTCDE(4)
700bDA*                                 4 36'/'
700bDA*           W3HIGH         3Y 0O  4 38EDTCDE(4)
700bMA            W3TIE          4Y 0O  4 32EDTCDE(4)
700bMA                                  4 37'/'
700bMA            W3HIGH         3Y 0O  4 39EDTCDE(4)
     A                                  5  2'Repl qty:'
     A            W3REPQ         7Y 0O  5 12EDTCDE(3)
     A            W3UM2A         2A  O  5 21
     A  63                              5 24'Balance:'
     A  63        W3BALQ         7Y 0O  5 33EDTCDE(L)
     A                                  6  2'Qty repl:'
     A            W3NQTY         7Y 0B  6 12EDTCDE(M)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W3UM3A         2A  O  6 21
     A                                  6 24'To :'
     A            W3SCAN        12A  B  6 29CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
414bDA*                                 7  1'F10=Excpt'
414bDA*                                     COLOR(BLU)
414bMA                                  7  1'F12=Cancel'
     A                                      COLOR(BLU)
     A          R SCREEN4
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.04'
     A            WOHDR1        15   O  1 14
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  3  5'Exception'
     A                                      DSPATR(HI)
     A                                  3 15'Processing'
     A                                      DSPATR(HI)
     A                                  4  2'Item . . . . .'
     A            W4ITEM         1A  B  4 17
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  90                                  DSPATR(PR)
610aDA*                                 4 20'(Y,N)'
610aMA            WOYN           3A  O  4 20
     A*    Delete DSPATR below when qty exception support activated.
     A                                  5  2'Quantity . . .'
     A                                      DSPATR(ND)
     A*    Delete DSPATR below when qty exception support activated.
     A            W5QTY          1A  B  5 17
     A                                      DSPATR(ND PR)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A*    Activate this line when qty exception support activated.
     A* 90                                  DSPATR(PR)
     A*    Delete DSPATR below when qty exception support activated.
610aDA*                                 5 20'(Y,N)'
610aMA*           WOYN           3A  O  5 20
     A*                                     DSPATR(ND)
     A                                  7  1'F12=Cancel'
     A                                      COLOR(BLU)
     A          R SCREEN5
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.05'
     A            WOHDR1        15A  O  1 14
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2 16'Verify Slot'
     A                                      DSPATR(HI)
     A                                  3  2'Department  . . . . . . .'
     A            W5WHDP         5A  O  3 28
     A                                  4  2'Slot  . . . . . . . . . .'
     A            W5FMSL        12A  O  4 28
     A                                  5  2'Slot physically empty . .'
     A            W5ZERO         1A  B  5 28CHECK(ER)
     A  28                                  DSPATR(RI)
     A N28N90                               DSPATR(UL)
     A  08                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
610aDA*                                 5 36'(Y,N)'
610aMA            WOYN           3A  O  5 36
     A                                  7  1'F12=Cancel'
     A                                      COLOR(BLU)
     A*
     A          R SCREEN6
     A                                      CA03
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.6'
640bDA**                                1 14'Repl/Let Downs'
640bMA                                  1 14'Replenishments'
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
640bDA**                                3  2'All let downs in'
640bMA                                  3  2'All repls in'
640bMA            W6WHSE         3S 0O  3 15DSPATR(HI)
640bMA                                  3 19'/'
     A                                      DSPATR(HI)
640bMA            W6WHDP         5A  O  3 21DSPATR(HI)
640bMA                                  3 27'have been'
     A                                  4  2'processed.  Scan empty slot or sel-
     A                                      ect'
     A                                  5  2'new department to continue.'
     A                                  7  1'F3=Exit'
     A                                      COLOR(BLU)
     A                                  7 10'F7=Specific'
     A                                      COLOR(BLU)
     A                                  7 23'F12=Cancel'
     A                                      COLOR(BLU)
     A          R SCREEN7
     A*%%TS  SD  20121205  112753  RETHA       REL-V6R1M0  5761-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.7'
640bDA**                                1 15'Repl/Let Downs'
     A                                  1 15'Replenishments'
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
417aDA*                                 4  2'Warehouse . .'
600aDA**                                3  2'Warehouse . .'
     A                                  3  2'Whse/Dept . .'
417aDA*           W7WHSE         3Y 0B  4 17
     A            W7WHSE         3Y 0B  3 17
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
417aDA*                                 5  2'Department  .'
600aDA**                                4  2'Department  .'
     A                                  3 21'/'
417aDA*           W7WHDP         5A  B  5 17
600aDA**          W7WHDP         5A  B  4 17
     A            W7WHDP         5A  B  3 23
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
640bAA                                  3 29'(or *ALL)'
600aDA**                                5  2'Repl type . .'
600aDA**          W7RPLT         1A  B  5 17
     A                                  4  2'Repl type . .'
     A            W7RPLT         1A  B  4 17
     A N25                                  DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90                               DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
640bAA                                  4 19'(A=ALL)'
     A            W7DSPS         1Y 0O  4 32EDTCDE(4)
     A                                      DSPATR(ND)
510 DA***                               5 21'N=Normal,F=Flow,B=Brk'
600aDA**                                6  2'Aisle range .'
600aDA**          W7FAS          3A  B  6 17
     A                                  5  2'Aisle range .'
     A            W7FAS          3A  B  5 17
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
600aDA**                                6 21'thru'
600aDA**          W7TAS          3A  B  6 26
     A                                  5 21'thru'
     A            W7TAS          3A  B  5 26
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N24N90                               DSPATR(HI)
     A                                      CHECK(ER)
600aDA**                                6 30'(Blank=All)'
     A                                  5 30'(Blank=All)'
     A                                  6  2'      Side  .'
     A            W7SIDE         1A  B  6 17
     A N26                                  DSPATR(HI)
     A  26                                  DSPATR(RI)
     A N26N90                               DSPATR(UL)
     A  06                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                  6 21'B=Both, E=Even, O=Odd'
     A                                  7  1'F3=Exit'
     A                                      COLOR(BLU)
     A                                  7  9'F5=Refrsh'
     A                                      COLOR(BLU)
     A                                  7 19'F7=Specific'
     A                                      COLOR(BLU)
     A                                  7 31'F12=Cancel'
     A                                      COLOR(BLU)
     A*
     A          R SCREEN8
     A*%%TS  SD  20000801  072744  MLBLACKNIK  REL-V4R4M0  5769-PW1
710aDA*                                     CF10
710aMA N82                                  CF10
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.08'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W8ITEM        65A  O  2  1
416aAA                                  3  2'Orig slot :'
416aAA            W8ORSL        12   O  3 14
     A                                  4  2'Balance   :'
     A            W8BALQ         7Y 0O  4 14EDTCDE(3)
     A  65                              4 23'RtnTo'
     A  65        W8RTN2        12   O  4 29DSPATR(HI)
     A                                  5  2'Qty putawy:'
     A            W8NQTY         7Y 0B  5 14EDTCDE(M)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A                                  5 23'RtnTo'
     A            W8SCAN        12A  B  5 29CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
710aDA*                                 7  1'F10=Excpt'
710aMA                                  7  1'F10=Excpt'
710aAA  82                                  DSPATR(ND)
     A                                      COLOR(BLU)
417 AA*
417 AA          R SCREEN9
417 AA                                      WINDOW(1 2 6 20)
417 AA                                      WDWTITLE((*TEXT 'Scan Lot/Lic#') *C-
417 AA                                      ENTER)
417 AA                                      WDWTITLE((*TEXT 'F3/F12=Exit') *BOT-
417 AA                                      TOM)
417 AA                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
417 AA                                          '))
417 AA                                      CA03
417 AA                                      CA12
417 AA  98                                  ALARM
417 AA                                      CLRL(07)
417 AA                                      CSRLOC(WOROW      WOCOL)
417 AA                                      OVERLAY
417 AA            WOROW          3S 0H
417 AA            WOCOL          3S 0H
417 AA            W9ITEM        18A  O  1  1
417 AA            WOTX91        18A  O  2  1
417 AA            W9OLLP        15A  O  3  1
417 AA            WOTX92        18A  O  4  1
417 AA            W9NLLP        15A  B  5  3
417 AA  22                                  DSPATR(RI)
417 AA N22N90                               DSPATR(UL)
417 AA  02                                  DSPATR(PC)
417 AA  90                                  DSPATR(PR)
417 AA                                      DSPATR(HI)
510 AA*
510 AA**************************************************************************
510 AA* Replenishment prompt window                                            *
510 AA**************************************************************************
510 AA          R SCRN10
510 AA*%%TS  SD  20070213  171940  JEFF        REL-V5R3M0  5722-WDS
510 AA                                      CA03
640bDA**                                    WINDOW(5 10 6 25)
720dMA**                                    WINDOW(5 10 7 25)
720cMA                                      WINDOW(5 10 8 25)
510 AA                                      OVERLAY
510 AA                                      WDWBORDER((*COLOR RED))
510 AA                                      WDWBORDER((*DSPATR RI))
510 AA                                      WDWBORDER((*CHAR '        '))
510 AA                                      WDWTITLE((*TEXT 'Repl Type'))
510 AA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
510 AA            W10TP1         1A  B  2 12
510 AA                                  2  1'Repl Type:'
510 AA                                  2 15'N=Normal'
510 AA                                  3 15'F=Flow'
510 AA                                  4 15'B=Breakdn'
510 AA                                  5 15'R=Repack'
720cAA                                  6 15'S=Staging'
640bAA                                  7 15'A=All Types'
510 AA*
640bAA**************************************************************************
640bAA* JIT notification during specific slot replenishment                    *
640bAA*
640bAA          R SCRN11
640bAA                                      CA03
640bAA                                      WINDOW(5 10 6 25)
640bAA                                      OVERLAY
640bAA                                      WDWBORDER((*COLOR RED))
640bAA                                      WDWBORDER((*DSPATR RI))
640bAA                                      WDWBORDER((*CHAR '        '))
640bAA                                      WDWTITLE((*TEXT 'JIT Notice'))
640bAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
640bAA                                  2  2'JIT exists, do you'
640bAA                                  3  2'wish to go into JIT'
640bAA                                  4  2'replenishments ?'
640bAA                                  5  2'Y=Yes N=No'
640bAA            W11JIT         1A  B  5 13
640bAA*
510 AA          R DUMMY
510 AA                                      ASSUME
510 AA                                  5 60' '
     A*
640aAA**************************************************************************
640aAA          R SCREN6A
640aAA**                                    CA03
640aAA**                                    CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.6A'
640bDA**                                1 14'Repl/Let Downs'
640bMA                                  1 14'Replenishments'
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
     A                                  3  2'All JIT replens in '
     A            W6WHSE         3S 0O  3 22DSPATR(HI)
     A                                  3 25'/'
     A                                      DSPATR(HI)
     A            W6WHDP         5A  O  3 28DSPATR(HI)
     A                                  3 33'have been'
     A                                  4  2'processed.  Press enter to continu-
     A                                      e'
     A*                                 7  1'F3=Exit'
     A*                                     COLOR(BLU)
640aAA*                                 7 23'F12=Cancel'
640aAA*                                     COLOR(BLU)
640aAA*----------------------------------------------------------------
     A*         R SCREEN66
640aAA          R SCREN66A
640aAA*%%TS  SD  20110823  091023  BFC         REL-V7R1M0  5770-WDS
640aAA*                                     CA03
640aAA*                                     CF07
640aAA*                                     CA12
640aAA  98                                  ALARM
640aAA                                      CLRL(15)
     A                                      OVERLAY
     A                                  1  2'LT105.66a'
640bDA**                                1 14'Repl/Let Downs'
640bMA                                  1 14'Replenishments'
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
     A                                  3  2'All JIT       in'
     A            W6WHSE         3S 0O  4  2DSPATR(HI)
     A                                  4  6'/'
     A                                      DSPATR(HI)
     A            W6WHDP         5A  O  4  8DSPATR(HI)
     A                                  5  2'have been processed'
     A                                  6  2'Press enter to    '
     A                                  7  2'continue.         '
640aAA                                 14  1'       '
640aAA                                      COLOR(BLU)
     A*****************************************************************
     A          R CLRSCR
     A                                      CLRL(*ALL)
     A*****************************************************************
     A*
     A* Error Message Subfile Records
     A*
     A*    Error Message Subfile Record
     A*
     A          R MSGREC                    SFL
     A                                      SFLMSGRCD(8)
     A            #MSGK                     SFLMSGKEY
     A            #PGMQ                     SFLPGMQ
     A*
     A*    Error Message Subfile Control Record
     A*
     A          R MSGCTL                    SFLCTL(MSGREC)
     A  98                                  ALARM
     A                                      LOCK
     A                                      OVERLAY
     A                                      SFLSIZ(2) SFLPAG(1)
     A N97                                  SFLCLR
     A  97                                  SFLDSP
     A  97                                  SFLEND
     A          R MSGCLR
     A                                      OVERLAY
     A                                      LOCK
     A                                      SLNO(08)
416 DA**                                    CLRL(1)
416 MA                                      CLRL(17)
500 AA*
500 AA*****************************************************************
500 AA* Spanish Screens
500 AA*****************************************************************
500aAA*----------------------------------------------------------------
500aAA          R SCRN1SP
     A                                      CA03
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW WOCOL)
     A                                      OVERLAY
     A            WOROW          3  0H
     A            WOCOL          3  0H
     A                                  1  2'LT105.01'
     A                                  1 12'Reap. Slot especifico'
     A                                      DSPATR(HI)
     A                                  1 34DATE
     A                                      EDTCDE(Y)
     A                                  3  2'Escriba cambios, Oprima Enter'
     A                                      COLOR(BLU)
     A                                  4  2'Almacen . . . .'
     A            W1WHSE         3Y 0B  4 19
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                  5  2'Departamento. .'
     A            W1WHDP         5A  B  5 19
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
720aDA*                                 6  2'Pick slot . . .'
720aMA N83                              6  2'Pick slot . . .'
720aAA  83                              6  2'Pick slot/Lcns.'
720aDA*           W1TDIS        12A  B  6 19CHECK(ER)
720aMA            W1SCAN        15A  B  6 19CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
     A                                  7  1'F3=Salir'
     A                                      COLOR(BLU)
     A                                  7 11'F5=Refrescar'
     A                                      COLOR(BLU)
     A                                  7 25'F12=Cancelar'
     A                                      COLOR(BLU)
     A*
500aAA*----------------------------------------------------------------
500aAA          R SCRN2SP
     A*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
     A                                      CA03
     A N70                                  CF07
416bAA N70                                  CF08
     A N70                                  CF09
     A                                      CF10
510b A N70                                  CF11
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.02'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W2ITEM        65A  O  2  1
     A                                  3  1'De slot :'
     A            W2FMSL        12A  O  3 11
     A                                  3 24' A:'
     A            W2TOSL        12A  O  3 28
     A                                  4  1'ctd de    :'
     A            W2SLTQ         7Y 0O  4 13EDTCDE(3)
     A            W2UM1A         2A  O  4 21
     A                                  4 24'Ti/Hi:'
     A            W2TIE          3Y 0O  4 31EDTCDE(4)
     A                                  4 35'/'
     A            W2HIGH         3Y 0O  4 37EDTCDE(4)
     A                                  5  1'Ctd reap  :'
     A            W2REPQ         7Y 0O  5 13EDTCDE(3)
     A            W2UM2A         2A  O  5 21
     A                                  5 24'CdPed:'
     A N61                                  DSPATR(ND)
     A            W2ORDQ         5Y 0O  5 31EDTCDE(L)
     A N61                                  DSPATR(ND)
CBI1 A            W2TPRP         5Y 0O  5 38EDTCDE(4)
CBI1 A                                      DSPATR(ND)
     A                                  6  1'Ctd escogi:'
     A            W2NQTY         7Y 0B  6 13EDTCDE(4)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W2UM3A         2A  O  6 21
     A                                  6 24'De  '
     A            W2SCAN        12A  B  6 29CHECK(ER)
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A N04
     AO 04                                  DSPATR(PC)
     A  70
     AO 90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W2QTY          7S 0O  6 60DSPATR(ND)
416bDA*N70                              7  1'F7=Espcific'
416bMA N70                              7  1'F7=Especifico'
     A                                      COLOR(BLU)
416bAA N70                              7 15'F8=Lista'
416bAA                                      COLOR(BLU)
416bMA N70                              7 25'F9=Pasar'
     A                                      COLOR(BLU)
416bMA                                  7 35'F10=Excpt'
     A                                      COLOR(BLU)
510bDA*                                 7 38'F12=Cancelar'
510bMA  70                              7 38'F12=Cancelar'
510bMA N70                              7 38'F11=Transf.'
     A                                      COLOR(BLU)
     A*
500aAA*----------------------------------------------------------------
500aAA          R SCRN3SP
     A*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
414bDA*                                     CF10
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.03'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W3ITEM        65A  O  2  1
     A                                  3  2'A slot  :'
     A            W3TOSL        12A  O  3 12
     A                                  4  2'Ctd jale:'
     A            W3PULQ         7Y 0O  4 12EDTCDE(3)
     A            W3UM1A         2A  O  4 21
     A                                  4 24'Tie/Hi:'
700bDA*           W3TIE          3Y 0O  4 32EDTCDE(4)
700bDA*                                 4 36'/'
700bDA*           W3HIGH         3Y 0O  4 38EDTCDE(4)
700bMA            W3TIE          4Y 0O  4 32EDTCDE(4)
700bMA                                  4 37'/'
700bMA            W3HIGH         3Y 0O  4 39EDTCDE(4)
     A                                  5  2'Ctd reap:'
     A            W3REPQ         7Y 0O  5 12EDTCDE(3)
     A            W3UM2A         2A  O  5 21
     A  63                              5 24'Balance:'
     A  63        W3BALQ         7Y 0O  5 33EDTCDE(L)
     A                                  6  2'Ctd reap:'
     A            W3NQTY         7Y 0B  6 12EDTCDE(M)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A            W3UM3A         2A  O  6 21
     A                                  6 24' A :'
     A            W3SCAN        12A  B  6 29CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
414bDA*                                 7  1'F10=Excpc'
414bDA*                                     COLOR(BLU)
414bMA                                  7  1'F12=Cancelar'
     A                                      COLOR(BLU)
500aAA*----------------------------------------------------------------
500aAA          R SCRN4SP
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.04'
     A            WOHDR1        15   O  1 14
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  3  5'Procesando'
     A                                      DSPATR(HI)
     A                                  3 17'Excepcion '
     A                                      DSPATR(HI)
     A                                  4  2'Producto . . .'
     A            W4ITEM         1A  B  4 17
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  90                                  DSPATR(PR)
610aDA*                                 4 20'(Y,N)'
610aMA            WOYN           3A  O  4 20
     A*    Delete DSPATR below when qty exception support activated.
     A                                  5  2'Cantidad . . .'
     A                                      DSPATR(ND)
     A*    Delete DSPATR below when qty exception support activated.
     A            W5QTY          1A  B  5 17
     A                                      DSPATR(ND PR)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A*    Activate this line when qty exception support activated.
     A* 90                                  DSPATR(PR)
     A*    Delete DSPATR below when qty exception support activated.
610aDA*                                 5 20'(Y,N)'
610aMA*           WOYN           3A  O  5 20
     A*                                     DSPATR(ND)
     A                                  7  1'F12=Cancelar'
     A                                      COLOR(BLU)
500aAA*----------------------------------------------------------------
500aAA          R SCRN5SP
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.05'
     A            WOHDR1        15A  O  1 14
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2 16'Verifica Slot'
     A                                      DSPATR(HI)
     A                                  3  2'Departmento . . . . . . .'
     A            W5WHDP         5A  O  3 28
     A                                  4  2'Slot  . . . . . . . . . .'
     A            W5FMSL        12A  O  4 28
     A                                  5  2'Slot vacio fisicamente. .'
     A            W5ZERO         1A  B  5 28CHECK(ER)
     A  28                                  DSPATR(RI)
     A N28N90                               DSPATR(UL)
     A  08                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
610aDA*                                 5 36'(Y,N)'
610aMA            WOYN           3A  O  5 36
     A                                  7  1'F12=Cancelar'
     A                                      COLOR(BLU)
     A*
500aAA*----------------------------------------------------------------
500aAA          R SCRN6SP
     A                                      CA03
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.6'
640bDA**                                1 14'Reap/Let Downs'
640bMA                                  1 14'Reap          '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
640bDA**                                3  2'Todos letdowns  '
640bMA                                  3  2'Todos reap  '
640bMA            W6WHSE         3S 0O  3 15DSPATR(HI)
640bMA                                  3 19'/'
     A                                      DSPATR(HI)
640bMA            W6WHDP         5A  O  3 21DSPATR(HI)
640bMA                                  3 27'han sido '
     A                                  4  2'procesados. Escanda slot vacio o e-
     A                                      lija'
     A                                  5  2'departamento nuevo para continuar.'
     A                                  7  1'F3=Salir'
     A                                      COLOR(BLU)
     A                                  7 11'F7=Especifico'
     A                                      COLOR(BLU)
     A                                  7 26'F12=Cancelar'
     A                                      COLOR(BLU)
500aAA*----------------------------------------------------------------
     A          R SCRN7SP
     A*%%TS  SD  20121205  112753  RETHA       REL-V6R1M0  5761-WDS
     A                                      CA03
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.7'
640bDA**                                1 15'Reap/Let Downs'
     A                                  1 15'Reap          '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  3  2'Escriba cambios, oprima ENTER.'
     A                                      COLOR(BLU)
417aDA*                                 4  2'Almacen . . .'
600aDA**                                3  2'Almacen . . .'
     A                                  3  2'Whse/Dept . .'
417aDA*           W7WHSE         3Y 0B  4 17
     A            W7WHSE         3Y 0B  3 17
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
417aDA*                                 5  2'Departamento.'
600aDA**                                4  2'Departamento.'
     A                                  3 21'/'
417aDA*           W7WHDP         5A  B  5 17
600aDA**          W7WHDP         5A  B  4 17
     A            W7WHDP         5A  B  3 23
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
640bAA                                  3 29'(or *ALL)'
600aDA**                                6  2'Escl pasillo '
600aDA**          W7RPLT         1A  B  5 17
     A                                  4  2'Escl pasillo '
     A            W7RPLT         1A  B  4 17
     A N25                                  DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90                               DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W7DSPS         1Y 0O  4 32EDTCDE(4)
     A                                      DSPATR(ND)
600aDA**                                5 21'N=Normal,F=Flow,B=Brk'
600aDA**                                6  2'Aisle range .'
600aDA**          W7FAS          3A  B  6 17
     A                                  5  2'Aisle range .'
     A            W7FAS          3A  B  5 17
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
600aDA**                                6 21'hasta'
600aDA**          W7TAS          3A  B  6 27
     A                                  5 21'hasta'
     A            W7TAS          3A  B  5 27
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N24N90                               DSPATR(HI)
     A                                      CHECK(ER)
600aDA**                                6 31'(Nada=todo)'
     A                                  5 31'(Nada=todo)'
     A                                  6  2'      Lado  .'
     A            W7SIDE         1A  B  6 17
     A N26                                  DSPATR(HI)
     A  26                                  DSPATR(RI)
     A N26N90                               DSPATR(UL)
     A  06                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                  6 21'B=Both, E=Even, O=Odd'
     A                                  7  1'F3=Salir'
     A                                      COLOR(BLU)
     A                                  7 10'F5=Refrsc'
     A                                      COLOR(BLU)
     A                                  7 20'F7=Espcific'
     A                                      COLOR(BLU)
     A                                  7 32'F12=Cancelar'
     A                                      COLOR(BLU)
     A*
500aAA*----------------------------------------------------------------
500aAA          R SCRN8SP
     A*%%TS  SD  20000801  072744  MLBLACKNIK  REL-V4R4M0  5769-PW1
710aDA*                                     CF10
710aMA N82                                  CF10
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.08'
     A            WOHDR1        15A  O  1 14DSPATR(HI)
     A            WOHDR2         8A  O  1 33
     A  64                                  DSPATR(RI)
     A            W8ITEM        65A  O  2  1
416aAA                                  3  2'Slot orig :'
416aAA            W8ORSL        12   O  3 14
     A                                  4  2'Balance   :'
     A            W8BALQ         7Y 0O  4 14EDTCDE(3)
     A  65                              4 23'VlvrA'
     A  65        W8RTN2        12   O  4 29DSPATR(HI)
     A                                  5  2'Guardar Cd:'
     A            W8NQTY         7Y 0B  5 14EDTCDE(M)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
     A                                  5 23'VlvrA'
     A            W8SCAN        12A  B  5 29CHECK(ER)
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      DSPATR(HI)
710aDA*                                 7  1'F10=Excpc'
710aMA                                  7  1'F10=Excpt'
710aAA  82                                  DSPATR(ND)
     A                                      COLOR(BLU)
417 AA*
500aAA*----------------------------------------------------------------
500aAA          R SCRN9SP
417 AA                                      WINDOW(1 2 6 20)
417 AA                                      WDWTITLE((*TEXT 'Scan Lot/Lic#') *C-
417 AA                                      ENTER)
417 AA                                      WDWTITLE((*TEXT 'F3/F12=Exit') *BOT-
417 AA                                      TOM)
417 AA                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
417 AA                                          '))
417 AA                                      CA03
417 AA                                      CA12
417 AA  98                                  ALARM
417 AA                                      CLRL(07)
417 AA                                      CSRLOC(WOROW      WOCOL)
417 AA                                      OVERLAY
417 AA            WOROW          3S 0H
417 AA            WOCOL          3S 0H
417 AA            W9ITEM        18A  O  1  1
417 AA            WOTX91        18A  O  2  1
417 AA            W9OLLP        15A  O  3  1
417 AA            WOTX92        18A  O  4  1
417 AA            W9NLLP        15A  B  5  3
417 AA  22                                  DSPATR(RI)
417 AA N22N90                               DSPATR(UL)
417 AA  02                                  DSPATR(PC)
417 AA  90                                  DSPATR(PR)
417 AA                                      DSPATR(HI)
510aAA          R SCREEN61
510aAA                                      CA03
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      CSRLOC(WOROW WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3  0H
510aAA            WOCOL          3  0H
510aAA                                  1  2'LT105.61'
510aAA                                  1 12'Specific Slot Repl. '
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  3  1'Type changes, Enter.'
510aAA                                      COLOR(BLU)
510aAA                                  4  1'Whse '
510aAA            W1WHSE         3Y 0B  4  8
510aAA N21                                  DSPATR(HI)
510aAA  21                                  DSPATR(RI)
510aAA N21N90                               DSPATR(UL)
510aAA  01                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      EDTCDE(4)
510aAA                                  5  1'Dept '
510aAA            W1WHDP         5A  B  5  8
510aAA N22                                  DSPATR(HI)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
720aDA*                                 6  1'Pk slt'
720aMA N83                              6  1'Pk slt'
720aAA  83                              6  1'Pk/LCN'
720aDA*           W1TDIS        12A  B  6  8CHECK(ER)
720aMA            W1SCAN        15A  B  6  8CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA                                      DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA N23N90                               DSPATR(HI)
510aAA                                 14  1'F3=Exit'
510aAA                                      COLOR(BLU)
510aAA                                 14 10'F5=Refresh'
510aAA                                      COLOR(BLU)
510aAA                                 15  1'F12=Cancel'
510aAA                                      COLOR(BLU)
510aAA*
510aAA**************************************************************************
510aAA* Replenishment prompt window                                            *
510aAA**************************************************************************
510aAA          R SCRN10SP
510aAA*%%TS  SD  20070213  171940  JEFF        REL-V5R3M0  5722-WDS
510aAA                                      CA03
640bDA**                                    WINDOW(5 10 6 25)
720cDA**                                    WINDOW(5 10 7 25)
720cMA                                      WINDOW(6 10 8 25)
510aAA                                      OVERLAY
510aAA                                      WDWBORDER((*COLOR RED))
510aAA                                      WDWBORDER((*DSPATR RI))
510aAA                                      WDWBORDER((*CHAR '        '))
510aAA                                      WDWTITLE((*TEXT 'Repl Type'))
510aAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
510aAA            W10TP1         1A  B  2 12
510aAA                                  2  1'Repl Type:'
510aAA                                  2 15'N=Normal'
510aAA                                  3 15'F=Flow'
510aAA                                  4 15'B=Breakdn'
510aAA                                  5 15'R=Repack'
720cAA                                  6 15'S=Staging'
640bAA                                  7 15'A=All Types'
640bAA**************************************************************************
640bAA* JIT notification during specific slot replenishment                    *
640bAA*
640bAA          R SCRN11SP
640bAA                                      CA03
640bAA                                      WINDOW(5 10 6 25)
640bAA                                      OVERLAY
640bAA                                      WDWBORDER((*COLOR RED))
640bAA                                      WDWBORDER((*DSPATR RI))
640bAA                                      WDWBORDER((*CHAR '        '))
640bAA                                      WDWTITLE((*TEXT 'JIT Notice'))
640bAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
640bAA                                  2  2'Los reap JIT existen'
640bAA                                  3  2'desea entrar en reap'
640bAA                                  4  2'JIT ?'
640bAA                                  5  2'Y=si N=no'
640bAA            W11JIT         1A  B  5 13
510aAA          R SCREEN62
510aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
510aAA                                      CA03
510aAA N70                                  CF07
510aAA N70                                  CF08
510aAA N70                                  CF09
510aAA                                      CF10
510bAA N70                                  CF11
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.62'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W2ITEM        65A  O  2  1
510aAA                                  3  1'Fr slt:'
510aAA            W2FMSL        12A  O  3  9
510aAA                                  4  1'To slt:'
510aAA            W2TOSL        12A  O  4  9
700aAA                                  7  1'Slot qty:'
700aAA            W2SLTQ         7Y 0O  7 11EDTCDE(3)
700aAA            W2UM1A         2A  O  7 19
700aAA                                  7 24'Ti/Hi:'
700aAA            W2TIE          3Y 0O  7 31EDTCDE(4)
700aAA                                  7 35'/'
700aAA            W2HIGH         3Y 0O  7 37EDTCDE(4)
700aAA                                  8  1'Repl qty:'
700aAA            W2REPQ         7Y 0O  8 11EDTCDE(3)
700aAA            W2UM2A         2A  O  8 19
700aDA**                                5 24'Ordq :'
700aDA**          W2ORDQ         5Y 0O  5 31EDTCDE(L)
700aDA**          W2TPRP         3Y 0O  5 38EDTCDE(4)
700aAA                                  6  1'Ordq :'
510aAA N61                                  DSPATR(ND)
700aAA            W2ORDQ         5Y 0O  6  8EDTCDE(L)
510aAA N61                                  DSPATR(ND)
700aAA            W2TPRP         5Y 0O  6 16EDTCDE(4)
510aAA                                      DSPATR(ND)
700aAA                                 10  1'Qty pull:'
700aAA            W2NQTY         7Y 0B 10 11EDTCDE(4)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
700aAA            W2UM3A         2A  O 10 19
700aAA                                 11  2'From'
700aAA            W2SCAN        12A  B 11  9CHECK(ER)
510aAA  24                                  DSPATR(RI)
510aAA N24N90                               DSPATR(UL)
510aAA N04
510aAAO 04                                  DSPATR(PC)
510aAA  70
510aAAO 90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA            W2QTY          7S 0O  6 60DSPATR(ND)
510aAA*N70                              7  1'F7=Specific'
510aAA N70                             14  1'F7=Spc'
510aAA                                      COLOR(BLU)
510aAA N70                             14  8'F8=Lst'
510aAA                                      COLOR(BLU)
510aAA N70                             14 15'F9=Skp'
510aAA                                      COLOR(BLU)
510aAA                                 15  1'F10=Excpt'
510aAA                                      COLOR(BLU)
510bDA*                                15 11'F12=Cancel'
510bMA  70                             15 11'F12=Cancel'
510bMA N70                             15 11'F11=Tfr'
510aAA                                      COLOR(BLU)
510aAA*
510aAA          R SCREEN63
510aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
510aAA*                                     CF10
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.63'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W3ITEM        65A  O  2  1
510aAA                                  3  1'To slt:'
510aAA            W3TOSL        12A  O  3  9
510aAA                                  4  1'Pull qty:'
510aAA            W3PULQ         7Y 0O  4 11EDTCDE(3)
510aAA            W3UM1A         2A  O  4 19
510aAA                                  4 24'Tie/Hi:'
700bDA*           W3TIE          3Y 0O  4 32EDTCDE(4)
700bDA*                                 4 36'/'
700bDA*           W3HIGH         3Y 0O  4 38EDTCDE(4)
700bMA            W3TIE          4Y 0O  4 32EDTCDE(4)
700bMA                                  4 37'/'
700bMA            W3HIGH         3Y 0O  4 39EDTCDE(4)
510aAA                                  5  1'Repl qty:'
510aAA            W3REPQ         7Y 0O  5 11EDTCDE(3)
510aAA            W3UM2A         2A  O  5 19
510aAA  63                              5 24'Balance:'
510aAA  63        W3BALQ         7Y 0O  5 33EDTCDE(L)
510aAA                                  7  1'Qty rpl:'
510aAA            W3NQTY         7Y 0B  7 10EDTCDE(M)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA            W3UM3A         2A  O  7 19
510aAA                                  8  5'To:'
510aAA            W3SCAN        12A  B  8  9CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA*                                 7  1'F10=Excpt'
510aAA*                                     COLOR(BLU)
510aAA                                 15  1'F12=Cancel'
510aAA                                      COLOR(BLU)
510aAA          R SCREEN64
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.64'
510aAA            WOHDR1        15   O  1 14
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  3  1'Exception'
510aAA                                      DSPATR(HI)
510aAA                                  3 11'Processing'
510aAA                                      DSPATR(HI)
510aAA                                  4  2'Item . . .'
510aAA            W4ITEM         1A  B  4 13
510aAA  21                                  DSPATR(RI)
510aAA N21N90                               DSPATR(UL)
510aAA  90                                  DSPATR(PR)
610aDA*                                 4 16'(Y,N)'
610aMA            WOYN           3A  O  4 16
510aAA*    Delete DSPATR below when qty exception support activated.
510aAA                                  5  2'Quantity .'
510aAA                                      DSPATR(ND)
510aAA*    Delete DSPATR below when qty exception support activated.
510aAA            W5QTY          1A  B  5 17
510aAA                                      DSPATR(ND PR)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA*    Activate this line when qty exception support activated.
510aAA* 90                                  DSPATR(PR)
510aAA*    Delete DSPATR below when qty exception support activated.
610aDA*                                 5 16'(Y,N)'
610aMA*           WOYN           3A  O  5 16
510aAA*                                     DSPATR(ND)
510aAA                                 15  1'F12=Cancel'
510aAA                                      COLOR(BLU)
510aAA          R SCREEN65
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.65'
510aAA            WOHDR1        15A  O  1 14
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  2  7'Verify Slot'
510aAA                                      DSPATR(HI)
510aAA                                  3  2'Dept:'
510aAA            W5WHDP         5A  O  3  9
510aAA                                  4  2'Slot:'
510aAA            W5FMSL        12A  O  4  9
510aAA                                  5  2'Slot empty?'
510aAA            W5ZERO         1A  B  5 14CHECK(ER)
510aAA  28                                  DSPATR(RI)
510aAA N28N90                               DSPATR(UL)
510aAA  08                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
610aDA*                                 5 16'(Y,N)'
610aMA            WOYN           3A  O  5 16
510aAA                                 15  1'F12=Cancel'
510aAA                                      COLOR(BLU)
510aAA*
510aAA          R SCREEN66
510aAA                                      CA03
510aAA                                      CF07
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.66'
640bDA**                                1 14'Repl/Let Downs'
640bMA                                  1 14'Replenishments'
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  2  2' '
510aAA                                      DSPATR(PC)
640bDA**                                3  2'All let downs in'
640bMA                                  3  2'All repls in'
510aAA            W6WHSE         3S 0O  4  2DSPATR(HI)
510aAA                                  4  6'/'
510aAA                                      DSPATR(HI)
510aAA            W6WHDP         5A  O  4  8DSPATR(HI)
510aAA                                  5  2'have been processed'
510aAA                                  6  2'Scan empty slot or'
510aAA                                  7  2'select new dept to'
510aAA                                  8  2'continue.'
510aAA                                 14  1'F3=Exit'
510aAA                                      COLOR(BLU)
510aAA                                 14 10'F7=Specific'
510aAA                                      COLOR(BLU)
510aAA                                 15 23'F12=Cancel'
510aAA                                      COLOR(BLU)
     A          R SCREEN67
     A*%%TS  SD  20121205  112753  RETHA       REL-V6R1M0  5761-WDS
     A                                      CA03
     A                                      CF04
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(15)
     A                                      CSRLOC(WOROW      WOCOL)
     A                                      OVERLAY
     A            WOROW          3S 0H
     A            WOCOL          3S 0H
     A                                  1  2'LT105.67'
640bDA**                                1 15'Repl/Let Downs'
     A                                  1 15'Replenishments'
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
510aAA*                                 4  2'Warehouse . .'
     A                                  3  2'Whse :'
     A                                  3  2'Whse :'
510aAA*           W7WHSE         3Y 0B  4 17
     A            W7WHSE         3Y 0B  3  9
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
510aAA*                                 5  2'Department  .'
     A                                  4  2'Dept :'
510aAA*           W7WHDP         5A  B  5 17
     A            W7WHDP         5A  B  4  9
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
640bAA                                  4 15'(*ALL)'
     A            W7DSPS         1Y 0O  4 32EDTCDE(4)
     A                                      DSPATR(ND)
     A                                  5  2'Type :'
     A            W7RPLT         1A  B  5  9
     A N25                                  DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90                               DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
510aAA***                               5 21'N=Normal,F=Flow,B=Brk'
640bAA                                  5 11'(A=ALL)'
     A                                  6  2'Aisle:'
     A            W7FAS          3A  B  6  9
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
     A                                  6 13'thru'
     A            W7TAS          3A  B  6 18
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N24N90                               DSPATR(HI)
     A                                      CHECK(ER)
     A                                  6 21'B=Both, E=Even, O=Odd'
     A                                  7  9'(Blank=All)'
     A                                  8  2'      Side  .'
     A            W7SIDE         1A  B  8 17
     A N26                                  DSPATR(HI)
     A  26                                  DSPATR(RI)
     A N26N90                               DSPATR(UL)
     A  06                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                 14  1'F3=Exit'
     A                                      COLOR(BLU)
     A                                 14  9'F5=Refrsh'
     A                                      COLOR(BLU)
     A                                 15  1'F7=Specific'
     A                                      COLOR(BLU)
     A                                 15 13'F12=Cnl'
     A                                      COLOR(BLU)
510aAA*
510aAA          R SCREEN68
510aAA*%%TS  SD  20000801  072744  MLBLACKNIK  REL-V4R4M0  5769-PW1
710aDA*                                     CF10
710aMA N82                                  CF10
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.68'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W8ITEM        65A  O  2  1
510aAA                                  3  1'Org slt'
510aAA            W8ORSL        12   O  3  9
510aAA                                  4  1'Balance'
510aAA            W8BALQ         7Y 0O  4  9EDTCDE(3)
510aAA  65                              5  1'Rtn To'
510aAA  65        W8RTN2        12   O  5  9DSPATR(HI)
510aAA                                  7  1'Qty putawy:'
510aAA            W8NQTY         7Y 0B  7 13EDTCDE(M)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA                                  8  1'Rtn To'
510aAA            W8SCAN        12A  B  8  9CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
710aDA*                                15  1'F10=Excpt'
710aMA                                 15  1'F10=Excpt'
710aAA  82                                  DSPATR(ND)
510aAA                                      COLOR(BLU)
510aAA*
510aAA          R SCREEN69
510aAA                                      WINDOW(1 2 6 20)
510aAA                                      WDWTITLE((*TEXT 'Scan Lot/Lic#') *C-
510aAA                                      ENTER)
510aAA                                      WDWTITLE((*TEXT 'F3/F12=Exit') *BOT-
510aAA                                      TOM)
510aAA                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
510aAA                                          '))
510aAA                                      CA03
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(15)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA            W9ITEM        18A  O  1  1
510aAA            WOTX91        18A  O  2  1
510aAA            W9OLLP        15A  O  3  1
510aAA            WOTX92        18A  O  4  1
510aAA            W9NLLP        15A  B  5  3
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA**********************
610aAA          R SCREEN72
610aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
610aAA                                      CA03
610aAA N70                                  CF07
610aAA N70                                  CF08
610aAA N70                                  CF09
610aAA                                      CF10
610bAA N70                                  CF11
610aAA                                      CA12
610aAA  98                                  ALARM
610aAA                                      CLRL(15)
610aAA                                      CSRLOC(WOROW      WOCOL)
610aAA                                      OVERLAY
610aAA            WOROW          3S 0H
610aAA            WOCOL          3S 0H
610aAA                                  1  2'LT105.72'
610aAA            WOHDR1        15A  O  1 14DSPATR(HI)
610aAA            WOHDR2         8A  O  1 33
610aAA  64                                  DSPATR(RI)
610aAA*           W2ITEM        65A  O  2  1
     A            W2ITM         15A  O  2  2
     A            W2IT1         15A  O  3  2
     A            W2IT2         15A  O  4  2
     A            W2IT3         15A  O  5  2
610aAA                                  6  1'Fr slt:'
610aAA            W2FMSL        12A  O  6  9
610aAA                                  7  1'To slt:'
610aAA            W2TOSL        12A  O  7  9
610aAA                                  9  1'Slot qty:'
610aAA            W2SLTQ         7Y 0O  9 11EDTCDE(3)
610aAA            W2UM1A         2A  O  9 19
610aAA                                 11  2'Ti/Hi:'
610aAA            W2TIE          3Y 0O 11  9EDTCDE(4)
610aAA                                 11 13'/'
610aAA            W2HIGH         3Y 0O 11 15EDTCDE(4)
610aAA                                 10  1'Repl qty:'
610aAA            W2REPQ         7Y 0O 10 11EDTCDE(3)
610aAA            W2UM2A         2A  O 10 19
610aAA                                  8  2'Ordq :'
610aAA N61                                  DSPATR(ND)
610aAA            W2ORDQ         5Y 0O  8  9EDTCDE(L)
610aAA N61                                  DSPATR(ND)
610aAA            W2TPRP         5Y 0O  8 17EDTCDE(4)
610aAA                                      DSPATR(ND)
610aAA                                 12  1'Qty pull:'
610aAA            W2NQTY         7Y 0B 12 11EDTCDE(4)
610aAA  23                                  DSPATR(RI)
610aAA N23N90                               DSPATR(UL)
610aAA  03                                  DSPATR(PC)
610aAA  90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA            W2UM3A         2A  O 12 19
610aAA                                 13  2'From'
610aAA            W2SCAN        12A  B 13  9CHECK(ER)
610aAA  24                                  DSPATR(RI)
610aAA N24N90                               DSPATR(UL)
610aAA N04
610aAAO 04                                  DSPATR(PC)
610aAA  70
610aAAO 90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA            W2QTY          7S 0O  9 60DSPATR(ND)
610aAA N70                             14  1'F7=Spc'
610aAA                                      COLOR(BLU)
610aAA N70                             14  8'F8=Lst'
610aAA                                      COLOR(BLU)
610aAA N70                             14 15'F9=Skp'
610aAA                                      COLOR(BLU)
610aAA                                 15  1'F10=Excpt'
610aAA                                      COLOR(BLU)
610aAA  70                             15 11'F12=Cancel'
610aAA N70                             15 11'F11=Tfr'
610aAA                                      COLOR(BLU)
610aAA*
610aAA          R SCREEN73
610aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
610aAA*                                     CF10
610aAA                                      CA12
610aAA  98                                  ALARM
610aAA                                      CLRL(15)
610aAA                                      CSRLOC(WOROW      WOCOL)
610aAA                                      OVERLAY
610aAA            WOROW          3S 0H
610aAA            WOCOL          3S 0H
610aAA                                  1  2'LT105.73'
610aAA            WOHDR1        15A  O  1 14DSPATR(HI)
610aAA            WOHDR2         8A  O  1 33
610aAA  64                                  DSPATR(RI)
610aAA*           W3ITEM        65A  O  2  1
     A            W3ITM         15A  O  2  2
     A            W3IT1         15A  O  3  2
     A            W3IT2         15A  O  4  2
     A            W3IT3         15A  O  5  2
610aAA                                  6  1'To slt:'
610aAA            W3TOSL        12A  O  6  9
610aAA                                  8  1'Pull qty:'
610aAA            W3PULQ         7Y 0O  8 11EDTCDE(3)
610aAA            W3UM1A         2A  O  8 19
610aAA                                  7  1'Tie/Hi:'
700bDA*           W3TIE          3Y 0O  7  9EDTCDE(4)
700bDA*                                 7 13'/'
700bDA*           W3HIGH         3Y 0O  7 15EDTCDE(4)
700bMA            W3TIE          4Y 0O  7  9EDTCDE(4)
700bMA                                  7 14'/'
700bMA            W3HIGH         3Y 0O  7 16EDTCDE(4)
610aAA                                  9  1'Repl qty:'
610aAA            W3REPQ         7Y 0O  9 11EDTCDE(3)
610aAA            W3UM2A         2A  O  9 19
610aAA  63                             10  2'Balance:'
610aAA  63        W3BALQ         7Y 0O 10 11EDTCDE(L)
610aAA                                 11  1'Qty rpl:'
610aAA            W3NQTY         7Y 0B 11 10EDTCDE(M)
610aAA  22                                  DSPATR(RI)
610aAA N22N90                               DSPATR(UL)
610aAA  02                                  DSPATR(PC)
610aAA  90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA            W3UM3A         2A  O 11 19
610aAA                                 12  5'To:'
610aAA            W3SCAN        12A  B 12  9CHECK(ER)
610aAA  23                                  DSPATR(RI)
610aAA N23N90                               DSPATR(UL)
610aAA  03                                  DSPATR(PC)
610aAA  90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA*                                 7  1'F10=Excpt'
610aAA*                                     COLOR(BLU)
610aAA                                 15  1'F12=Cancel'
610aAA                                      COLOR(BLU)
610aAA          R SCREEN78
610aAA*%%TS  SD  20000801  072744  MLBLACKNIK  REL-V4R4M0  5769-PW1
610aAA                                      CF10
610aAA  98                                  ALARM
610aAA                                      CLRL(15)
610aAA                                      CSRLOC(WOROW      WOCOL)
610aAA                                      OVERLAY
610aAA            WOROW          3S 0H
610aAA            WOCOL          3S 0H
610aAA                                  1  2'LT105.78'
610aAA            WOHDR1        15A  O  1 14DSPATR(HI)
610aAA            WOHDR2         8A  O  1 33
610aAA  64                                  DSPATR(RI)
610aAA*           W8ITEM        65A  O  2  1
     A            W8ITM         15A  O  2  2
     A            W8IT1         15A  O  3  2
     A            W8IT2         15A  O  4  2
     A            W8IT3         15A  O  5  2
610aAA                                  6  1'Org slt'
610aAA            W8ORSL        12   O  6  9
610aAA                                  7  1'Balance'
610aAA            W8BALQ         7Y 0O  7  9EDTCDE(3)
610aAA  65                              8  1'Rtn To'
610aAA  65        W8RTN2        12   O  8  9DSPATR(HI)
610aAA                                 10  1'Qty putawy:'
610aAA            W8NQTY         7Y 0B 10 13EDTCDE(M)
610aAA  22                                  DSPATR(RI)
610aAA N22N90                               DSPATR(UL)
610aAA  02                                  DSPATR(PC)
610aAA  90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA                                 11  1'Rtn To'
610aAA            W8SCAN        12A  B 11  9CHECK(ER)
610aAA  23                                  DSPATR(RI)
610aAA N23N90                               DSPATR(UL)
610aAA  03                                  DSPATR(PC)
610aAA  90                                  DSPATR(PR)
610aAA                                      DSPATR(HI)
610aAA                                 15  1'F10=Excpt'
610aAA                                      COLOR(BLU)
510aAA**************************************************************************
510aAA* Replenishment prompt window                                            *
510aAA**************************************************************************
510aAA          R SCRN610
510aAA*%%TS  SD  20070213  171940  JEFF        REL-V5R3M0  5722-WDS
510aAA                                      CA03
640bDA**                                    WINDOW(1 2 6 25)
720cDA**                                    WINDOW(1 2 7 25)
720cMA                                      WINDOW(1 2 8 25)
510aAA                                      OVERLAY
510aAA                                      WDWBORDER((*COLOR RED))
510aAA                                      WDWBORDER((*DSPATR RI))
510aAA                                      WDWBORDER((*CHAR '        '))
510aAA                                      WDWTITLE((*TEXT 'Repl Type'))
510aAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
510aAA            W10TP1         1A  B  2 12
510aAA                                  2  1'Repl Type:'
510aAA                                  2 15'N=Normal'
510aAA                                  3 15'F=Flow'
510aAA                                  4 15'B=Breakdn'
510aAA                                  5 15'R=Repack'
720cAA                                  6 15'S=Staging'
640bAA                                  7 15'A=All Types'
510aAA*
640bAA**************************************************************************
640bAA* JIT notification during specific slot replenishment                    *
640bAA*
640bAA          R SCRN611
640bAA                                      CA03
640bAA                                      WINDOW(1 2 6 25)
640bAA                                      OVERLAY
640bAA                                      WDWBORDER((*COLOR RED))
640bAA                                      WDWBORDER((*DSPATR RI))
640bAA                                      WDWBORDER((*CHAR '        '))
640bAA                                      WDWTITLE((*TEXT 'JIT Notice'))
640bAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
640bAA                                  2  2'JIT exists, do you'
640bAA                                  3  2'wish to go into JIT'
640bAA                                  4  2'replenishments ?'
640bAA                                  5  2'Y=Yes N=No'
640bAA            W11JIT         1A  B  5 13
510aAA*
510aAA* Error Message Subfile Records
510aAA*
510aAA*    Error Message Subfile Record
510aAA*
510aAA          R M16REC                    SFL
510aAA                                      SFLMSGRCD(16)
510aAA            #MSGK                     SFLMSGKEY
510aAA            #PGMQ                     SFLPGMQ
510aAA*
510aAA*    Error Message Subfile Control Record
510aAA*
510aAA          R M16CTL                    SFLCTL(M16REC)
510aAA  98                                  ALARM
510aAA                                      LOCK
510aAA                                      OVERLAY
510aAA                                      SFLSIZ(2) SFLPAG(1)
510aAA N97                                  SFLCLR
510aAA  97                                  SFLDSP
510aAA  97                                  SFLEND
510aAA          R M16CLR
510aAA                                      OVERLAY
510aAA                                      LOCK
510aAA                                      SLNO(16)
510aAA                                      CLRL(1)
510aAA**                                    CLRL(17)
510aAA*
510aAA*****************************************************************
510aAA* Spanish Screens
510aAA*****************************************************************
510aAA*----------------------------------------------------------------
510aAA          R SCRN61SP
510aAA                                      CA03
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      CSRLOC(WOROW WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3  0H
510aAA            WOCOL          3  0H
510aAA                                  1  2'LT105.61'
510aAA                                  1 12'Reap. Slot especifico'
510aAA                                      DSPATR(HI)
510aAA                                  1 34DATE
510aAA                                      EDTCDE(Y)
510aAA                                  3  2'Escriba cambios, Oprima Enter'
510aAA                                      COLOR(BLU)
510aAA                                  4  2'Almacen . . . .'
510aAA            W1WHSE         3Y 0B  4 19
510aAA N21                                  DSPATR(HI)
510aAA  21                                  DSPATR(RI)
510aAA N21N90                               DSPATR(UL)
510aAA  01                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      EDTCDE(4)
510aAA                                  5  2'Departamento. .'
510aAA            W1WHDP         5A  B  5 19
510aAA N22                                  DSPATR(HI)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
720aDA*                                 6  2'Pick slot . . .'
720aMA N83                              6  2'Pick slot . . .'
720aAA  83                              6  2'Pick slot/Lcns.'
720aDA*           W1TDIS        12A  B  6 19CHECK(ER)
720aMA            W1SCAN        15A  B  6 19CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA                                      DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA N23N90                               DSPATR(HI)
510aAA                                  7  1'F3=Salir'
510aAA                                      COLOR(BLU)
510aAA                                  7 11'F5=Refrescar'
510aAA                                      COLOR(BLU)
510aAA                                  7 25'F12=Cancelar'
510aAA                                      COLOR(BLU)
510aAA*
510aAA*----------------------------------------------------------------
510aAA          R SCRN62SP
510aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
510aAA                                      CA03
510aAA N70                                  CF07
510aAA N70                                  CF08
510aAA N70                                  CF09
510aAA                                      CF10
510bAA N70                                  CF11
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.62'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W2ITEM        65A  O  2  1
510aAA                                  3  1'De slot :'
510aAA            W2FMSL        12A  O  3 11
510aAA                                  3 24' A:'
510aAA            W2TOSL        12A  O  3 28
510aAA                                  4  1'ctd de    :'
510aAA            W2SLTQ         7Y 0O  4 13EDTCDE(3)
510aAA            W2UM1A         2A  O  4 21
510aAA                                  4 24'Ti/Hi:'
510aAA            W2TIE          3Y 0O  4 31EDTCDE(4)
510aAA                                  4 35'/'
510aAA            W2HIGH         3Y 0O  4 37EDTCDE(4)
510aAA                                  5  1'Ctd reap  :'
510aAA            W2REPQ         7Y 0O  5 13EDTCDE(3)
510aAA            W2UM2A         2A  O  5 21
510aAA                                  5 24'CdPed:'
510aAA N61                                  DSPATR(ND)
510aAA            W2ORDQ         5Y 0O  5 31EDTCDE(L)
510aAA N61                                  DSPATR(ND)
510aAA            W2TPRP         5Y 0O  5 38EDTCDE(4)
510aAA                                      DSPATR(ND)
510aAA                                  6  1'Ctd escogi:'
510aAA            W2NQTY         7Y 0B  6 13EDTCDE(4)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA            W2UM3A         2A  O  6 21
510aAA                                  6 24'De  '
510aAA            W2SCAN        12A  B  6 29CHECK(ER)
510aAA  24                                  DSPATR(RI)
510aAA N24N90                               DSPATR(UL)
510aAA N04
510aAAO 04                                  DSPATR(PC)
510aAA  70
510aAAO 90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA            W2QTY          7S 0O  6 60DSPATR(ND)
510aAA*N70                              7  1'F7=Espcific'
510aAA N70                              7  1'F7=Especifico'
510aAA                                      COLOR(BLU)
510aAA N70                              7 15'F8=Lista'
510aAA                                      COLOR(BLU)
510aAA N70                              7 25'F9=Pasar'
510aAA                                      COLOR(BLU)
510aAA                                  7 35'F10=Excpt'
510aAA                                      COLOR(BLU)
510bDA*                                 7 38'F12=Cancelar'
510bMA  70                              7 38'F12=Cancelar'
510bMA N70                              7 38'F11=Tfr'
510aAA                                      COLOR(BLU)
510aAA*
510aAA*----------------------------------------------------------------
510aAA          R SCRN63SP
510aAA*%%TS  SD  20000807  120944  MLBLACKNIK  REL-V4R4M0  5769-PW1
510aAA*                                     CF10
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.63'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W3ITEM        65A  O  2  1
510aAA                                  3  2'A slot  :'
510aAA            W3TOSL        12A  O  3 12
510aAA                                  4  2'Ctd jale:'
510aAA            W3PULQ         7Y 0O  4 12EDTCDE(3)
510aAA            W3UM1A         2A  O  4 21
510aAA                                  4 24'Tie/Hi:'
700bDA*           W3TIE          3Y 0O  4 32EDTCDE(4)
700bDA*                                 4 36'/'
700bDA*           W3HIGH         3Y 0O  4 38EDTCDE(4)
700bMA            W3TIE          4Y 0O  4 32EDTCDE(4)
700bMA                                  4 37'/'
700bMA            W3HIGH         3Y 0O  4 39EDTCDE(4)
510aAA                                  5  2'Ctd reap:'
510aAA            W3REPQ         7Y 0O  5 12EDTCDE(3)
510aAA            W3UM2A         2A  O  5 21
510aAA  63                              5 24'Balance:'
510aAA  63        W3BALQ         7Y 0O  5 33EDTCDE(L)
510aAA                                  6  2'Ctd reap:'
510aAA            W3NQTY         7Y 0B  6 12EDTCDE(M)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA            W3UM3A         2A  O  6 21
510aAA                                  6 24' A :'
510aAA            W3SCAN        12A  B  6 29CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA*                                 7  1'F10=Excpc'
510aAA*                                     COLOR(BLU)
510aAA                                  7  1'F12=Cancelar'
510aAA                                      COLOR(BLU)
510aAA*----------------------------------------------------------------
510aAA          R SCRN64SP
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.64'
510aAA            WOHDR1        15   O  1 14
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  3  5'Procesando'
510aAA                                      DSPATR(HI)
510aAA                                  3 17'Excepcion '
510aAA                                      DSPATR(HI)
510aAA                                  4  2'Producto . . .'
510aAA            W4ITEM         1A  B  4 17
510aAA  21                                  DSPATR(RI)
510aAA N21N90                               DSPATR(UL)
510aAA  90                                  DSPATR(PR)
610aDA*                                 4 20'(Y,N)'
610aMA            WOYN           3A  O  4 20
510aAA*    Delete DSPATR below when qty exception support activated.
510aAA                                  5  2'Cantidad . . .'
510aAA                                      DSPATR(ND)
510aAA*    Delete DSPATR below when qty exception support activated.
510aAA            W5QTY          1A  B  5 17
510aAA                                      DSPATR(ND PR)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA*    Activate this line when qty exception support activated.
510aAA* 90                                  DSPATR(PR)
510aAA*    Delete DSPATR below when qty exception support activated.
610aDA*                                 5 20'(Y,N)'
610aMA*           WOYN           3A  O  5 20
510aAA*                                     DSPATR(ND)
510aAA                                  7  1'F12=Cancelar'
510aAA                                      COLOR(BLU)
510aAA*----------------------------------------------------------------
510aAA          R SCRN65SP
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.65'
510aAA            WOHDR1        15A  O  1 14
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  2 16'Verifica Slot'
510aAA                                      DSPATR(HI)
510aAA                                  3  2'Departmento . . . . . . .'
510aAA            W5WHDP         5A  O  3 28
510aAA                                  4  2'Slot  . . . . . . . . . .'
510aAA            W5FMSL        12A  O  4 28
510aAA                                  5  2'Slot vacio fisicamente. .'
510aAA            W5ZERO         1A  B  5 28CHECK(ER)
510aAA  28                                  DSPATR(RI)
510aAA N28N90                               DSPATR(UL)
510aAA  08                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
610aDA*                                 5 36'(Y,N)'
610aMA            WOYN           3A  O  5 36
510aAA                                  7  1'F12=Cancelar'
510aAA                                      COLOR(BLU)
510aAA*
510aAA*----------------------------------------------------------------
510aAA          R SCRN66SP
510aAA                                      CA03
510aAA                                      CF07
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      OVERLAY
510aAA                                  1  2'LT105.66'
640bDA**                                1 14'Reap/Let Downs'
640bMA                                  1 14'Reap          '
510aAA                                      DSPATR(HI)
510aAA                                  1 33DATE
510aAA                                      EDTCDE(Y)
510aAA                                  2  2' '
510aAA                                      DSPATR(PC)
640bDA**                                3  2'Todos letdowns  '
640bMA                                  3  2'Todos reap  '
640bMA            W6WHSE         3S 0O  3 15DSPATR(HI)
640bMA                                  3 19'/'
510aAA                                      DSPATR(HI)
640bMA            W6WHDP         5A  O  3 21DSPATR(HI)
640bMA                                  3 27'han sido '
510aAA                                  4  2'procesados. Escanda slot vacio o e-
510aAA                                      lija'
510aAA                                  5  2'departamento nuevo para continuar.'
510aAA                                  7  1'F3=Salir'
510aAA                                      COLOR(BLU)
510aAA                                  7 11'F7=Especifico'
510aAA                                      COLOR(BLU)
510aAA                                  7 26'F12=Cancelar'
510aAA                                      COLOR(BLU)
510aAA*----------------------------------------------------------------
     A          R SCRN67SP
     A*%%TS  SD  20121205  112753  RETHA       REL-V6R1M0  5761-WDS
     A                                      CA03
     A                                      CF07
     A                                      CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.67'
640bDA**                                1 15'Reap/Let Downs'
     A                                  1 15'Reap          '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  3  2'Escriba cambios, oprima ENTER.'
     A                                      COLOR(BLU)
510aAA*                                 4  2'Almacen . . .'
     A                                  3  2'Almacen . . .'
510aAA*           W7WHSE         3Y 0B  4 17
     A            W7WHSE         3Y 0B  3 17
     A N21                                  DSPATR(HI)
     A  21                                  DSPATR(RI)
     A N21N90                               DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                      EDTCDE(4)
510aAA*                                 5  2'Departamento.'
     A                                  4  2'Departamento.'
510aAA*           W7WHDP         5A  B  5 17
     A            W7WHDP         5A  B  4 17
     A N22                                  DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90                               DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
640bAA                                  4 23'(*ALL)'
     A            W7DSPS         1Y 0O  4 32EDTCDE(4)
     A                                      DSPATR(ND)
     A            W7RPLT         1A  B  5 17
     A N25                                  DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90                               DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                  5 21'N=Normal,F=Flow,B=Brk'
     A                                  6  2'Escl pasillo '
     A                                  6  2'Aisle range .'
     A            W7FAS          3A  B  6 17
     A  23                                  DSPATR(RI)
     A N23N90                               DSPATR(UL)
     A                                      DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N23N90                               DSPATR(HI)
     A                                  6 21'hasta'
     A            W7TAS          3A  B  6 27
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A N24N90                               DSPATR(HI)
     A                                      CHECK(ER)
     A                                  6 31'(Nada=todo)'
     A                                  7  1'F3=Salir'
     A                                      COLOR(BLU)
     A                                  7 10'F5=Refrsc'
     A                                      COLOR(BLU)
     A                                  7 20'F7=Espcific'
     A                                      COLOR(BLU)
     A                                  7 32'F12=Cancelar'
     A                                      COLOR(BLU)
510aAA*
510aAA*----------------------------------------------------------------
510aAA          R SCRN68SP
510aAA*%%TS  SD  20000801  072744  MLBLACKNIK  REL-V4R4M0  5769-PW1
710aDA*                                     CF10
710aMA N82                                  CF10
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA                                  1  2'LT105.68'
510aAA            WOHDR1        15A  O  1 14DSPATR(HI)
510aAA            WOHDR2         8A  O  1 33
510aAA  64                                  DSPATR(RI)
510aAA            W8ITEM        65A  O  2  1
510aAA                                  3  2'Slot orig :'
510aAA            W8ORSL        12   O  3 14
510aAA                                  4  2'Balance   :'
510aAA            W8BALQ         7Y 0O  4 14EDTCDE(3)
510aAA  65                              4 23'VlvrA'
510aAA  65        W8RTN2        12   O  4 29DSPATR(HI)
510aAA                                  5  2'Guardar Cd:'
510aAA            W8NQTY         7Y 0B  5 14EDTCDE(M)
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA                                  5 23'VlvrA'
510aAA            W8SCAN        12A  B  5 29CHECK(ER)
510aAA  23                                  DSPATR(RI)
510aAA N23N90                               DSPATR(UL)
510aAA  03                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
710aDA*                                 7  1'F10=Excpc'
710aMA                                  7  1'F10=Excpt'
710aAA  82                                  DSPATR(ND)
510aAA                                      COLOR(BLU)
510aAA*
510aAA*----------------------------------------------------------------
510aAA          R SCRN69SP
510aAA                                      WINDOW(1 2 6 20)
510aAA                                      WDWTITLE((*TEXT 'Scan Lot/Lic#') *C-
510aAA                                      ENTER)
510aAA                                      WDWTITLE((*TEXT 'F3/F12=Exit') *BOT-
510aAA                                      TOM)
510aAA                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
510aAA                                          '))
510aAA                                      CA03
510aAA                                      CA12
510aAA  98                                  ALARM
510aAA                                      CLRL(07)
510aAA                                      CSRLOC(WOROW      WOCOL)
510aAA                                      OVERLAY
510aAA            WOROW          3S 0H
510aAA            WOCOL          3S 0H
510aAA            W9ITEM        18A  O  1  1
510aAA            WOTX91        18A  O  2  1
510aAA            W9OLLP        15A  O  3  1
510aAA            WOTX92        18A  O  4  1
510aAA            W9NLLP        15A  B  5  3
510aAA  22                                  DSPATR(RI)
510aAA N22N90                               DSPATR(UL)
510aAA  02                                  DSPATR(PC)
510aAA  90                                  DSPATR(PR)
510aAA                                      DSPATR(HI)
510aAA**************************************************************************
510aAA* Replenishment prompt window                                            *
510aAA**************************************************************************
510aAA          R SCR610SP
510aAA*%%TS  SD  20070213  171940  JEFF        REL-V5R3M0  5722-WDS
510aAA                                      CA03
640bDA**                                    WINDOW(5 10 6 25)
720cDA**                                    WINDOW(5 10 7 25)
720cMA                                      WINDOW(5 10 8 25)
510aAA                                      OVERLAY
510aAA                                      WDWBORDER((*COLOR RED))
510aAA                                      WDWBORDER((*DSPATR RI))
510aAA                                      WDWBORDER((*CHAR '        '))
510aAA                                      WDWTITLE((*TEXT 'Repl Type'))
510aAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
510aAA            W10TP1         1A  B  2 12
510aAA                                  2  1'Repl Type:'
510aAA                                  2 15'N=Normal'
510aAA                                  3 15'F=Flow'
510aAA                                  4 15'B=Breakdn'
510aAA                                  5 15'R=Repack'
720cAA                                  6 15'S=Staging'
720cAA                                  7 15'A=All Types'
640bAA**************************************************************************
640bAA* JIT notification during specific slot replenishment                    *
640bAA*
640bAA          R SCR611SP
640bAA                                      CA03
640bAA                                      WINDOW(5 10 6 25)
640bAA                                      OVERLAY
640bAA                                      WDWBORDER((*COLOR RED))
640bAA                                      WDWBORDER((*DSPATR RI))
640bAA                                      WDWBORDER((*CHAR '        '))
640bAA                                      WDWTITLE((*TEXT 'JIT Notice'))
640bAA                                      WDWTITLE((*TEXT 'F3=EXIT') *BOTTOM)
640bAA                                  2  2'Los reap JIT existen'
640bAA                                  3  2'desea entrar en reap'
640bAA                                  4  2'JIT ?'
640bAA                                  5  2'Y=si N=no'
640bAA            W11JIT         1A  B  5 13
     A*----------------------------------------------------------------
     A*         R SCRN6SP
640aAA          R SCN6ASP
640aAA*%%TS  SD  20110823  091023  BFC         REL-V7R1M0  5770-WDS
640aAA*                                     CA03
640aAA*                                     CF07
640aAA*                                     CA12
     A  98                                  ALARM
     A                                      CLRL(07)
     A                                      OVERLAY
     A                                  1  2'LT105.6a'
640bDA**                                1 15'Reap/Let Downs'
640bMA                                  1 15'Reap          '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
     A                                  3  2'Todos JIT       '
     A            W6WHSE         3S 0O  3 19DSPATR(HI)
     A                                  3 23'/'
     A                                      DSPATR(HI)
     A            W6WHDP         5A  O  3 25DSPATR(HI)
     A                                  3 31'ha sido  '
     A                                  4  2'                                  -
640aAA                                          '
640aAA                                  5  2'                                  '
     A*----------------------------------------------------------------
     A*         R SCRN66SP
640aAA          R SCN66ASP
640a A*%%TS  SD  20110823  091023  BFC         REL-V7R1M0  5770-WDS
640a A*                                     CA03
640a A*                                     CF07
640a A*                                     CA12
640a A  98                                  ALARM
640a A                                      CLRL(07)
640a A                                      OVERLAY
640a A                                  1  2'LT105.66a'
640bDA**                                1 14'Reap/Let Downs'
640bMA                                  1 14'Reap          '
     A                                      DSPATR(HI)
     A                                  1 33DATE
     A                                      EDTCDE(Y)
     A                                  2  2' '
     A                                      DSPATR(PC)
     A                                  3  2'Todos JIT       '
     A            W6WHSE         3S 0O  3 19DSPATR(HI)
     A                                  3 23'/'
     A                                      DSPATR(HI)
     A            W6WHDP         5A  O  3 25DSPATR(HI)
     A                                  3 31'han sido '
640aAA                                  4  2'procesados.                       -
640aAA                                          '
