     A*%%TS  SD  20100806  112026  DAVE        REL-V6R1M0  5761-WDS
     A*----------------------------------------------------------------
     A*   Copyright (C) 2005 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  PH310FM    View phrase log - Display
     A*  Dave Sommerville
     A*
     A*  Revisions
     A*
600 AA*    04/19/08  DAS  6.00
     A*      - Created.
     A*
610aAA*    08/04/10  DAS  6.10a
     A*      - Added screen 3
     A*
     A*----------------------------------------------------------------
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      ERRSFL
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A                                      CF09
     A                                      CF10
     A                                      CF11
     A*
     A          R SFL1                      SFL
     A*%%TS  SD  20020823  162605  DAVE        REL-V4R4M0  5769-PW1
     A  21                                  SFLNXTCHG
     A            OPTION         2A  B  6  2
     A  20                                  DSPATR(PC)
     A N21N90                               DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  90                                  DSPATR(PR)
     A            SFLLINE       75A  O  6  5
500cDA**          SFLHIDE      150   H
500cMA            SFLHIDE      200   H
     A*
     A          R SF1CTL                    SFLCTL(SFL1)
     A*%%TS  SD  20080719  143725  DAVE        REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0034)
     A                                      SFLPAG(0016)
     A                                      OVERLAY
     A N32                                  SFLDSP
     A N31                                  SFLDSPCTL
     A  31                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP
     A                                      SFLCSRRRN(&CSRRRN)
     A            RRN1           4S 0H      SFLRCDNBR(CURSOR)
     A            CSRRRN         5S 0H
     A            SCRNAME        8A  O  1  2
     A                                  1 33'View Phrase Log'
     A                                      DSPATR(HI)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A            SCHEAD        58A  O  2 12
     A                                  2 71TIME
     A            SCOPT1        75A  O  3  2
     A            SCOPT2        75A  O  4  2
     A            SFLHEAD       79A  O  5  1
     A*
500bAA          R SFL2                      SFL
     A*%%TS  SD  20020823  162605  DAVE        REL-V4R4M0  5769-PW1
     A  21                                  SFLNXTCHG
     A            OPTION         2A  B  6  2
     A  20                                  DSPATR(PC)
     A N21N90                               DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  90                                  DSPATR(PR)
     A            SFLLINE2      75A  O  6  5
500cDA**          SFLHIDE      150   H
500cMA            SFLHIDE      200   H
     A*
     A          R SF2CTL                    SFLCTL(SFL2)
     A*%%TS  SD  20080719  143725  DAVE        REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0034)
     A                                      SFLPAG(0016)
     A                                      OVERLAY
     A N32                                  SFLDSP
     A N31                                  SFLDSPCTL
     A  31                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP
     A                                      SFLCSRRRN(&CSRRRN)
     A            RRN1           4S 0H      SFLRCDNBR(CURSOR)
     A            CSRRRN         5S 0H
     A            SCRNAME        8A  O  1  2
     A                                  1 33'View Phrase Log'
     A                                      DSPATR(HI)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A            SCHEAD        58A  O  2 12
     A                                  2 71TIME
     A            SCOPT1        75A  O  3  2
     A            SCOPT2        75A  O  4  2
     A            SFLHEAD2      79A  O  5  1
     A*
610aAA          R SFL3                      SFL
     A*%%TS  SD  20020823  162605  DAVE        REL-V4R4M0  5769-PW1
     A  21                                  SFLNXTCHG
     A            OPTION         2A  B  6  2
     A  20                                  DSPATR(PC)
     A N21N90                               DSPATR(UL)
     A  21                                  DSPATR(RI)
     A  90                                  DSPATR(PR)
     A            SFLLINE3      75A  O  6  5
     A            SFLHIDE      200   H
     A*
610aAA          R SF3CTL                    SFLCTL(SFL3)
     A*%%TS  SD  20080719  143725  DAVE        REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0034)
     A                                      SFLPAG(0016)
     A                                      OVERLAY
     A N32                                  SFLDSP
     A N31                                  SFLDSPCTL
     A  31                                  SFLCLR
     A  90                                  SFLEND(*MORE)
     A                                      ROLLUP
     A                                      SFLCSRRRN(&CSRRRN)
     A            RRN1           4S 0H      SFLRCDNBR(CURSOR)
     A            CSRRRN         5S 0H
     A            SCRNAME        8A  O  1  2
     A                                  1 33'View Phrase Log'
     A                                      DSPATR(HI)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A            SCHEAD        58A  O  2 12
     A                                  2 71TIME
     A            SCOPT1        75A  O  3  2
     A            SCOPT2        75A  O  4  2
     A            SFLHEAD3      79A  O  5  1
     A*
     A*
     A          R FKEY1
     A*%%TS  SD  20050105  171209  DAVE        REL-V5R2M0  5722-WDS
     A                                 23  2'F3=Exit  F5=Refresh  F9=Select/Sor-
500bMA                                      t  F11=Next view  F12=Cancel'
     A                                      COLOR(BLU)
500xDA**                                    WINDOW(6 20 14 40)
     A          R WINDOW1
     A*%%TS  SD  20100806  112026  DAVE        REL-V6R1M0  5761-WDS
     A                                      WINDOW(3 20 19 42)
     A                                  1 10'Selection/Sort Criteria'
     A                                      DSPATR(HI)
     A                                  3  1'From date . . .'
     A            W1FDTE         6S 0B  3 18
     A                                  3 35'MMDDYY'
     A                                  4  1'From time . . .'
     A            W1FTIM         6S 0B  4 18
     A                                  4 35'HHMMSS'
     A                                  6  1'Employee #  . .'
     A            W1EMP#         5Y 0B  6 18DSPATR(HI)
     A                                      EDTCDE(3)
     A                                  7  1'User  . . . . .'
     A            W1USER        10A  B  7 18DSPATR(HI)
     A                                  7 35'*ALL'
     A                                  8  1'Warehouse . . .'
     A            W1WHSE         3Y 0B  8 18DSPATR(HI)
     A                                      EDTCDE(3)
     A                                  9  1'Orig Lic  . . .'
     A            W1OLIC        14A  B  9 18DSPATR(HI)
     A                                  9 35'*ALL'
     A                                 10  1'License . . . .'
     A            W1LIC         15A  B 10 18DSPATR(HI)
     A                                 10 35'*ALL'
     A                                 11  1'Dept  . . . . .'
     A            W1WHDP        12A  B 11 18DSPATR(HI)
     A                                 11 35'*ALL'
     A                                 12  1'Program . . . .'
     A            W1PGM         10A  B 12 18DSPATR(HI)
     A                                 12 35'*ALL'
     A                                 13  1'Location  . . .'
     A            W1LOC         15A  B 13 18DSPATR(HI)
     A                                 13 35'*ALL'
     A                                 14  1'Item  . . . . .'
     A            W1ITEM        15A  B 14 18DSPATR(HI)
     A                                 14 35'*ALL'
     A                                 15  1'Job Number  . .'
     A            W1JOBN         6A  B 15 18DSPATR(HI)
     A                                 15 35'*ALL'
     A                                 16  1'Phrase contains:'
     A            W1CONT        20A  B 16 18DSPATR(HI)
     A                                      CHECK(LC)
500cDA**                               14  1'F3=Exit  F12=Cancel'
     A                                 18  1'F3=Exit  F12=Cancel'
     A                                      COLOR(BLU)
