     A*%%TS  SD  20070918  064852  LYNNM       REL-V5R4M0  5722-WDS
     A*----------------------------------------------------------------
     A*   Copyright (C) 1994 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   799 Roosevelt Rd.  Bldg 6, Suite 108
     A*   Glen Ellyn, IL  60137
     A*   (708) 790-8383
     A*----------------------------------------------------------------
     A*
     A*  PS145FM   Pallet detail maintenance - Change screen
     A*  07 Sep, 2007
     A*  Lynn McMahon    5.10a
     A*
     A*  Revisions
     A*    09/10/07  LMC  5.10a
     A*    - CREATED
     A*----------------------------------------------------------------
     A* Client Custom Revisions: Harbor
     A*
HARaAA*    09/10/07  LMC  HARa
     A*     - Enh: Added SCREEN1H for Harbor
     A*
     A*----------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A          R SCREEN1
     A*%%TS  SD  20070918  064852  LYNNM       REL-V5R4M0  5722-WDS
     A                                      OVERLAY
     A                                      CLRL(23)
     A                                      CF04
     A  98                                  ALARM
     A                                  1  2'PS145.01'
     A                                  1 32'Pallet Maintenance'
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 34'Pallet Detail'
     A                                      DSPATR(HI)
     A                                  4  2'Warehouse:'
     A            $PWHSE         3Y 0O  4 13EDTCDE(3)
     A                                  4 17'-'
     A            WHDESC        30A  O  4 19
     A                                  6  2'Truck:'
     A            WOTRUK        10A  O  6 13
     A                                  9  2'Type changes, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  2'Row:'
     A            WOROW          2Y 0O  7 13EDTCDE(3)
     A                                 11  3'Compartment . . . . . .'
     A            W1COM1         1A  B 11 28
     A N22N90N92                            DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90N92                            DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90
     AO 92                                  DSPATR(PR)
     A                                 12  3'Cube (Max/Cur). . . . .'
     A            W1CUB1         5Y 2O 12 28EDTCDE(4)
     A  23                                  DSPATR(RI)
     A                                 13  3'Unload Sequence . . . .'
     A            W1SEQ1         2Y 0B 13 28EDTCDE(4)
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W1COM2         1A  B 11 51
     A N25N90N93                            DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90N93                            DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90
     AO 93                                  DSPATR(PR)
     A            W1CUB2         5Y 2O 12 51EDTCDE(4)
     A  26                                  DSPATR(RI)
     A            W1SEQ2         2Y 0B 13 51EDTCDE(4)
     A  27                                  DSPATR(RI)
     A N27N90                               DSPATR(UL)
     A  07                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                 23  2'F5=Refresh  F12=Cancel'
     A                                      COLOR(BLU)
     A                                  5  2'Route / Route Id:'
     A            $PRTE          5A  O  5 20
     A                                  5 26'/'
     A            $PRTID         5A  O  5 28
     A                                 12 35'/'
     A                                 12 58'/'
     A            W1CCB2         5Y 2O 12 60EDTCDE(4)
     A  26                                  DSPATR(RI)
     A            W1CCB1         5Y 2O 12 37EDTCDE(4)
     A  23                                  DSPATR(RI)
     A*****************************************************************
     A*
     A* ERROR MESSAGE SUBFILE RECORDS
     A*
     A*    ERROR MESSAGE SUBFILE RECORD
     A*
     A          R MSGREC                    SFL
     A                                      SFLMSGRCD(24)
     A            #MSGK                     SFLMSGKEY
     A            #PGMQ                     SFLPGMQ
     A*
     A*    ERROR MESSAGE SUBFILE CONTROL RECORD
     A*
     A          R MSGCTL                    SFLCTL(MSGREC)
     A  98                                  ALARM
     A                                      LOCK
     A                                      OVERLAY
     A                                      SFLSIZ(2) SFLPAG(1)
     A N97                                  SFLCLR
     A  97                                  SFLDSP
     A  97                                  SFLEND
     A          R MSGCLR
     A                                      OVERLAY
     A                                      LOCK
     A                                      SLNO(24)
     A                                      CLRL(1)
     A          R CLRSCR
     A                                      CLRL(*ALL)
     A          R SCREEN1H
     A*%%TS  SD  20070918  064852  LYNNM       REL-V5R4M0  5722-WDS
     A                                      OVERLAY
     A                                      CLRL(23)
     A                                      CF04
     A  98                                  ALARM
     A                                  1  2'PS145.01H'
     A                                  1 32'Pallet Maintenance'
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 34'Pallet Detail'
     A                                      DSPATR(HI)
     A                                  4  2'Warehouse:'
     A            $PWHSE         3Y 0O  4 13EDTCDE(3)
     A                                  4 17'-'
     A            WHDESC        30A  O  4 19
     A                                  6  2'Truck:'
     A            WOTRUK        10A  O  6 13
     A                                  9  2'Type changes, press Enter.'
     A                                      COLOR(BLU)
     A                                  7  2'Row:'
     A            WOROW          2Y 0O  7 13EDTCDE(3)
     A                                 11  3'Compartment . . . . . .'
     A            W1COM1         1A  B 11 28
     A N22N90N92                            DSPATR(HI)
     A  22                                  DSPATR(RI)
     A N22N90N92                            DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  90
     AO 92                                  DSPATR(PR)
     A                                 12  3'Cube (Max/Cur). . . . .'
     A            W1CUB1         5Y 2O 12 28EDTCDE(4)
     A  23                                  DSPATR(RI)
     A                                 13  3'Unload Sequence . . . .'
     A            W1SEQ1         2Y 0B 13 28EDTCDE(4)
     A  24                                  DSPATR(RI)
     A N24N90                               DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W1COM2         1A  B 11 51
     A N25N90N93                            DSPATR(HI)
     A  25                                  DSPATR(RI)
     A N25N90N93                            DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  90
     AO 93                                  DSPATR(PR)
     A            W1CUB2         5Y 2O 12 51EDTCDE(4)
     A  26                                  DSPATR(RI)
     A            W1SEQ2         2Y 0B 13 51EDTCDE(4)
     A  27                                  DSPATR(RI)
     A N27N90                               DSPATR(UL)
     A  07                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A                                 23  2'F5=Refresh  F12=Cancel'
     A                                      COLOR(BLU)
     A                                  5  2'Route / Route Id:'
     A            $PRTE          5A  O  5 20
     A                                  5 26'/'
     A            $PRTID         5A  O  5 28
     A                                 12 35'/'
     A                                 12 58'/'
     A            W1CCB2         5Y 2O 12 60EDTCDE(4)
     A  26                                  DSPATR(RI)
     A            W1CCB1         5Y 2O 12 37EDTCDE(4)
     A  23                                  DSPATR(RI)
     A                                 14  3'LD (Y=Yes, N=No). . . .'
     A                                 15  3'SD (Y=Yes, N=NO). . . .'
     A            W1LD1          1A  B 14 28
     A  28                                  DSPATR(RI)
     A N28N90                               DSPATR(UL)
     A  08                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W1SD1          1A  B 15 28
     A  29                                  DSPATR(RI)
     A N29N90                               DSPATR(UL)
     A  09                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W1LD2          1A  B 14 51
     A  30                                  DSPATR(RI)
     A N30N90                               DSPATR(UL)
     A  10                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
     A            W1SD2          1A  B 15 51
     A  31                                  DSPATR(RI)
     A N31N90                               DSPATR(UL)
     A  11                                  DSPATR(PC)
     A  90                                  DSPATR(PR)
