     A****************************************************************
     A*
     A* PS311PR   Truck summary
     A* 23 June, 1997
     A* Hemant Kapadia
     A*
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     * Length 50 - Width 110 - Overflow 48 - Page Rotation 90         wwwww
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     A*--------------------------------------------------------------*
     A* Revision
     A* 05/07/00 HNK/RH 4.14
414 AA*   - Totals added
     A* 05/07/00 HNK    4.16
416 AA*   - Dock door number added.
     A*
417  A* 07/14/03  HNK  4.17
     A*   - Enh: Changed report heading for Unload sequence from
     A*     a constant to a field. The field will hold the value
     A*     'Load' or 'Unload'.
417  A* 07/14/03  HNK  4.17
     A*   - Enh: Changed report heading for Unload sequence from
417aAA* 09/30/03  HNK  4.17a
     A*   - Enh: Add Cases and Eaches totals.
500E A* 04/03/06  HNK  5.00E
     A*   - Enh: Add TOTAL PIECES TO DETAIL1.
510a A* 09/07/06  LMC  5.10a
     A*   - Enh: Added route notes
     A*   - Fix: Replace '*' with '|' for column separater after unload
     A*
520 AA*  01/29/09  CWM  5.20
     A*    - Enh: Changed stop to 3 digit from 2 digit.
     A*
520aAA*  09/14/09  RBD  5.20a
     A*    - Enh: Added printing of route/pallet id combination.
     A*
530 AA*  09/08/10  JCJ  5.30
     A*    - Enh: Moved Shorts, Quality Issues, Comments to bottom of
     A*      report.
     A*
530aAA*  07/26/10  RH   5.30a
     A*    - Enh: Added printing of route ID to Summary page.
     A*
650aAA*  02/01/13  LMC  6.50a
     A*    - Enh: Added Column 1 & 2 weights.
     A*
650b A*  02/12/13  GJA  6.50b
     A*    - Enh: Added weight on detail line.
     A*
650c A*  05/22/13  GJA  6.50c
     A*    - Enh: Added detail lines so report prints portrait
     A*
650d A*  04/16/15  GJA  6.50d
     A*    - Enh: Added compartment names to total
     A*
700aMA*  06/22/15  NLK  7.00a
     A*    - Enh: modify UDATE to system date-CURDATE
     A*
700b A*  08/18/15  GJA  7.00b
     A*   - Enh: Add route ID barcode for loader module
     A*      **MUST COMPILE DEVTYPE(*AFPDS) FRONTMGN(0.0 0.2)
     A*
700c A*  11/22/15  GJA  7.00c
     A*   - Enh: Add dock door department  (holding mod mark)
     A*
700d A*  02/08/16  JCJ  7.00d
     A*   - Fix: Reserved for 6.50d fix.
     A*
700e A*  02/25/16  NLK  7.00e
ISYc A*   - Enh: ISupply req to NOT print if truck 'STREET_TRK'
     A*
     A****************************************************************
     A*
     A* Client Custom revisions
     A*
BIRaAA* 10/20/05  RLP  BIRa
     A*   - Added Pallet,Stop,Pieces,Cube to print at detail time.
     A*   - Added Truck Code to header.
     A*
418  A* 09/08/05  LK   4.18a
     A*   - Enh: Make Comp and || bold in the report
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: BIRITE
BIRbAA* 02/10/06  MLB  BIRb
     A*   - Enh: Compile with Copies(2) per Kelly P.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: Presto Foods
PFCa A* 08/18/15  GJA  PFCa
     A*    - Enh: Added check sheet
     A*
PFCb A* 01/24/22  RBD  PFCb
     A*   - Added hardcoded department, barcode string for each dept,
     A*     and manually printed human readable chars for barcode.
     A*     Couldn't get *HRI or *HRITOP to work, don't know why.
     A*     **MUST COMPILE DEVTYPE(*AFPDS)
     A*       Dry = 1  Cooler = 2  Freezer = 3
     A*       Barcode = <Route><Dept Code><Tomorrow's Date MMDDYY>
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: HARBOR
HARa A* 04/03/06  HNK  HARa
     A*   - Enh: Create DETAIL3 record for HARBOR.
     A*          Add custom COMENTS and QUALITY record
HARb A* 09/11/07  LMC  HARb
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: ISUPPLY
ISYa A* 10/07/08  GJA  ISYa
     A*   - Enh: Added trailer#, loaded by: Froz, coolr,dry lines
     A*   - Custom changes on line spacing
     A*
ISYb A* 08/16/11  GJA  ISYb
     A*   - Enh: Created new header and details lines.
     A*
ISYc A*  02/25/16  NLK  ISYc
     A*   - Enh: Req to NOT print if truck 'STREET_TRK'
     A*          And reduce 1 line to all fit on 1 page
     A*
ISYe A*  01/12/19  GJA  ISYe
     A*   - Enh: Reduce 1 line to all fit on 1 page
     A*
ISYf A*  03/12/19  RBD  ISYf
     A*   - Print route id barcode, MUST be compiled as follows:
     A*       Printer device type *AFPDS
     A*       Length 66, width 80, overflow 65
     A*       Front margin offset down 0
     A*       Front margin offset across 0.2
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: JORDANOS
JORa A* 03/26/08  RH   JORa JORDANOS
     A*   - Enh: Add CHECKED BY and DROPS BY
JORb A* 10/31/10  RH   JORb JORDANOS
     A*   - Fix: Change to print HEADJOR to allow for correct spacing
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Dairyland
     A*
DRY AA* 06/16/10  MLB  DRY
     A*   - Revised prtf to create new formats, HEAD2DRY, COLUMNSDRY
     A*     per Kelly R. request.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: WestSide Foods
WSF AA* 11/04/05  RLP  WSF
     A*   - Added trans# to print at detail time. DETAIL3 added.
WSFaAA* 11/17/05  RLP  WSFa
     A*   - Added support to print bulk pick trans# at detail time,
     A*     this meant adding to the text description to distinguish
     A*     between a bulk pick & pallet trans#.
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Eastland
     A*
EFCa A* 12/11/13  GJA  EFCa
     A*   - Revised to add transportation area
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Inter County Bakers
     A*
ICBa A* 07/10/12  GJA  ICBa
     A*   - Revised prtf to not print door and cube
ICBb A* 07/06/13  GJA  ICBb
     A*   - Enh: Add vehicle has been inspected
ICBc A* 07/22/13  GJA  ICBc
     A*   - Enh: Add temperature line.
ICB  A* 03/24/14  RH   ICB
     A*   - NOTE: TOTCOLICB IS NOT USED IN PS311
ICBd A* 08/18/16  RH   ICBd
     A*   - Enh: Add 'truck' to temperature line in ICBc
     A*--------------------------------------------------------------*
      *  Client Custom Revisions - HearnKirkwood
HKWa  *    09/24/13  GJA  HKWa
      *      - Added Verification
HKWb  *    07/11/17  GJA  HKWb
      *      - Added addition verification
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Springfield Grcoery
     A*
SGC AA* 01/22/12  MLB  SGC
     A*   - Revised prtf to temporarily coment out rmts: ISY29, ISY32
     A*     ISY35 and ISY38.
SGCaAA* 01/22/12  MLB  SGCa
     A*   - Revised prtf to bring Checked By, Dropped By to move them
     A*     to print under 105.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: Coastal Sunbelt
     A*
CSPb A* 08/27/10  GJA  CSPb
     A*   - Add USDA 2nd page.
CSPc A* 11/10/10  JCJ  CSPc
     A*   - Add driver name.
CSPd A* 11/01/13  LMC  CSPd
     A*   - Add shorts/jit/broken to the USDA page.
     A*   - Compile wtih page length - 50 and width 110, overflow 48
     A*     pagrtt 90.
CSPe A* 11/18/13  RH   CSPd
     A*   - Create HEAD2CSP to handle custom changes for V6.40 update
CSPf A* 12/08/13  MLB  CSPf
     A*   - Fix: Revised USDA format to add drier name field.
     A*--------------------------------------------------------------*
     A* Client Custom revisions: REINHART
     A*
RFS  A* 02/21/13  RTR  RFS
     A*   - Added custom header with trailer number
     A*
RFSa A* 04/26/15  JCJ  RFSa
     A*   - Removed 'Picked By:' and 'Drops By:'.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: YHata
YHA  A*   - YHata - Custom compile
YHA  A*   - Special COMPILE instructions:
     A*     Page rotation = 90
     A*     Copies = 2
     A*     Save spool file = yes
YHAa A* 08/11/10  RH   YHAa
     A*   - Enh: Add TOTAL3 line to print total pieces (normal & brk1)
     A*
     A*--------------------------------------------------------------*
     A*
     A****************************************************************
     A*
     A* Print report headings
     A*
     A          R HEAD1
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     3
700aMA            CURDATE        6S 0O     3
     A                                      EDTCDE(Y)
     A                                    32
     A                                      DFT('Truck Summary')
     A                                    80
     A                                      DFT('Page')
     A            PAGE           4S 0O    84
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     3
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    30
     A                                    83
     A                                      DFT('PS311')
HARa A                                      SPACEA(002)
     A*
650cAA          R HEAD180
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     2
700aMA            CURDATE        6S 0O     2
     A                                      EDTCDE(Y)
700bAA                                      SPACEA(001)
700bAA            VAL39          6A  O    15BARCODE(CODE128 *NOHRI)
     A                                    31
     A                                      DFT('Truck Summary')
     A  91                                55
     A                                      DFT('(Continued)')
     A                                    71
     A                                      DFT('Page')
     A            PAGE           4S 0O    75
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     2
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    29
     A                                    71
     A                                      DFT('PS311')
HARa A                                      SPACEA(002)
ICBaAA          R HEAD1ICB
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     3
700aMA            CURDATE        6S 0O     3
     A                                      EDTCDE(Y)
     A                                    42
     A                                      DFT('Truck Summary')
     A                                    70
     A                                      DFT('Page')
     A            PAGE           4S 0O    75
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     3
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    30
     A                                    70
     A                                      DFT('PS311')
HARa A                                      SPACEA(002)
     A*
     A          R HEAD2
ISYeDA***                                   SPACEA(003)
ISYeMA                                      SPACEA(002)
HARa A                                     3'ROUTE:'
HARa A            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
HARa A                                    +1'DRIVER:_________'
HARa A                                    +1'TRUCK#:_________'
ISYaMA                                    +1'PICKED BY:_________'
HARa A                                    +1'LOADED BY:_________'
JORa A*                                   +1'CHECKED BY:_________'
530 AA*                                     SPACEA(001)
530 MA*                                   92'DROPS BY:_________'
530 AA                                      SPACEA(001)
SGCa A                                    50'CHECKED BY:_________'
SGCaMA                                    70'DROPS BY:_________'
BIRaMA  91                                85
     A                                      DFT('(Continued)')
     A*
650cAA          R HEAD280
     A                                      SPACEA(003)
     A                                     2'ROUTE:'
     A            ROUTE     R        O     9REFFLD(PSRTID PLTSUM)
     A                                    20'DRIVER:_________'
     A                                    37'TRUCK#:_________'
     A                                    54'PICKED BY:_________'
     A                                      SPACEA(001)
     A                                    20'LOADED BY:_________'
     A                                    40'CHECKED BY:_________'
     A                                    61'DROPS BY:_________'
CSPeAA          R HEAD2CSP
CSPcAA                                      SPACEA(003)
CSPcAA                                     3'ROUTE:'
CSPcAA            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
CSPcMA                                    +1'DRIVER:'
CSPcAA            DRIVER        20A  O    +1
CSPcMA                                    +1'TRUCK#:'
CSPcMA            TRUCK     R        O    +1REFFLD(PSTRUK PLTSUM)
CSPcMA                                    +2'PICKED BY:_________'
CSPcAA                                    +2'LOADED BY:_________'
CSPcMA  91                                85
CSPcAA                                      DFT('(Continued)')
CSPcAA*
ICBaAA          R HEAD2ICB
     A                                      SPACEA(003)
     A                                     3'ROUTE:'
     A            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
     A                                    +1'DRIVER:_________'
     A            TKDRV         10A  O    +1
     A                                    +1'TRUCK#: '
     A            TKNBR          5A  O    +1
     A                                      SPACEA(001)
     A  91                                55
     A                                      DFT('(Continued)')
     A*
ISYbAA          R HEAD2ISY
ISYbAA***                                   SPACEA(002)
ISYeAA                                      SPACEA(001)
ISYbAA                                     3'ROUTE:'
ISYbAA            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
ISYbAA                                    +1'DRIVER:_______'
ISYbAA                                    +1'TRUCK#:_______'
ISYbAA                                    +1'PICKED BY:______'
ISYbAA                                    +1'LOADED BY:______'
ISYbAA                                      SPACEA(001)
ISYbAA  91                                65
     A                                      DFT('(Continued)')
JORb A*
JORb A          R HEAD2JOR
JORb A                                      SPACEA(003)
JORb A                                     3'ROUTE:'
JORb A            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
JORb A                                    +5'DRIVER:_________'
JORb A                                    +5'TRUCK#:_________'
JORbMA                                     3'PICKED BY:_________'
JORb A                                      SPACEB(003)
JORb A                                    +5'LOADED BY:_________'
JORa A                                    +5'CHECKED BY:_________'
JORa A                                    +5'DROPS BY:_________'
JORbMA  91                                85
JORb A                                      DFT('(Continued)')
DRY AA*
DRY AA          R HEAD2DRY
DRY AA                                      SPACEA(003)
DRY AA                                     3'ROUTE:'
DRY AA            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
DRY AA                                    +5'DRIVER:_________'
DRY AA                                    +5'TRUCK#:'
DRY AA            TKNBR          5A  O    +1
DRY AA                                    +8'PICKED BY:_________'
DRY AA                                    +5'LOADED BY:_________'
DRY AA*
RFS AA          R HEAD2RFS
RFS AA                                      SPACEA(003)
RFS AA                                     3'ROUTE:'
RFS AA            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
RFS AA                                    +1'DRIVER:_________'
RFSaD ***                                 +1'TRUCK#:'
RFSaMA                                    +1'TRAILER#:'
RFS AA            TKNBRA        10A  O    +1
RFSaD ***                                 +1'PICKED BY:_________'
RFS AA                                    +1'LOADED BY:_________'
RFS AA                                    +1'CHECKED BY:_________'
RFS AA                                      SPACEA(001)
RFSaD ***                                 92'DROPS BY:_________'
RFS AA  91                                85
RFS AA                                      DFT('(Continued)')
RFS AA*
510aAA          R RTNOTES
510aAA            PRTNT     R        O     3REFFLD(RNNOTE RTENOTE)
510aAA                                      SPACEA(001)
510aAA          R RTNTSPC
510aAA                                     1' '
510aAA                                      SPACEA(001)
     A*
     A* Print column headings
     A*
     A          R COLUMNS
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
417 DA*                                   11'Unload'
417 MA            SQTX1          6        11
418 AA                                      HIGHLIGHT
418 AA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    19'Stop'
     A                                    25'|'
BIRaAA                                    28'Stop'
416 AA                                    34'|'
650bAA                                    37'Cube/'
BIRaAA                                    43'|'
BIRaMA                                    45'Dock'
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    58'|'
417 DA*                                   51'Unload'
BIRaMA            SQTX2          6        59
418 AA                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510AMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    67'Stop'
BIRaMA                                    73'|'
BIRaAA                                    76'Stop'
BIRaMA                                    82'|'
BIRaMA                                    83'Cube/'
BIRaAA                                    91'|'
BIRaMA                                    93'Dock'
BIRaMA                                    98'|'
530 D ***                                103'SHORTS:'
530 D ***                                   HIGHLIGHT
530 D ***                                   UNDERLINE
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     5'Comp'
418 AA                                      HIGHLIGHT
     A                                    10'|'
     A                                    13'Seq'
418 AA                                      HIGHLIGHT
418 DA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    19'Range'
     A                                    25'|'
BIRaAA                                    28'PCS'
416 AA                                    34'|'
BIRaMA                                    37'Weight'
BIRaAA                                    43'|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
418 MA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    53'Comp'
418 AA                                      HIGHLIGHT
BIRaMA                                    58'|'
BIRaMA                                    61'Seq'
418 AA                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    67'Range'
BIRaMA                                    73'|'
BIRaAA                                    76'PCS'
BIRaMA                                    82'|'
BIRaMA                                    85'Weight'
BIRaAA                                    91'|'
BIRaMA*                                   93'Door'
BIRaMA                                    98'|'
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
418 DA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
     A                                    25'|'
416 AA                                    34'|'
BIRaAA                                    43'|'
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    58'|'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    73'|'
BIRaMA                                    82'|'
BIRaAA                                    91'|'
BIRaAA                                    98'|'
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     4'------'
     A                                    10'|'
     A                                    11'------'
418 AA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
     A                                    18'-------'
     A                                    25'|'
     A                                    26'--------'
416 AA                                    34'|'
BIRaAA                                    35'--------'
BIRaAA                                    43'|'
BIRaMA                                    44'------'
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    52'------'
BIRaMA                                    58'|'
BIRaMA                                    59'------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    66'-------'
BIRaMA                                    73'|'
BIRaMA                                    74'--------'
BIRaMA                                    82'|'
BIRaAA                                    83'--------'
BIRaAA                                    91'|'
BIRaMA                                    92'------'
BIRaMA                                    98'|'
     A*
650cAA          R COLUMNS80
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     6'|'
     A            SQTX180        4         7
     A                                      HIGHLIGHT
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    13'Stop'
     A                                    19'|'
     A                                    21'Stop'
     A                                    26'|'
     A                                    28'Cube/'
     A                                    34'|'
     A                                    35'Dock'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    46'|'
     A            SQTX280        4        47
     A                                      HIGHLIGHT
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    53'Stop'
     A                                    59'|'
     A                                    61'Stop'
     A                                    66'|'
     A                                    68'Cube/'
     A                                    74'|'
     A                                    75'Dock'
     A                                    79'|'
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     3'Cmp'
     A                                      HIGHLIGHT
     A                                     6'|'
     A                                     8'Seq'
     A                                      HIGHLIGHT
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    13'Range'
     A                                    19'|'
     A                                    21'PCS'
     A                                    26'|'
     A                                    27'Weight'
     A                                    34'|'
     A                                    35'Door'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    43'Cmp'
     A                                      HIGHLIGHT
     A                                    46'|'
     A                                    48'Seq'
     A                                      HIGHLIGHT
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    53'Range'
     A                                    59'|'
     A                                    61'PCS'
     A                                    66'|'
     A                                    67'Weight'
     A                                    74'|'
     A                                    75'Door'
     A                                    79'|'
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     6'|'
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    19'|'
     A                                    26'|'
     A                                    34'|'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    46'|'
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    59'|'
     A                                    66'|'
     A                                    74'|'
     A                                    79'|'
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     3'---'
     A                                     6'|'
     A                                     7'----'
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    12'-------'
     A                                    19'|'
     A                                    20'------'
     A                                    26'|'
     A                                    27'-------'
     A                                    34'|'
     A                                    35'----'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    43'---'
     A                                    46'|'
     A                                    47'----'
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    52'-------'
     A                                    59'|'
     A                                    60'------'
     A                                    66'|'
     A                                    67'-------'
     A                                    74'|'
     A                                    75'----'
     A                                    79'|'
     A          R COLUMNSICB
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
     A            SQTX1          6        11
     A                                      HIGHLIGHT
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    19'Stop'
     A                                    25'|'
     A                                    28'Stop'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A            SQTX2          6        43
     A                                      HIGHLIGHT
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    51'Stop'
     A                                    57'|'
     A                                    60'Stop'
     A                                    66'|'
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     5'Comp'
     A                                      HIGHLIGHT
     A                                    10'|'
     A                                    13'Seq'
     A                                      HIGHLIGHT
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    19'Range'
     A                                    25'|'
     A                                    28'PCS'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    37'Comp'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    46'Seq'
     A                                      HIGHLIGHT
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    51'Range'
     A                                    57'|'
     A                                    60'PCS'
     A                                    66'|'
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    25'|'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    57'|'
     A                                    66'|'
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     4'------'
     A                                    10'|'
     A                                    11'------'
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    18'-------'
     A                                    25'|'
     A                                    26'--------'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    36'------'
     A                                    42'|'
     A                                    43'------'
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    50'-------'
     A                                    57'|'
     A                                    58'--------'
     A                                    66'|'
DRY AA*
DRY AA          R COLUMNSDRY
DRY AA                                      SPACEA(001)
DRY AA                                     3'|'
DRY AA                                    10'|'
DRY AA            SQTX1          6        11
DRY AA                                      HIGHLIGHT
DRY AA                                    17'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    19'Stop'
DRY AA                                    25'|'
DRY AA                                    28'Stop'
DRY AA                                    34'|'
DRY AA                                    43'|'
DRY AA                                    45'Milk'
DRY AA                                    50'**'
DRY AA                                      HIGHLIGHT
DRY AA                                    58'|'
DRY AA            SQTX2          6        59
DRY AA                                      HIGHLIGHT
DRY AA                                    65'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    67'Stop'
DRY AA                                    73'|'
DRY AA                                    76'Stop'
DRY MA                                    82'|'
DRY AA                                    91'|'
DRY AA                                    93'Milk'
DRY AA                                    98'|'
530 D ***                                103'SHORTS:'
530 D ***                                   HIGHLIGHT
530 D ***                                   UNDERLINE
DRY AA                                      SPACEA(001)
DRY AA                                     3'|'
DRY AA                                     5'Comp'
DRY AA                                      HIGHLIGHT
DRY AA                                    10'|'
DRY AA                                    13'Seq'
DRY AA                                      HIGHLIGHT
DRY AA                                    17'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    19'Range'
DRY AA                                    25'|'
DRY AA                                    28'PCS'
DRY AA                                    34'|'
DRY AA                                    37'Cube'
DRY AA                                    43'|'
DRY AA                                    45'Crate'
DRY AA                                    50'**'
DRY AA                                      HIGHLIGHT
DRY AA                                    53'Comp'
DRY AA                                      HIGHLIGHT
DRY AA                                    58'|'
DRY AA                                    61'Seq'
DRY AA                                      HIGHLIGHT
DRY AA                                    65'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    67'Range'
DRY AA                                    73'|'
DRY AA                                    76'PCS'
DRY AA                                    82'|'
DRY AA                                    85'Cube'
DRY AA                                    91'|'
DRY AA                                    93'Crate'
DRY AA                                    98'|'
DRY AA                                      SPACEA(001)
DRY AA                                     3'|'
DRY AA                                    10'|'
DRY AA                                    17'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    25'|'
DRY AA                                    34'|'
DRY AA                                    43'|'
DRY AA                                    50'**'
DRY AA                                      HIGHLIGHT
DRY AA                                    58'|'
DRY AA                                    65'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    73'|'
DRY AA                                    82'|'
DRY AA                                    91'|'
DRY AA                                    98'|'
DRY AA                                      SPACEA(001)
DRY AA                                     3'|'
DRY AA                                     4'------'
DRY AA                                    10'|'
DRY AA                                    11'------'
DRY AA                                    17'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    18'-------'
DRY AA                                    25'|'
DRY AA                                    26'--------'
DRY AA                                    34'|'
DRY AA                                    35'--------'
DRY AA                                    43'|'
DRY AA                                    44'------'
DRY AA                                    50'**'
DRY AA                                      HIGHLIGHT
DRY AA                                    52'------'
DRY AA                                    58'|'
DRY AA                                    59'------'
DRY AA                                    65'|'
DRY AA                                      HIGHLIGHT
DRY AA                                    66'-------'
DRY AA                                    73'|'
DRY AA                                    74'--------'
DRY AA                                    82'|'
DRY AA                                    83'--------'
DRY AA                                    91'|'
DRY AA                                    92'------'
DRY AA                                    98'|'
DRY AA*
ISYbAA*
ISYbAA* Print column headings
ISYbAA*
ISYbAA          R COLUMNSISY
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     7'|'
ISYbAA            SQTX1          6         8
ISYbAA                                      HIGHLIGHT
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    14'Stop'
ISYbAA                                    20'|'
ISYbAA                                    23'Stop'
ISYbAA                                    29'|'
ISYbAA                                    38'|'
ISYbAA                                    39'Dk'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    47'|'
ISYbAA            SQTX2          6        48
ISYbAA                                      HIGHLIGHT
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    54'Stop'
ISYbAA                                    60'|'
ISYbAA                                    63'Stop'
ISYbAA                                    69'|'
ISYbAA                                    77'|'
ISYbAA                                    78'Dk'
ISYbAA                                    80'|'
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     4'Cmp'
ISYbAA                                      HIGHLIGHT
ISYbAA                                     7'|'
ISYbAA                                     9'Seq'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    14'Range'
ISYbAA                                    20'|'
ISYbAA                                    23'PCS'
ISYbAA                                    29'|'
ISYbAA                                    32'Cube'
ISYbAA                                    38'|'
ISYbAA                                    39'Dr'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    44'Cmp'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    47'|'
ISYbAA                                    49'Seq'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    54'Range'
ISYbAA                                    60'|'
ISYbAA                                    63'PCS'
ISYbAA                                    69'|'
ISYbAA                                    72'Cube'
ISYbAA                                    77'|'
ISYbAA                                    78'Dr'
ISYbAA                                    80'|'
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     7'|'
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    20'|'
ISYbAA                                    29'|'
ISYbAA                                    38'|'
ISYbAA                                    43'|'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    47'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    52'|'
ISYbAA                                    60'|'
ISYbAA                                    69'|'
ISYbAA                                    77'|'
ISYbAA                                    80'|'
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     4'---'
ISYbAA                                     7'|'
ISYbAA                                     8'----'
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    13'-------'
ISYbAA                                    20'|'
ISYbAA                                    21'--------'
ISYbAA                                    29'|'
ISYbAA                                    30'--------'
ISYbAA                                    38'|'
ISYbAA                                    39'--'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    44'---'
ISYbAA                                    47'|'
ISYbAA                                    48'----'
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    53'-------'
ISYbAA                                    60'|'
ISYbAA                                    61'--------'
ISYbAA                                    69'|'
ISYbAA                                    70'-------'
ISYbAA                                    77'|'
ISYbAA                                    78'--'
ISYbAA                                    80'|'
ISYbAA*
ISYbAA* Print detail line
ISYbAA*
ISYbAA          R DETAIL1ISY
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA            C1COMP         1A  O     4
ISYbAA                                      HIGHLIGHT
ISYbAA                                     7'|'
ISYbAA            C1PICK         2S 0O     9EDTCDE(4)
ISYbAA                                      HIGHLIGHT
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA            C1STPA         3S 0O    13EDTCDE(4)
ISYbAA                                    16'-'
ISYbAA            C1STPB         3S 0O    17EDTCDE(4)
ISYbAA                                    20'|'
ISYbAA            C1SPCS         5S 0O    22EDTCDE(4)
ISYbAA                                    29'|'
ISYbAA            C1CUBE         5S 2O    31EDTCDE(4)
ISYbAA                                    38'|'
ISYbAA            C1DOOR         3S 0O    39EDTCDE(4)
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA*
ISYbAA            C2COMP         1A  O    45
ISYbAA                                      HIGHLIGHT
ISYbAA                                    47'|'
ISYbAA            C2PICK         2S 0O    49EDTCDE(4)
ISYbAA                                      HIGHLIGHT
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA            C2STPA         3S 0O    53EDTCDE(4)
ISYbAA                                    56'-'
ISYbAA            C2STPB         3S 0O    57EDTCDE(4)
ISYbAA                                    60'|'
ISYbAA            C2SPCS         5S 0O    62EDTCDE(4)
ISYbAA                                    69'|'
ISYbAA            C2CUBE         5S 2O    71EDTCDE(4)
ISYbAA                                    77'|'
ISYbAA            C2DOOR         3S 0O    78EDTCDE(4)
ISYbAA                                    80'|'
     A*
     A* Print detail line
     A*
     A          R DETAIL1
     A                                      SPACEA(001)
     A                                     3'|'
     A            C1COMP         1A  O     6
418 AA                                      HIGHLIGHT
     A                                    10'|'
     A            C1PICK         2S 0O    13EDTCDE(4)
418 AA                                      HIGHLIGHT
418 DA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
520 DA*           C1STP1         2S 0O    19EDTCDE(4)
BIRaMA*                                   21'-'
520 DA*           C1STP2         2S 0O    22EDTCDE(4)
     A*                                   25'|'
520 AA            C1STPA         3S 0O    18EDTCDE(4)
520 AA                                    21'-'
520 AA            C1STPB         3S 0O    22EDTCDE(4)
520 AA                                    25'|'
500E A            C1SPCS         5S 0O    28EDTCDE(4)
416 AA                                    34'|'
BIRaMA            C1CUBE         5S 2O    36EDTCDE(4)
BIRaAA                                    43'|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
     A*
BIRaMA            C2COMP         1A  O    54
418 AA                                      HIGHLIGHT
BIRaMA                                    58'|'
BIRaMA            C2PICK         2S 0O    61EDTCDE(4)
418 AA                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
520 DA*           C2STP1         2S 0O    67EDTCDE(4)
520 AA            C2STPA         3S 0O    66EDTCDE(4)
BIRaMA                                    69'-'
520 DA*           C2STP2         2S 0O    70EDTCDE(4)
520 AA            C2STPB         3S 0O    70EDTCDE(4)
BIRaMA                                    73'|'
500E A            C2SPCS         5S 0O    76EDTCDE(4)
BIRaMA                                    82'|'
BIRaMA            C2CUBE         5S 2O    84EDTCDE(4)
BIRaAA                                    91'|'
BIRaMA*           C2DOOR         3S 0O    93EDTCDE(4)
BIRaMA                                    98'|'
     A*
650cAA          R DETAIL180
     A                                      SPACEA(001)
     A                                     2'|'
     A            C1COMP         1A  O     4
     A                                      HIGHLIGHT
     A                                     6'|'
     A            C1PICK         2S 0O     8EDTCDE(4)
     A                                      HIGHLIGHT
     A                                    11'|'
     A                                      HIGHLIGHT
     A            C1STPA         3S 0O    12EDTCDE(4)
     A                                    15'-'
     A            C1STPB         3S 0O    16EDTCDE(4)
     A                                    19'|'
     A            C1SPCS         5S 0O    20EDTCDE(4)
     A                                    26'|'
     A            C1CUBE         5S 2O    28EDTCDE(4)
     A                                    34'|'
     A            C1DOOR         3S 0O    36EDTCDE(4)
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A            C2COMP         1A  O    44
     A                                      HIGHLIGHT
     A                                    46'|'
     A            C2PICK         2S 0O    48EDTCDE(4)
     A                                      HIGHLIGHT
     A                                    51'|'
     A                                      HIGHLIGHT
     A            C2STPA         3S 0O    52EDTCDE(4)
     A                                    55'-'
     A            C2STPB         3S 0O    56EDTCDE(4)
     A                                    59'|'
     A            C2SPCS         5S 0O    60EDTCDE(4)
     A                                    66'|'
     A            C2CUBE         5S 2O    68EDTCDE(4)
     A                                    74'|'
     A            C2DOOR         3S 0O    76EDTCDE(4)
     A                                    79'|'
     A*
     A          R DETAIL1ICB
     A                                      SPACEA(001)
     A                                     3'|'
     A            C1COMP         1A  O     6
     A                                      HIGHLIGHT
     A                                    10'|'
     A            C1PICK         2S 0O    13EDTCDE(4)
     A                                      HIGHLIGHT
     A                                    17'|'
     A                                      HIGHLIGHT
     A            C1STPA         3S 0O    18EDTCDE(4)
     A                                    21'-'
     A            C1STPB         3S 0O    22EDTCDE(4)
     A                                    25'|'
     A            C1SPCS         5S 0O    28EDTCDE(4)
     A                                    34'**'
     A                                      HIGHLIGHT
     A            C2COMP         1A  O    38
     A                                      HIGHLIGHT
     A                                    42'|'
     A            C2PICK         2S 0O    45EDTCDE(4)
     A                                      HIGHLIGHT
     A                                    49'|'
     A                                      HIGHLIGHT
     A            C2STPA         3S 0O    50EDTCDE(4)
     A                                    53'-'
     A            C2STPB         3S 0O    54EDTCDE(4)
     A                                    57'|'
     A            C2SPCS         5S 0O    60EDTCDE(4)
     A                                    66'|'
HARbAA          R LDSD
HARbAA                                      SPACEA(001)
HARbAA                                     3'|'
HARbAA            C1LDSD         6A  O     4
HARbAA                                    10'|'
HARbAA                                    17'|'
HARbAA                                      HIGHLIGHT
HARbAA                                    25'|'
HARbAA                                    34'|'
HARbAA                                    43'|'
HARbAA                                    50'**'
HARbAA                                      HIGHLIGHT
HARbAA            C2LDSD         6A  O    52
HARbAA                                    58'|'
HARbAA                                    65'|'
HARbAA                                      HIGHLIGHT
HARbAA                                    73'|'
HARbAA                                    82'|'
HARbAA                                    91'|'
HARbAA                                    98'|'
     A*
     A* Print Stop detail line
     A*
BIRaAA          R DETAIL2
BIRaAA                                      SPACEA(001)
BIRaAA                                     3'|'
BIRaAA            S1COMP         1A  O     6
BIRaAA                                    10'|'
BIRaDA*           S1PICK         2S 0O    13EDTCDE(4)
BIRaAA                                    17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
520 DA*           S1STP1         2S 0O    20EDTCDE(4)
520 AA            S1STPA         3S 0O    20EDTCDE(4)
BIRaDA*                                   30'-'
BIRaDA*           S1STP2         2S 0O    31EDTCDE(4)
BIRaAA                                    25'|'
BIRaAA            S1SPCS         5S 0O    27EDTCDE(4)
BIRaAA                                    34'|'
BIRaAA            S1CUBE         5S 2O    36EDTCDE(4)
BIRaAA                                    43'|'
BIRaDA*           S1DOOR         3S 0O    45EDTCDE(4)
BIRaAA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
     A*
BIRaAA            S2COMP         1A  O    54
BIRaAA                                    58'|'
BIRaDA*           S2PICK         2S 0O    61EDTCDE(4)
BIRaAA                                    65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
520 DA*           S2STP1         2S 0O    68EDTCDE(4)
520 AA            S2STPA         2S 0O    68EDTCDE(4)
BIRaDA*                                   77'-'
BIRaDA*           S2STP2         2S 0O    78EDTCDE(4)
BIRaAA                                    73'|'
BIRaAA            S2SPCS         5S 0O    75EDTCDE(4)
BIRaAA                                    82'|'
BIRaAA            S2CUBE         5S 2O    84EDTCDE(4)
BIRaAA                                    91'|'
BIRaDA*           S2DOOR         3S 0O    93EDTCDE(4)
BIRaAA                                    98'|'
     A*
HARa A          R DETAIL3
     A                                      SPACEA(001)
     A                                     3'|'
     A            S1COMP         1A  O     6
     A                                    10'|'
     A                                    17'|'
510aDA*                                   17'*'
     A                                      HIGHLIGHT
     A**          S1STP1         2S 0O    20EDTCDE(4)
     A            S1STDP         7A  O    19
     A                                    25'|'
     A            S1SPCS         5S 0O    27EDTCDE(4)
     A                                    34'|'
     A            S1CUBE         5S 2O    36EDTCDE(4)
     A                                    43'|'
     A            S1DOOR         3S 0O    45EDTCDE(4)
     A                                    50'**'
     A                                      HIGHLIGHT
     A*
     A            S2COMP         1A  O    54
     A                                    58'|'
     A                                    65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
     A                                      HIGHLIGHT
     A***         S2STP1         2S 0O    68EDTCDE(4)
     A            S2STDP         7A  O    67
     A                                    73'|'
     A            S2SPCS         5S 0O    75EDTCDE(4)
     A                                    82'|'
     A            S2CUBE         5S 2O    84EDTCDE(4)
     A                                    91'|'
     A            S2DOOR         3S 0O    93EDTCDE(4)
     A                                    98'|'
     A*
520aAA* Print route and pallet id combination
     A*
WSF  A* Print detail3W line West Side
WSF  A*
WSF AA          R DETAIL3W
WSF AA                                      SPACEA(001)
WSF AA                                     3'|'
WSF AA                                    10'|'
WSF AA N21                                12'PALLET'
WSF AA N21                                19'Transaction#:'
WSF AA N21        C1TRN#         7S 0O    33EDTCDE(4)
WSF AA                                    43'|'
WSF AA                                    50'||'
     A*
WSF AA                                    58'|'
WSF AA N22                                60'PALLET'
WSF AA N22                                67'Transaction#:'
WSF AA N22        C2TRN#         7S 0O    81EDTCDE(4)
WSF AA                                    91'|'
WSF AA                                    98'|'
WSF  A
WSFa A* Print detail4W line - bulk pick
WSFa A*
WSFaAA          R DETAIL4W
WSFaAA                                      SPACEA(001)
WSFaAA                                     3'|'
WSFaAA                                    10'|'
WSFaAA N23                                12'BLKPCK'
WSFaAA N23                                19'Transaction#:'
WSFaAA N23        C1BTRN         7S 0O    33EDTCDE(4)
WSFaAA                                    43'|'
WSFaAA                                    50'||'
WSFa A*
WSFaAA                                    58'|'
WSFaAA N24                                60'BLKPCK'
WSFaAA N24                                67'Transaction#:'
WSFaAA N24        C2BTRN         7S 0O    81EDTCDE(4)
WSFaAA                                    91'|'
WSFaAA                                    98'|'
520aAA          R DETAIL4
520aAA                                      SPACEA(000)
520aAA            C1RTPA         7A  O    18
520aAA            C2RTPA         7A  O    66
     A*
     A* Print DASH1
     A*
     A          R DASH1
     A*
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
418 DA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
     A                                    25'|'
416 AA                                    34'|'
650bMA            C1WGT          6S 0O    35EDTCDE(4)
BIRaAA                                    43'|'
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    58'|'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    73'|'
BIRaMA                                    82'|'
650bMA            C2WGT          6S 0O    83EDTCDE(4)
BIRaAA                                    91'|'
BIRaMA                                    98'|'
650cAA          R DASH180
     A*
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     6'|'
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    19'|'
     A                                    26'|'
     A            C1WGT          6S 0O    27EDTCDE(4)
     A                                    34'|'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    46'|'
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    59'|'
     A                                    66'|'
     A            C2WGT          6S 0O    67EDTCDE(4)
     A                                    74'|'
     A                                    79'|'
     A          R DASH1ICB
     A*
     A                                      SPACEA(001)
     A                                     3'|'
     A                                    10'|'
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    25'|'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    57'|'
     A                                    66'|'
     A*
     A* Print DASH2
     A*
     A          R DASH2
     A*
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     4'------'
     A                                    10'|'
     A                                    11'------'
418 DA*                                   17'|'
510aDA*                                   17'*'
510aMA                                    17'|'
418 AA                                      HIGHLIGHT
     A                                    18'-------'
     A                                    25'|'
     A                                    26'--------'
416 AA                                    34'|'
BIRaAA                                    35'--------'
BIRaAA                                    43'|'
BIRaMA                                    44'------'
BIRaMA*                                   50'||'
418 AA                                    50'**'
418 AA                                      HIGHLIGHT
BIRaMA                                    52'------'
BIRaMA                                    58'|'
BIRaMA                                    59'------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
510aMA                                    65'|'
418 AA                                      HIGHLIGHT
BIRaMA                                    66'-------'
BIRaMA                                    73'|'
BIRaMA                                    74'--------'
BIRaMA                                    82'|'
BIRaAA                                    83'--------'
BIRaAA                                    91'|'
BIRaMA                                    92'------'
BIRaMA                                    98'|'
     A*
ISYbAA          R DASH1ISY
ISYbAA*
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     7'|'
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    20'|'
ISYbAA                                    29'|'
ISYbAA                                    38'|'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    47'|'
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    60'|'
ISYbAA                                    69'|'
ISYbAA                                    77'|'
ISYbAA                                    80'|'
ISYbAA*
ISYbAA* Print DASH2
ISYbAA*
ISYbAA          R DASH2ISY
ISYbAA*
ISYbAA                                      SPACEA(001)
ISYbAA                                     3'|'
ISYbAA                                     4'---'
ISYbAA                                     7'|'
ISYbAA                                     8'----'
ISYbAA                                    12'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    13'-------'
ISYbAA                                    20'|'
ISYbAA                                    21'--------'
ISYbAA                                    29'|'
ISYbAA                                    30'--------'
ISYbAA                                    38'|'
ISYbAA                                    39'--'
ISYbAA                                    41'**'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    43'|'
ISYbAA                                    44'---'
ISYbAA                                    47'|'
ISYbAA                                    48'----'
ISYbAA                                    52'|'
ISYbAA                                      HIGHLIGHT
ISYbAA                                    53'-------'
ISYbAA                                    60'|'
ISYbAA                                    61'--------'
ISYbAA                                    69'|'
ISYbAA                                    70'--------'
ISYbAA                                    77'|'
ISYbAA                                    78'--'
ISYbAA                                    80'|'
650cAA          R DASH280
     A*
     A                                      SPACEA(001)
     A                                     2'|'
     A                                     3'---'
     A                                     6'|'
     A                                     7'----'
     A                                    11'|'
     A                                      HIGHLIGHT
     A                                    12'-------'
     A                                    19'|'
     A                                    20'------'
     A                                    26'|'
     A                                    27'-------'
     A                                    34'|'
     A                                    35'----'
     A                                    39'|'
     A                                    40'**'
     A                                      HIGHLIGHT
     A                                    42'|'
     A                                    43'---'
     A                                    46'|'
     A                                    47'----'
     A                                    51'|'
     A                                      HIGHLIGHT
     A                                    52'-------'
     A                                    59'|'
     A                                    60'------'
     A                                    66'|'
     A                                    67'-------'
     A                                    74'|'
     A                                    75'----'
     A                                    79'|'
     A          R DASH2ICB
     A*
     A                                      SPACEA(001)
     A                                     3'|'
     A                                     4'------'
     A                                    10'|'
     A                                    11'------'
     A                                    17'|'
     A                                      HIGHLIGHT
     A                                    18'-------'
     A                                    25'|'
     A                                    26'--------'
     A                                    34'**'
     A                                      HIGHLIGHT
     A                                    36'------'
     A                                    42'|'
     A                                    43'------'
     A                                    49'|'
     A                                      HIGHLIGHT
     A                                    50'-------'
     A                                    57'|'
     A                                    58'--------'
     A                                    66'|'
     A*
     A*
     A* Print Stops Summary
     A*
BIRaAA*
BIRaAA          R STPCOL
BIRaAA                                      SPACEA(001)
BIRaAA                                     5'Pallet Stops Detail'
BIRaAA                                      SPACEA(001)
BIRaAA                                     5'Comp'
BIRaAA                                      UNDERLINE
BIRaAA                                    11'Column'
BIRaAA                                      UNDERLINE
BIRaAA                                    19'Row'
BIRaAA                                      UNDERLINE
BIRaAA                                    24'Pallet'
BIRaAA                                      UNDERLINE
BIRaAA                                    32'Stop'
BIRaAA                                      UNDERLINE
BIRaAA                                    38'Pieces'
BIRaAA                                      UNDERLINE
BIRaAA                                    47'Cube'
BIRaAA                                      UNDERLINE
BIRaAA          R STPDTL
BIRaAA                                      SPACEA(001)
BIRaAA            STPCMP         1A  O     5
BIRaAA            STPCLM         1S 0O    13EDTCDE(4)
BIRaAA            STPROW         2S 0O    19EDTCDE(4)
BIRaAA            STPPID         7S 0O    23EDTCDE(4)
BIRaAA            STPSTP         2S 0O    33EDTCDE(4)
BIRaAA            STPPCS         5S 0O    38EDTCDE(4)
BIRaAA            STPCUB         7S 3O    46EDTCDE(4)
414 AA*
     A*
     A* Print totals
     A*
414 AA*
414 AA          R TOTCOL
BIRaMA                                      SPACEA(001)
BIRaAA                                     5'Totals Summary'
530aAA                                    39' RTEID:'
530aAA            PSRTID    R        O    50REFFLD(PSRTID PLTSUM)
BIRaAA                                      SPACEA(001)
414 AA                                     5'Comp'
414 AA                                      UNDERLINE
414 AA                                    +3'Pallet'
414 AA                                      UNDERLINE
417aDA**                                  +3'Pieces'
417aAA                                    21'Cases'
414 AA                                      UNDERLINE
417aAA                                    28'Eaches'
417aAA                                      UNDERLINE
417aMA                                    39'Cube'
414 AA                                      UNDERLINE
417aMA                                    49'Weight'
414 AA                                      UNDERLINE
530 MA                                    59'SHORTS:'
530 MA                                      HIGHLIGHT
530 MA                                      UNDERLINE
ISYbAA          R TOTCOLISY
ISYbMA                                      SPACEA(001)
ISYbAA                                     5'Totals Summary'
ISYbAA                                    39'Route ID:'
ISYbAA            PSRTID    R        O    50REFFLD(PSRTID PLTSUM)
ISYaAA                                    57'Trailer #:'
ISYaAA                                    69'___________'
ISYbAA                                      SPACEA(001)
ISYbAA                                     5'Comp'
ISYbAA                                      UNDERLINE
ISYbAA                                    +3'Pallet'
ISYbAA                                      UNDERLINE
ISYbAA                                    21'Cases'
ISYbAA                                      UNDERLINE
ISYbAA                                    28'Eaches'
417aAA                                      UNDERLINE
ISYbAA                                    39'Cube'
ISYbAA                                      UNDERLINE
ISYbAA                                    49'Weight'
ISYbAA                                      UNDERLINE
ISYaAA                                    +2'Loaded by:'
ISYbAA                                      HIGHLIGHT
ISYbAA                                      UNDERLINE
ISYbAA          R TOTAL1ISY
ISYbAA                                      SPACEA(001)
ISYbAA            COMPRT         1A  O     5
ISYbAA            TOTCOM         2S 0O    14EDTCDE(4)
ISYbAA            TOTPCN         5S 0O    21EDTCDE(4)
ISYbAA            TOTPC1         5S 0O    28EDTCDE(4)
ISYbAA            TOTCUB         7S 3O    35EDTCDE(4)
ISYbAA            TOTWGT         9S 2O    45EDTCDE(4)
ISYbMA                                    57'_____________'
414 AA*
650cAA          R TOTCOL80
     A                                      SPACEA(001)
     A                                     5'Totals Summary'
     A                                    31'RTEID:'
     A            PSRTID    R        O    39REFFLD(PSRTID PLTSUM)
     A                                      SPACEA(001)
     A                                     5'Comp'
     A                                      UNDERLINE
     A                                    12'Pallet'
     A                                      UNDERLINE
     A                                    21'Cases'
     A                                      UNDERLINE
     A                                    28'Eaches'
     A                                      UNDERLINE
     A                                    39'Cube'
     A                                      UNDERLINE
     A                                    49'Weight'
     A                                      UNDERLINE
     A                                    59'SHORTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
ICBaAA          R TOTCOLICB
    MA                                      SPACEA(001)
    AA                                     5'Totals Summary'
    AA                                    39'RTEID:'
    AA            PSRTID    R        O    50REFFLD(PSRTID PLTSUM)
    AA                                      SPACEA(001)
    AA                                     5'Comp'
    AA                                      UNDERLINE
    AA                                    +3'Pallet'
    AA                                      UNDERLINE
    DA**                                  +3'Pieces'
    AA                                    21'Cases'
    AA                                      UNDERLINE
    AA                                    28'Eaches'
    AA                                      UNDERLINE
    MA                                    39'Cube'
    AA                                      UNDERLINE
ICBaAA          R TOTAL1ICB
     A                                      SPACEB(001)
     A            COMPRT         1A  O     5
     A            TOTCOM         2S 0O    14EDTCDE(4)
     A            TOTPCN         5S 0O    21EDTCDE(4)
     A            TOTPC1         5S 0O    28EDTCDE(4)
     A            TOTCUB         7S 3O    35EDTCDE(4)
     A*
ICBaAA          R TOTAL2ICB
     A                                      SPACEB(001)
     A            GOTCOM         2S 0O    14EDTCDE(4)
     A            GOTPCN         5S 0O    21EDTCDE(4)
     A            GOTPC1         5S 0O    28EDTCDE(4)
     A            GOTCUB         7S 3O    35EDTCDE(4)
414 AA          R TOTAL1
414 AA                                      SPACEB(001)
414 AA            COMPRT         1A  O     2
650dAA            TPDESC        15A  O     4
414 AA            TOTCOM         2S 0O    14EDTCDE(4)
417aAA            TOTPCN         5S 0O    21EDTCDE(4)
417aAA            TOTPC1         5S 0O    28EDTCDE(4)
417aDA**          TOTPCS         5S 0O    21EDTCDE(4)
417aMA            TOTCUB         7S 3O    35EDTCDE(4)
417aMA            TOTWGT         9S 2O    45EDTCDE(4)
414 AA*
414 AA          R TOTAL2
414 AA                                      SPACEB(001)
414 AA            GOTCOM         2S 0O    14EDTCDE(4)
417aAA            GOTPCN         5S 0O    21EDTCDE(4)
417aAA            GOTPC1         5S 0O    28EDTCDE(4)
417aDA*           GOTPCS         5S 0O    21EDTCDE(4)
417aMA            GOTCUB         7S 3O    35EDTCDE(4)
417aMA            GOTWGT         9S 2O    45EDTCDE(4)
YHA AA*
YHA AA          R TOTAL3
YHA AA                                      SPACEB(001)
YHAa A                                    12'TOTAL COUNT:'
YHA AA            GOTPCS         5S 0O    25EDTCDE(4)
     A*
ISYaAA                                      SPACEA(001)
HARa A          R ISY29
ISYaAA                                   103'Trailer #:'
ISYaAA                                    +2'____________________'
HARa A          R ISY32
ISYaAA                                   103'Loaded by: FROZ'
ISYaAA                                    +2'____________________'
HARa A          R ISY35
ISYaAA                                   103'          COOLR'
ISYaAA                                    +2'____________________'
HARa A          R ISY38
ISYaAA                                   103'            DRY'
ISYaAA                                    +2'____________________'
     A*
PFCa A          R PFC1
PFCaAA                                      SPACEB(001)
PFCaAA                                     2'Truck clean:  Yes  No'
PFCaAA                                     5'If no, explain'
PFCaAA                                      SPACEB(001)
PFCaAA                                    +1'_______________________+
PFCaAA                                       _______________________'
PFCaAA          R PFC2
PFCaAA                                      SPACEB(001)
PFCaAA                                     2'Refrigeration unit operating'
PFCaAA                                    +1'Yes  No'
PFCaAA                                     5'If no, action taken'
PFCaAA                                      SPACEB(001)
PFCaAA                                    +1'____________________+
PFCaAA                                       _____________________'
PFCaAA          R PFC3
PFCaAA                                      SPACEB(001)
PFCaAA                                     2'Evidence of rodent  Yes  No'
PFCaAA                                     5'If yes, action taken'
PFCaAA                                      SPACEB(001)
PFCaAA                                    +1'____________________+
PFCaAA                                       ____________________'
PFCaAA                                      SPACEA(002)
PFCaAA          R PFC4
PFCaAA                                      SPACEB(001)
PFCaAA                                     2'# of plastic pallets ______'
PFCaAA                                      SPACEA(002)
PFCaAA          R PFC5
PFCaAA                                      SPACEB(001)
PFCaAA                                     2'# of plastic pallets unloaded'
PFCaAA                                    +1'______'
PFCaAA                                      SPACEA(002)
HARa A          R QUALITY
530 D ***                                103'QUALITY ISSUES:'
530 MA                                    59'QUALITY ISSUES:'
HARa A                                      HIGHLIGHT
HARa A                                      UNDERLINE
530  A                                      SPACEA(001)
     A*
650cAA          R QUALITY80
     A                                     7'QUALITY ISSUES:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                      SPACEA(001)
     A*
HARa A          R COMENTS
530 D ***                                103'COMMENTS:'
530 MA                                    59'COMMENTS:'
HARa A                                      HIGHLIGHT
HARa A                                      UNDERLINE
     A*
650cAA          R COMENTS80
     A                                     7'COMMENTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                      SPACEA(001)
CSPbAA**********************************************************
CSPbAA          R USDA
CSPbAA                                      SKIPB(002)
700aMA*           UDATE          6S 0O     3
700aMA            CURDATE        6S 0O     3
CSPbAA                                      EDTCDE(Y)
CSPbAA                                    42
CSPbAA                                      DFT('Truck Summary')
CSPbAA                                    80
CSPbAA                                      DFT('Page')
CSPbAA            PAGE           4S 0O    84
CSPbAA                                      EDTCDE(Z)
CSPbAA                                      SPACEA(001)
CSPbAA*
CSPbAA            TIME           6S 0O     3
CSPbAA                                      EDTWRD('  :  :  ')
CSPbAA            WHSE          30A  O    30
CSPbAA                                    83
CSPbAA                                      DFT('PS311')
CSPbAA                                      SPACEA(002)
CSPbAA                                     3'ROUTE:'
CSPbAA            ROUTE     R        O    10REFFLD(PSRTID PLTSUM)
CSPfDA*                                   +5'DRIVER:_________'
CSPfMA                                    +5'DRIVER:'
CSPfAA            DRIVER        20A  O    +1
CSPbAA                                    +5'TRUCK#:'
CSPbAA            TRUCK     R        O    +1REFFLD(PSTRUK PLTSUM)
CSPbAA                                      SPACEA(005)
CSPbAA                                     3'1. Slot Inspector: I have +
CSPbAA                                       verified that the condition of +
CSPbAA                                       the truck was fee of debris, '
CSPbAA                                      SPACEA(001)
CSPbAA                                     3'pest, and other forms of +
CSPbAA                                       potential contamination prior +
CSPbAA                                       to loading.    '
CSPbAA                                    +1'(Initials) ______________________'
CSPbAA                                      SPACEA(001)
CSPbAA                                     3'2. Trailer is maintaining a +
CSPbAA                                       temperature of between 32 and +
CSPbAA                                       40 degrees '
CSPbAA                                      SPACEA(002)
CSPbAA                                     3'F? Temp: ________ +
CSPbAA                                       Temp: ________ +
CSPbAA                                       Temp: ________ +
CSPbAA                                       Temp: ________ '
CSPbAA                                      SPACEA(002)
CSPbAA                                     3'3. Food is free of tampering +
CSPbAA                                       and in compliance with the +
CSPbAA                                       integrity of the food safety +
CSPbAA                                       defense.  '
CSPbAA                                      SPACEA(001)
CSPbAA                                     3'(Initials) ______________________'
CSPbAA                                      SPACEA(001)
CSPbAA                                     3'Driver: _________________________'
CSPbAA                                    40'Coastal SunBelt Produce'
CSPbAA                                      SPACEA(001)
CSPbAA                                    40'8704 Bollman Place'
CSPbAA                                      SPACEA(001)
CSPbAA                                     3'QA Verification: ________________'
CSPbAA                                    40'Savage, Maryland  20763'
CSPbAA                                      SPACEA(002)
CSPdAA                                     3'------'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |  Shorts'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'------'
CSPdAA                                      SPACEA(002)
CSPdAA                                     3'------'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |  Jit'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'------'
CSPdAA                                      SPACEA(002)
CSPdAA                                     3'------'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'|    |  Broken'
CSPdAA                                      SPACEA(001)
CSPdAA                                     3'------'
     A*
     A* Skip 1 Line
     A*
     A          R SKIP1
     A                                      TEXT('SKIP ONE LINE')
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT(' ')
ICBa A          R FOOT1ICB
     A                                    24'           REAR'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                      SPACEA(002)
     A                                    14'Back Seal# ___________  Yes   No'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                    14'Side Seal# ___________  Yes   No'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                    14'INITIALS:  ___________'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                     4'Vehicle has been inspected and +
     A                                       found to be clean, free of odors,'
     A                                      SPACEA(001)
     A                                    10'leaks and Non-food Freight. +
     A                                       Yes   No'
     A                                      HIGHLIGHT
ICBcAA                                      SPACEA(002)
ICBdDA*                                   14'Temperature: __________'
ICBdMA                                     8'Truck Temperature: __________'
ICBcAA                                      HIGHLIGHT
     A*
     A*****************************************************************
HKWaAA          R HKWVFY
     A                                      SPACEB(002)
     A                                     6'Circle for Verification'
     A                                      UNDERLINE
     A                                   +10'Setpoint Temperature: __________'
     A                                      SPACEA(002)
HKWbDA***                                  6'P&R     C     O     PS'
HKWbMA                                     6'P&R     C     O     PS     L'
     A                                      HIGHLIGHT
HKWbDA***                                +11'Ambient Temperature: __________'
HKWbMA                                    +5'Ambient Temperature: __________'
     A                                      SPACEA(002)
     A                                     6'P&R-Truck/Trailer is Pest &'
     A                                    +1'Rodent Free'
     A                                      SPACEA(001)
     A                                     6'C-Truck/Trailer-Clean,'
     A                                    +1'swepted & free of debris'
     A                                      SPACEA(001)
     A                                     6'O-Truck/Trialer odor free'
     A                                      SPACEA(001)
     A                                     6'PS-Proper sealing of all'
     A                                    +1'drain holes in any of the'
     A                                    +1'Truck/Trailer floors'
     A                                      SPACEA(001)
     A                                    +7'that are in temperature'
     A                                    +1'controlled areas of the'
     A                                    +1'trailer if applicable.'
HKWbAA                                      SPACEA(001)
HKWbAA                                     6'L-Truck is loaded and doors'
HKWbAA                                    +1'are locked'
EFCa A          R FOOT1EFC
     A                                      SKIPB(004)
     A                                     2'NOTICE TO ALL TRANSPORTATION +
     A                                      PERSONNEL'
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                     2'Driver and helpers are totally res+
     A                                      ponsible for all equipments assigne+
     A                                      d to this'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     2'delivery.  The cost of any missin+
     A                                      g or damaged equipment will be char+
     A                                      ged to both driver and helper.'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     2'driver and helper.'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'*-----------------------------*'
     A                                      HIGHLIGHT
     A                                    46'*-----------------------------*'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|ASSIGNED LOAD EQUIPMENT      |'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46'|SIGNATURE ___________________|'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|DESCRIPTION|   OUT  |   IN   |'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Hand Truck |________|________|'
     A                                      HIGHLIGHT
     A                                    46'|LOADED BY      CHECKED BY    |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Pallet Jack|________|________|'
     A                                      HIGHLIGHT
     A                                    46'|_____________  _____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Load Bars  |________|________|'
     A                                      HIGHLIGHT
     A                                    46'|TIME:                        |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46'|LOAD            UNLOAD       |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Pallet     |________|________|'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46'|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Others     |________|________|'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46'|DRIVER          UNLOADED BY  |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|ASSIGNED TRANSPORT EQUIPMENT |'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46'|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Tractor/St Truck ___________ |'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46'|HELPER          CHECKED BY   |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Trailer ____________________ |'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46'|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46'|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'|Route No  __________________ |'
     A                                      HIGHLIGHT
     A                                    46'|                Date: ______ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4'*-----------------------------*'
     A                                      HIGHLIGHT
     A                                    46'*-----------------------------*'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
PFCb A          R FOOT1PFC
     A                                      SPACEB(003)
     A                                    14'Dry:'
     A            VALDRY        14A  O    24BARCODE(CODE128 3)
     A            VALDRYHR      14A  O    52
     A                                      SPACEA(006)
     A                                    11'Cooler:'
     A            VALCLR        14A  O    24BARCODE(CODE128 3)
     A            VALCLRHR      14A  O    52
     A                                      SPACEA(006)
     A                                    10'Freezer:'
     A            VALFRZ        14A  O    24BARCODE(CODE128 3)
     A            VALFRZHR      14A  O    52
     A                                      SPACEA(006)
     A*
     A* End of report message
     A*
     A          R FOOT1
     A                                      SPACEA(001)
     A                                     1
     A                                      DFT('PS311: End of Report ')
     A*
650aAA          R TOTWEIGHT
650aAA                                      SPACEB(001)
650aAA                                      SPACEA(001)
650aAA                                    35'WGT:'
650aAA                                    83'WGT:'
650aAA            TOTWGT1        9S 2O    39EDTCDE(4)
650aAA            TOTWGT2        9S 2O    87EDTCDE(4)
650aAA*
650cAA          R TOTWEIGHT8
650cAA                                      SPACEB(001)
650cAA                                      SPACEA(001)
650cAA                                    22'WGT:'
650cAA                                    61'WGT:'
650cAA            TOTWGT1        9S 2O    26EDTCDE(4)
650cAA            TOTWGT2        9S 2O    65EDTCDE(4)
650cAA*
