     A*%%***********************************************************************
     A*%%TS  RD  20181023  105437  KENNETHE    REL-V7R2M0  5770-WDS
     A*%%FI+10660100000000000000000000000000000000000000000000000000
     A*%%FI       0000000000000000000000000000000000000000000000000
     A*%%***********************************************************************
     A****************************************************************
     A*
     A* PS314PR   Truck summary
     A* 16 SEPT 2018
     A* KENNETH ELDER
     A*
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     * Width 184 - Overflow 60 - Page Rotation AUTO - CPI 16.7            W
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     *wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
     A*--------------------------------------------------------------*
     A* Revision
     A* 05/07/00 HNK/RH 4.14
414 AA*   - Totals added
     A* 05/07/00 HNK    4.16
416 AA*   - Dock door number added.
     A*
417  A* 07/14/03  HNK  4.17
     A*   - Enh: Changed report heading for Unload sequence from
     A*     a constant to a field. The field will hold the value
     A*     'Load' or 'Unload'.
417  A* 07/14/03  HNK  4.17
     A*   - Enh: Changed report heading for Unload sequence from
417aAA* 09/30/03  HNK  4.17a
     A*   - Enh: Add Cases and Eaches totals.
500E A* 04/03/06  HNK  5.00E
     A*   - Enh: Add TOTAL PIECES TO DETAIL1.
510a A* 09/07/06  LMC  5.10a
     A*   - Enh: Added route notes
     A*   - Fix: Replace '*' with '|' for column separater after unload
     A*
520 AA*  01/29/09  CWM  5.20
     A*    - Enh: Changed stop to 3 digit from 2 digit.
     A*
520aAA*  09/14/09  RBD  5.20a
     A*    - Enh: Added printing of route/pallet id combination.
     A*
530 AA*  09/08/10  JCJ  5.30
     A*    - Enh: Moved Shorts, Quality Issues, Comments to bottom of
     A*      report.
     A*
530aAA*  07/26/10  RH   5.30a
     A*    - Enh: Added printing of route ID to Summary page.
     A*
650aAA*  02/01/13  LMC  6.50a
     A*    - Enh: Added Column 1 & 2 weights.
     A*
650b A*  02/12/13  GJA  6.50b
     A*    - Enh: Added weight on detail line.
     A*
650c A*  05/22/13  GJA  6.50c
     A*    - Enh: Added detail lines so report prints portrait
     A*
650d A*  04/16/15  GJA  6.50d
     A*    - Enh: Added compartment names to total
     A*
700aMA*  06/22/15  NLK  7.00a
     A*    - Enh: modify UDATE to system date-CURDATE
     A*
700b A*  08/18/15  GJA  7.00b
     A*   - Enh: Add route ID barcode for loader module
     A*      **MUST COMPILE DEVTYPE(*AFPDS) FRONTMGN(0.0 0.2)
     A*
700c A*  11/22/15  GJA  7.00c
     A*   - Enh: Add dock door department  (holding mod mark)
     A*
700d A*  02/08/16  JCJ  7.00d
     A*   - Fix: Reserved for 6.50d fix.
     A*
700e A*  02/25/16  NLK  7.00e
ISYc A*   - Enh: ISupply req to NOT print if truck 'STREET_TRK'
     A*
720  A*  04/11/18  KDE  7.20
     A*   - Enh: Add third set of columns for Drag Drop 2
     A*
720A A*  05/29/18  KDE  7.20A
     A*   - Enh: Changed to print case total per SSCC instead of total
     A*          per position
720B A*  09/16/18  KDE  7.20B
     A*   - Enh: Setup to allow up to 4 columns for Magliner.  First used
     A*          by Chefs
720B A*  09/16/18  KDE  7.20B
     A*   - Enh: Setup to allow up to 4 columns for Magliner.  First used
740  A*  08/26/20  KDE  7.40
     A*   - Enh: Change cube output fields to 7.2 instead of 5.2
     A*
     A****************************************************************
     A*
     A* Client Custom revisions
     A*
BIRaAA* 10/20/05  RLP  BIRa
     A*   - Added Pallet,Stop,Pieces,Cube to print at detail time.
     A*   - Added Truck Code to header.
     A*
418  A* 09/08/05  LK   4.18a
     A*   - Enh: Make Comp and || bold in the report
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: BIRITE
BIRbAA* 02/10/06  MLB  BIRb
     A*   - Enh: Compile with Copies(2) per Kelly P.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: Presto Foods
PFCa A* 08/18/15  GJA  PFCa
     A*    - Enh: Added check sheet
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: HARBOR
HARa A* 04/03/06  HNK  HARa
     A*   - Enh: Create DETAIL3 record for HARBOR.
     A*          Add custom COMENTS and QUALITY record
HARb A* 09/11/07  LMC  HARb
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: ISUPPLY
ISYa A* 10/07/08  GJA  ISYa
     A*   - Enh: Added trailer#, loaded by: Froz, coolr,dry lines
     A*   - Custom changes on line spacing
     A*
ISYb A* 08/16/11  GJA  ISYb
     A*   - Enh: Created new header and details lines.
     A*
ISYc A*  02/25/16  NLK  ISYc
     A*   - Enh: Req to NOT print if truck 'STREET_TRK'
     A*          And reduce 1 line to all fit on 1 page
     A*--------------------------------------------------------------*
     A* Client Custom revisions: JORDANOS
JORa A* 03/26/08  RH   JORa JORDANOS
     A*   - Enh: Add CHECKED BY and DROPS BY
JORb A* 10/31/10  RH   JORb JORDANOS
     A*   - Fix: Change to print HEADJOR to allow for correct spacing
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Dairyland
     A*
DRY AA* 06/16/10  MLB  DRY
     A*   - Revised prtf to create new formats, HEAD2DRY, COLUMNSDRY
     A*     per Kelly R. request.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: WestSide Foods
WSF AA* 11/04/05  RLP  WSF
     A*   - Added trans# to print at detail time. DETAIL3 added.
WSFaAA* 11/17/05  RLP  WSFa
     A*   - Added support to print bulk pick trans# at detail time,
     A*     this meant adding to the text description to distinguish
     A*     between a bulk pick & pallet trans#.
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Eastland
     A*
EFCa A* 12/11/13  GJA  EFCa
     A*   - Revised to add transportation area
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Inter County Bakers
     A*
ICBa A* 07/10/12  GJA  ICBa
     A*   - Revised prtf to not print door and cube
ICBb A* 07/06/13  GJA  ICBb
     A*   - Enh: Add vehicle has been inspected
ICBc A* 07/22/13  GJA  ICBc
     A*   - Enh: Add temperature line.
ICB  A* 03/24/14  RH   ICB
     A*   - NOTE: TOTCOLICB IS NOT USED IN PS311
ICBd A* 08/18/16  RH   ICBd
     A*   - Enh: Add 'truck' to temperature line in ICBc
     A*--------------------------------------------------------------*
      *  Client Custom Revisions - HearnKirkwood
HKWa  *    09/24/13  GJA  HKWa
      *      - Added Verification
HKWb  *    07/11/17  GJA  HKWb
      *      - Added addition verification
     A*--------------------------------------------------------------*
     A*
     A* Client Custom revisions: Springfield Grcoery
     A*
SGC AA* 01/22/12  MLB  SGC
     A*   - Revised prtf to temporarily coment out rmts: ISY29, ISY32
     A*     ISY35 and ISY38.
SGCaAA* 01/22/12  MLB  SGCa
     A*   - Revised prtf to bring Checked By, Dropped By to move them
     A*     to print under 105.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: Coastal Sunbelt
     A*
CSPb A* 08/27/10  GJA  CSPb
     A*   - Add USDA 2nd page.
CSPc A* 11/10/10  JCJ  CSPc
     A*   - Add driver name.
CSPd A* 11/01/13  LMC  CSPd
     A*   - Add shorts/jit/broken to the USDA page.
     A*   - Compile wtih page length - 50 and width 110, overflow 48
     A*     pagrtt 90.
CSPe A* 11/18/13  RH   CSPd
     A*   - Create HEAD2CSP to handle custom changes for V6.40 update
     A*--------------------------------------------------------------*
     A* Client Custom revisions: REINHART
     A*
RFS  A* 02/21/13  RTR  RFS
     A*   - Added custom header with trailer number
     A*
RFSa A* 04/26/15  JCJ  RFSa
     A*   - Removed 'Picked By:' and 'Drops By:'.
     A*
     A*--------------------------------------------------------------*
     A* Client Custom revisions: YHata
YHA  A*   - YHata - Custom compile
YHA  A*   - Special COMPILE instructions:
     A*     Page rotation = 90
     A*     Copies = 2
     A*     Save spool file = yes
YHAa A* 08/11/10  RH   YHAa
     A*   - Enh: Add TOTAL3 line to print total pieces (normal & brk1)
     A*
     A*--------------------------------------------------------------*
     A*
     A****************************************************************
     A*
     A* Print report headings
     A*
     A          R HEAD1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     3
     A            CURDATE        6S 0O     3
     A                                      EDTCDE(Y)
     A                                    32
     A                                      'Truck Summary'
     A                                    80
     A                                      'Page'
     A            PAGE           4S 0O    84
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     3
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    30
     A                                    83
     A                                      'PS314'
     A                                      SPACEA(002)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*
     A          R HEAD180
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     2
     A            CURDATE        6S 0O     2
     A                                      EDTCDE(Y)
     A                                      SPACEA(001)
     A            VAL39          6A  O    15
     A                                      BARCODE(CODE128 *NOHRI)
     A                                    31
     A                                      'Truck Summary'
     A  91                                55
     A                                      '(Continued)'
     A                                    71
     A                                      'Page'
     A            PAGE           4S 0O    75
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     2
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    29
     A                                    71
     A                                      'PS314'
     A                                      SPACEA(002)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A          R HEAD1ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      TEXT('REPORT HEADING')
     A                                      SKIPB(002)
     A*
700aMA*           UDATE          6S 0O     3
     A            CURDATE        6S 0O     3
     A                                      EDTCDE(Y)
     A                                    42
     A                                      'Truck Summary'
     A                                    70
     A                                      'Page'
     A            PAGE           4S 0O    75
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
     A*
     A            TIME           6S 0O     3
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    30
     A                                    70
     A                                      'PS314'
     A                                      SPACEA(002)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*
     A          R HEAD2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +1
     A                                      'DRIVER:_________'
     A                                    +1
     A                                      'TRUCK#:_________'
     A                                    +1
     A                                      'PICKED BY:_________'
     A                                    +1
     A                                      'LOADED BY:_________'
JORa A*                                   +1'CHECKED BY:_________'
530 AA*                                     SPACEA(001)
530 MA*                                   92'DROPS BY:_________'
     A                                      SPACEA(001)
     A                                    50
     A                                      'CHECKED BY:_________'
     A                                    70
     A                                      'DROPS BY:_________'
     A  91                                85
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 003
     A*%%***********************************************************************
     A*
     A          R HEAD280
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     2
     A                                      'ROUTE:'
     A            ROUTE     R        O     9
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    20
     A                                      'DRIVER:_________'
     A                                    37
     A                                      'TRUCK#:_________'
     A                                    54
     A                                      'PICKED BY:_________'
     A                                      SPACEA(001)
     A                                    20
     A                                      'LOADED BY:_________'
     A                                    40
     A                                      'CHECKED BY:_________'
     A                                    61
     A                                      'DROPS BY:_________'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 003
     A*%%***********************************************************************
     A          R HEAD2CSP
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +1
     A                                      'DRIVER:'
     A            DRIVER        20A  O    +1
     A                                    +1
     A                                      'TRUCK#:'
     A            TRUCK     R        O    +1
     A                                      REFFLD(PSTRUK PLTSUM)
     A                                    +2
     A                                      'PICKED BY:_________'
     A                                    +2
     A                                      'LOADED BY:_________'
     A  91                                85
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 003
     A*%%***********************************************************************
CSPcAA*
     A          R HEAD2ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +1
     A                                      'DRIVER:_________'
     A            TKDRV         10A  O    +1
     A                                    +1
     A                                      'TRUCK#: '
     A            TKNBR          5A  O    +1
     A                                      SPACEA(001)
     A  91                                55
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 003
     A*%%***********************************************************************
     A*
     A          R HEAD2ISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(002)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +1
     A                                      'DRIVER:_______'
     A                                    +1
     A                                      'TRUCK#:_______'
     A                                    +1
     A                                      'PICKED BY:______'
     A                                    +1
     A                                      'LOADED BY:______'
     A                                      SPACEA(001)
     A  91                                65
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
JORb A*
     A          R HEAD2JOR
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +5
     A                                      'DRIVER:_________'
     A                                    +5
     A                                      'TRUCK#:_________'
     A                                     3
     A                                      'PICKED BY:_________'
     A                                      SPACEB(003)
     A                                    +5
     A                                      'LOADED BY:_________'
     A                                    +5
     A                                      'CHECKED BY:_________'
     A                                    +5
     A                                      'DROPS BY:_________'
     A  91                                85
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 003
     A*%%CL 003
     A*%%***********************************************************************
DRY AA*
     A          R HEAD2DRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +5
     A                                      'DRIVER:_________'
     A                                    +5
     A                                      'TRUCK#:'
     A            TKNBR          5A  O    +1
     A                                    +8
     A                                      'PICKED BY:_________'
     A                                    +5
     A                                      'LOADED BY:_________'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 003
     A*%%***********************************************************************
DRY AA*
     A          R HEAD2RFS
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(003)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +1
     A                                      'DRIVER:_________'
RFSaD ***                                 +1'TRUCK#:'
     A                                    +1
     A                                      'TRAILER#:'
     A            TKNBRA        10A  O    +1
RFSaD ***                                 +1'PICKED BY:_________'
     A                                    +1
     A                                      'LOADED BY:_________'
     A                                    +1
     A                                      'CHECKED BY:_________'
     A                                      SPACEA(001)
RFSaD ***                                 92'DROPS BY:_________'
     A  91                                85
     A                                      '(Continued)'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 003
     A*%%***********************************************************************
RFS AA*
     A          R RTNOTES
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            PRTNT     R        O     3
     A                                      REFFLD(RNNOTE RTENOTE)
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R RTNTSPC
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                     1
     A                                      ' '
     A                                      SPACEA(001)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print column headings
     A*
     A          R COLUMNS
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     8
     A                                      '|'
417 DA*                                   11'Unload'
     A            SQTX1          4         9
     A                                      HIGHLIGHT
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    16
     A                                      'Stop'
     A                                    22
     A                                      '|'
     A                                    25
     A                                      'Stop'
     A                                    31
     A                                      '|'
     A                                    34
     A                                      'Cube/'
     A                                    40
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    41
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|'
417 DA*                                   51'Unload'
     A            SQTX2          4        47
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    54
     A                                      'Stop'
     A                                    60
     A                                      '|'
     A                                    63
     A                                      'Stop'
     A                                    69
     A                                      '|'
     A                                    72
     A                                      'Cube/'
     A                                    78
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    79
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    84
     A                                      '|'
417 DA*                                   51'Unload'
     A            SQTX3          4        85
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    92
     A                                      'Stop'
     A                                    98
     A                                      '|'
     A                                   101
     A                                      'Stop'
     A                                   107
     A                                      '|'
     A                                   110
     A                                      'Cube/'
     A                                   116
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   117
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   122
     A                                      '|'
417 DA*                                   51'Unload'
     A            SQTX4          4       123
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   130
     A                                      'Stop'
     A                                   136
     A                                      '|'
     A                                   139
     A                                      'Stop'
     A                                   145
     A                                      '|'
     A                                   148
     A                                      'Cube/'
     A                                   154
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'C'
     A                                      HIGHLIGHT
     A                                     8
     A                                      '|'
     A            SQTX11         4A  O     9
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    16
     A                                      'Range/'
     A                                    22
     A                                      '|'
     A                                    25
     A                                      'PCS'
     A                                    31
     A                                      '|'
     A                                    33
     A                                      'Weight'
     A                                    40
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                    41
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    43
     A                                      'C'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|'
     A            SQTX21         4A  O    47
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    54
     A                                      'Range/'
     A                                    60
     A                                      '|'
     A                                    63
     A                                      'PCS'
     A                                    69
     A                                      '|'
     A                                    71
     A                                      'Weight'
     A                                    78
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                    79
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    81
     A                                      'C'
     A                                      HIGHLIGHT
     A                                    84
     A                                      '|'
     A            SQTX31         4A  O    85
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    92
     A                                      'Range/'
     A                                    98
     A                                      '|'
     A                                   101
     A                                      'PCS'
     A                                   107
     A                                      '|'
     A                                   109
     A                                      'Weight'
     A                                   116
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                   117
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   119
     A                                      'C'
     A                                      HIGHLIGHT
     A                                   122
     A                                      '|'
     A            SQTX41         4A  O   123
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   130
     A                                      'Range/'
     A                                   136
     A                                      '|'
     A                                   139
     A                                      'PCS'
     A                                   145
     A                                      '|'
     A                                   147
     A                                      'Weight'
     A                                   154
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     8
     A                                      '|'
     A            SQTX12         5A  O     9
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    16
     A                                      'SSCC18'
     A                                    22
     A                                      '|'
     A                                    31
     A                                      '|'
     A                                    40
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    41
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|'
     A            SQTX22         5A  O    47
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    54
     A                                      'SSCC18'
     A                                    60
     A                                      '|'
     A                                    69
     A                                      '|'
     A                                    78
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    79
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    84
     A                                      '|'
     A            SQTX32         5A  O    85
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    92
     A                                      'SSCC18'
     A                                    98
     A                                      '|'
     A                                   107
     A                                      '|'
     A                                   116
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   117
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   122
     A                                      '|'
     A            SQTX42         5A  O   123
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   130
     A                                      'SSCC18'
     A                                   136
     A                                      '|'
     A                                   145
     A                                      '|'
     A                                   154
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    41
     A                                      '-----'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '-----'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      '-------'
     A                                    60
     A                                      '|'
     A                                    61
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    69
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    70
     A                                      '--------'
     A                                    78
     A                                      '|'
     A                                    79
     A                                      '-----'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    91
     A                                      '-------'
     A                                    98
     A                                      '|'
     A                                    99
     A                                      '--------'
     A                                   107
     A                                      '|'
     A                                   108
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   116
     A                                      '|'
     A                                   117
     A                                      '-----'
     A                                   122
     A                                      '|'
     A                                   123
     A                                      '-----'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   129
     A                                      '-------'
     A                                   136
     A                                      '|'
     A                                   137
     A                                      '--------'
     A                                   145
     A                                      '|'
     A                                   146
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   154
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R COLUMNS80
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     2
     A                                      '|'
     A                                     6
     A                                      '|'
     A            SQTX180        4         7
     A                                      HIGHLIGHT
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    13
     A                                      'Stop'
     A                                    19
     A                                      '|'
     A                                    21
     A                                      'Stop'
     A                                    26
     A                                      '|'
     A                                    28
     A                                      'Cube/'
     A                                    34
     A                                      '|'
     A                                    35
     A                                      'Dock'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    46
     A                                      '|'
     A            SQTX280        4        47
     A                                      HIGHLIGHT
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      'Stop'
     A                                    59
     A                                      '|'
     A                                    61
     A                                      'Stop'
     A                                    66
     A                                      '|'
     A                                    68
     A                                      'Cube/'
     A                                    74
     A                                      '|'
     A                                    75
     A                                      'Dock'
     A                                    79
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     3
     A                                      'Cmp'
     A                                      HIGHLIGHT
     A                                     6
     A                                      '|'
     A                                     8
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    13
     A                                      'Range'
     A                                    19
     A                                      '|'
     A                                    21
     A                                      'PCS'
     A                                    26
     A                                      '|'
     A                                    27
     A                                      'Weight'
     A                                    34
     A                                      '|'
     A                                    35
     A                                      'Door'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    43
     A                                      'Cmp'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|'
     A                                    48
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      'Range'
     A                                    59
     A                                      '|'
     A                                    61
     A                                      'PCS'
     A                                    66
     A                                      '|'
     A                                    67
     A                                      'Weight'
     A                                    74
     A                                      '|'
     A                                    75
     A                                      'Door'
     A                                    79
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     6
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    19
     A                                      '|'
     A                                    26
     A                                      '|'
     A                                    34
     A                                      '|'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    46
     A                                      '|'
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    59
     A                                      '|'
     A                                    66
     A                                      '|'
     A                                    74
     A                                      '|'
     A                                    79
     A                                      '|'
     A                                     2
     A                                      '|'
     A                                      SPACEB(001)
     A                                     3
     A                                      '---'
     A                                     6
     A                                      '|'
     A                                     7
     A                                      '----'
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    12
     A                                      '-------'
     A                                    19
     A                                      '|'
     A                                    20
     A                                      '------'
     A                                    26
     A                                      '|'
     A                                    27
     A                                      '-------'
     A                                    34
     A                                      '|'
     A                                    35
     A                                      '----'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    43
     A                                      '---'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '----'
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '-------'
     A                                    59
     A                                      '|'
     A                                    60
     A                                      '------'
     A                                    66
     A                                      '|'
     A                                    67
     A                                      '-------'
     A                                    74
     A                                      '|'
     A                                    75
     A                                      '----'
     A                                    79
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R COLUMNSICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                    10
     A                                      '|'
     A            SQTX1          4        11
     A                                      HIGHLIGHT
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    19
     A                                      'Stop'
     A                                    25
     A                                      '|'
     A                                    28
     A                                      'Stop'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A            SQTX2          4        43
     A                                      HIGHLIGHT
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    51
     A                                      'Stop'
     A                                    57
     A                                      '|'
     A                                    60
     A                                      'Stop'
     A                                    66
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'Comp'
     A                                      HIGHLIGHT
     A                                    10
     A                                      '|'
     A                                    13
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    19
     A                                      'Range'
     A                                    25
     A                                      '|'
     A                                    28
     A                                      'PCS'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    37
     A                                      'Comp'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    46
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    51
     A                                      'Range'
     A                                    57
     A                                      '|'
     A                                    60
     A                                      'PCS'
     A                                    66
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                    10
     A                                      '|'
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    25
     A                                      '|'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    57
     A                                      '|'
     A                                    66
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      '------'
     A                                    10
     A                                      '|'
     A                                    11
     A                                      '------'
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    18
     A                                      '-------'
     A                                    25
     A                                      '|'
     A                                    26
     A                                      '--------'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    36
     A                                      '------'
     A                                    42
     A                                      '|'
     A                                    43
     A                                      '------'
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    50
     A                                      '-------'
     A                                    57
     A                                      '|'
     A                                    58
     A                                      '--------'
     A                                    66
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
DRY AA*
     A          R COLUMNSDRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     8
     A                                      '|'
417 DA*                                   11'Unload'
     A            SQTX1          4         9
     A                                      HIGHLIGHT
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    16
     A                                      'Stop'
     A                                    22
     A                                      '|'
     A                                    25
     A                                      'Stop'
     A                                    31
     A                                      '|'
     A                                    34
     A                                      'Cube/'
     A                                    40
     A                                      '|'
     A                                    42
     A                                      'Milk'
     A                                    46
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    47
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
417 DA*                                   51'Unload'
     A            SQTX2          4        53
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    60
     A                                      'Stop'
     A                                    66
     A                                      '|'
     A                                    69
     A                                      'Stop'
     A                                    75
     A                                      '|'
     A                                    78
     A                                      'Cube/'
     A                                    84
     A                                      '|'
     A                                    86
     A                                      'Milk'
     A                                    90
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    91
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    96
     A                                      '|'
417 DA*                                   51'Unload'
     A            SQTX3          4        97
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   104
     A                                      'Stop'
     A                                   110
     A                                      '|'
     A                                   113
     A                                      'Stop'
     A                                   119
     A                                      '|'
     A                                   122
     A                                      'Cube/'
     A                                   128
     A                                      '|'
     A                                   130
     A                                      'Milk'
     A                                   134
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   135
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   140
     A                                      '|'
     A            SQTX4          4A  O   141
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   148
     A                                      'Stop'
     A                                   154
     A                                      '|'
     A                                   157
     A                                      'Stop'
     A                                   163
     A                                      '|'
     A                                   166
     A                                      'Cube/'
     A                                   172
     A                                      '|'
     A                                   174
     A                                      'Milk'
     A                                   178
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     5
     A                                      'C'
     A                                      HIGHLIGHT
     A                                     8
     A                                      '|'
     A            SQTX11         4A  O     9
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    16
     A                                      'Range/'
     A                                    22
     A                                      '|'
     A                                    25
     A                                      'PCS'
     A                                    31
     A                                      '|'
     A                                    33
     A                                      'Weight'
     A                                    40
     A                                      '|'
     A                                    41
     A                                      'Crate'
     A                                    46
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                    47
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    49
     A                                      'C'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
     A            SQTX21         4A  O    53
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    60
     A                                      'Range/'
     A                                    66
     A                                      '|'
     A                                    69
     A                                      'PCS'
     A                                    75
     A                                      '|'
     A                                    77
     A                                      'Weight'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      'Crate'
     A                                    90
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                    91
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    93
     A                                      'C'
     A                                      HIGHLIGHT
     A                                    96
     A                                      '|'
     A            SQTX31         4A  O    97
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   104
     A                                      'Range/'
     A                                   110
     A                                      '|'
     A                                   113
     A                                      'PCS'
     A                                   119
     A                                      '|'
     A                                   121
     A                                      'Weight'
     A                                   128
     A                                      '|'
     A                                   129
     A                                      'Crate'
     A                                   134
     A                                      '|'
BIRaMA*                                   45'Door'
BIRaMA*                                   50'||'
     A                                   135
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   137
     A                                      'C'
     A                                      HIGHLIGHT
     A                                   140
     A                                      '|'
     A            SQTX41         4A  O   141
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   148
     A                                      'Range/'
     A                                   154
     A                                      '|'
     A                                   157
     A                                      'PCS'
     A                                   163
     A                                      '|'
     A                                   165
     A                                      'Weight'
     A                                   172
     A                                      '|'
     A                                   173
     A                                      'Crate'
     A                                   178
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     8
     A                                      '|'
     A            SQTX12         5A  O     9
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    22
     A                                      '|'
     A                                    31
     A                                      '|'
     A                                    40
     A                                      '|'
     A                                    46
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    47
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
     A            SQTX22         5A  O    53
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    66
     A                                      '|'
     A                                    75
     A                                      '|'
     A                                    84
     A                                      '|'
     A                                    90
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    91
     A                                      '*'
     A                                      HIGHLIGHT
     A                                    96
     A                                      '|'
     A            SQTX32         5A  O    97
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   110
     A                                      '|'
     A                                   119
     A                                      '|'
     A                                   128
     A                                      '|'
     A                                   134
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   135
     A                                      '*'
     A                                      HIGHLIGHT
     A                                   140
     A                                      '|'
     A            SQTX42         5A  O   141
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   154
     A                                      '|'
     A                                   163
     A                                      '|'
     A                                   172
     A                                      '|'
     A                                   178
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    41
     A                                      '-----'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '-----'
     A                                    52
     A                                      '|'
     A                                    53
     A                                      '-----'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    59
     A                                      '-------'
     A                                    66
     A                                      '|'
     A                                    67
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    75
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    76
     A                                      '--------'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                    91
     A                                      '-----'
     A                                    96
     A                                      '|'
     A                                    97
     A                                      '-----'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   103
     A                                      '-------'
     A                                   110
     A                                      '|'
     A                                   111
     A                                      '--------'
     A                                   119
     A                                      '|'
     A                                   120
     A                                      '--------'
     A                                   128
     A                                      '|'
     A                                   129
     A                                      '-----'
     A                                   134
     A                                      '|'
     A                                   135
     A                                      '-----'
     A                                   140
     A                                      '|'
     A                                   141
     A                                      '-----'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   147
     A                                      '-------'
     A                                   154
     A                                      '|'
     A                                   155
     A                                      '--------'
     A                                   163
     A                                      '|'
     A                                   164
     A                                      '--------'
     A                                   172
     A                                      '|'
     A                                   173
     A                                      '-----'
     A                                   178
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
DRY AA*
ISYbAA*
ISYbAA* Print column headings
ISYbAA*
     A          R COLUMNSISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     7
     A                                      '|'
     A            SQTX1          4         8
     A                                      HIGHLIGHT
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    14
     A                                      'Stop'
     A                                    20
     A                                      '|'
     A                                    23
     A                                      'Stop'
     A                                    29
     A                                      '|'
     A                                    38
     A                                      '|'
     A                                    39
     A                                      'Dk'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    47
     A                                      '|'
     A            SQTX2          4        48
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    54
     A                                      'Stop'
     A                                    60
     A                                      '|'
     A                                    63
     A                                      'Stop'
     A                                    69
     A                                      '|'
     A                                    77
     A                                      '|'
     A                                    78
     A                                      'Dk'
     A                                    80
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      'Cmp'
     A                                      HIGHLIGHT
     A                                     7
     A                                      '|'
     A                                     9
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    14
     A                                      'Range'
     A                                    20
     A                                      '|'
     A                                    23
     A                                      'PCS'
     A                                    29
     A                                      '|'
     A                                    32
     A                                      'Cube'
     A                                    38
     A                                      '|'
     A                                    39
     A                                      'Dr'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    44
     A                                      'Cmp'
     A                                      HIGHLIGHT
     A                                    47
     A                                      '|'
     A                                    49
     A                                      'Seq'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    54
     A                                      'Range'
     A                                    60
     A                                      '|'
     A                                    63
     A                                      'PCS'
     A                                    69
     A                                      '|'
     A                                    72
     A                                      'Cube'
     A                                    77
     A                                      '|'
     A                                    78
     A                                      'Dr'
     A                                    80
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     7
     A                                      '|'
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    20
     A                                      '|'
     A                                    29
     A                                      '|'
     A                                    38
     A                                      '|'
     A                                    43
     A                                      '|'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    47
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '|'
     A                                    60
     A                                      '|'
     A                                    69
     A                                      '|'
     A                                    77
     A                                      '|'
     A                                    80
     A                                      '|'
     A                                     3
     A                                      '|'
     A                                      SPACEB(001)
     A                                     4
     A                                      '---'
     A                                     7
     A                                      '|'
     A                                     8
     A                                      '----'
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    13
     A                                      '-------'
     A                                    20
     A                                      '|'
     A                                    21
     A                                      '--------'
     A                                    29
     A                                      '|'
     A                                    30
     A                                      '--------'
     A                                    38
     A                                      '|'
     A                                    39
     A                                      '--'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    44
     A                                      '---'
     A                                    47
     A                                      '|'
     A                                    48
     A                                      '----'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      '-------'
     A                                    60
     A                                      '|'
     A                                    61
     A                                      '--------'
     A                                    69
     A                                      '|'
     A                                    70
     A                                      '-------'
     A                                    77
     A                                      '|'
     A                                    78
     A                                      '--'
     A                                    80
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
ISYbAA*
ISYbAA* Print detail line
ISYbAA*
     A*         R DETAIL1ISY
     A*                                     SPACEA(001)
     A*                                    3
     A*                                     '|'
     A*           C1COMP         1A  O     4
     A*                                     HIGHLIGHT
     A*                                    7
     A*                                     '|'
     A*           C1PICK         2S 0O     9
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   12
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C1STPA         3S 0O    13
     A*                                     EDTCDE(4)
     A*                                   16
     A*                                     '-'
     A*           C1STPB         3S 0O    17
     A*                                     EDTCDE(4)
     A*                                   20
     A*                                     '|'
     A*           C1SPCS         5S 0O    22
     A*                                     EDTCDE(4)
     A*                                   29
     A*                                     '|'
740 MA*           C1CUBE         7S 2O    33
     A*                                     EDTCDE(4)
     A*                                   38
     A*                                     '|'
     A*           C1DOOR         3S 0O    39
     A*                                     EDTCDE(4)
     A*                                   41
     A*                                     '**'
     A*                                     HIGHLIGHT
     A*                                   43
     A*                                     '|'
ISYbAA*
     A*           C2COMP         1A  O    45
     A*                                     HIGHLIGHT
     A*                                   47
     A*                                     '|'
     A*           C2PICK         2S 0O    49
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   52
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C2STPA         3S 0O    53
     A*                                     EDTCDE(4)
     A*                                   56
     A*                                     '-'
     A*           C2STPB         3S 0O    57
     A*                                     EDTCDE(4)
     A*                                   60
     A*                                     '|'
     A*           C2SPCS         5S 0O    62
     A*                                     EDTCDE(4)
     A*                                   69
     A*                                     '|'
740 MA*           C2CUBE         7S 2O    73
     A*                                     EDTCDE(4)
     A*                                   77
     A*                                     '|'
     A*           C2DOOR         3S 0O    78
     A*                                     EDTCDE(4)
     A*                                   80
     A*                                     '|'
     A*
     A* Print detail line
     A*
     A          R DETAIL1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            C1COMP         4A  O    +0
     A                                     8
     A                                      '|'
     A            C1PICK         4A  O     9
     A                                      HIGHLIGHT
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C1STP1         2S 0O    19EDTCDE(4)
BIRaMA*                                   21'-'
520 DA*           C1STP2         2S 0O    22EDTCDE(4)
     A*                                   25'|'
     A            C1STPA         3S 0O    15
     A                                      EDTCDE(4)
     A                                    18
     A                                      '-'
     A            C1STPB         3S 0O    19
     A                                      EDTCDE(4)
     A                                    22
     A                                      '|'
     A                                    31
     A                                      '|'
740 MA            C1CUBE         7S 2O    35
     A                                      EDTCDE(4)
     A                                    40
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                    41
     A                                      '*'
     A                                      HIGHLIGHT
     A            C2COMP         4A  O    +0
     A                                    46
     A                                      '|'
     A            C2PICK         4A  O    47
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C2STP1         2S 0O    67EDTCDE(4)
     A            C2STPA         3S 0O    53
     A                                      EDTCDE(4)
     A                                    56
     A                                      '-'
520 DA*           C2STP2         2S 0O    70EDTCDE(4)
     A            C2STPB         3S 0O    57
     A                                      EDTCDE(4)
     A                                    60
     A                                      '|'
     A                                    69
     A                                      '|'
740 MA            C2CUBE         7S 2O    73
     A                                      EDTCDE(4)
     A                                    78
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                    79
     A                                      '*'
     A                                      HIGHLIGHT
     A            C3COMP         4A  O    +0
     A                                    84
     A                                      '|'
     A            C3PICK         4A  O    85
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C3STP1         2S 0O    67EDTCDE(4)
     A            C3STPA         3S 0O    91
     A                                      EDTCDE(4)
     A                                    94
     A                                      '-'
520 DA*           C3STP2         2S 0O    70EDTCDE(4)
     A            C3STPB         3S 0O    95
     A                                      EDTCDE(4)
     A                                    98
     A                                      '|'
     A                                   107
     A                                      '|'
740 MA            C3CUBE         7S 2O   111
     A                                      EDTCDE(4)
     A                                   116
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                   117
     A                                      '*'
     A                                      HIGHLIGHT
     A            C4COMP         4A  O    +0
     A                                   122
     A                                      '|'
     A            C4PICK         4A  O   123
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C4STP1         2S 0O    67EDTCDE(4)
     A            C4STPA         3S 0O   129
     A                                      EDTCDE(4)
     A                                   132
     A                                      '-'
520 DA*           C4STP2         2S 0O    70EDTCDE(4)
     A            C4STPB         3S 0O   133
     A                                      EDTCDE(4)
     A                                   136
     A                                      '|'
     A                                   145
     A                                      '|'
740 MA            C4CUBE         7S 2O   149
     A                                      EDTCDE(4)
     A                                   154
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A* Print detail line  - CHEFS
     A*
     A          R DETAIL1DRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            C1COMP         4A  O    +0
     A                                     8
     A                                      '|'
     A            C1PICK         4A  O     9
     A                                      HIGHLIGHT
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C1STP1         2S 0O    19EDTCDE(4)
BIRaMA*                                   21'-'
520 DA*           C1STP2         2S 0O    22EDTCDE(4)
     A*                                   25'|'
     A            C1STPA         3S 0O    15
     A                                      EDTCDE(4)
     A                                    18
     A                                      '-'
     A            C1STPB         3S 0O    19
     A                                      EDTCDE(4)
     A                                    22
     A                                      '|'
     A                                    31
     A                                      '|'
740 MA            C1CUBE         7S 2O    35
     A                                      EDTCDE(4)
     A                                    40
     A                                      '|'
     A                                    46
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                    47
     A                                      '*'
     A                                      HIGHLIGHT
     A            C2COMP         4A  O    48
     A                                    52
     A                                      '|'
     A            C2PICK         4A  O    53
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C2STP1         2S 0O    67EDTCDE(4)
     A            C2STPA         3S 0O    59
     A                                      EDTCDE(4)
     A                                    62
     A                                      '-'
520 DA*           C2STP2         2S 0O    70EDTCDE(4)
     A            C2STPB         3S 0O    63
     A                                      EDTCDE(4)
     A                                    66
     A                                      '|'
     A                                    75
     A                                      '|'
740 MA            C2CUBE         7S 2O    79
     A                                      EDTCDE(4)
     A                                    84
     A                                      '|'
     A                                    90
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                    91
     A                                      '*'
     A                                      HIGHLIGHT
     A            C3COMP         4A  O    92
     A                                    96
     A                                      '|'
     A            C3PICK         4A  O    97
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C3STP1         2S 0O    67EDTCDE(4)
     A            C3STPA         3S 0O   103
     A                                      EDTCDE(4)
     A                                   106
     A                                      '-'
520 DA*           C3STP2         2S 0O    70EDTCDE(4)
     A            C3STPB         3S 0O   107
     A                                      EDTCDE(4)
     A                                   110
     A                                      '|'
     A                                   119
     A                                      '|'
740 MA            C3CUBE         7S 2O   123
     A                                      EDTCDE(4)
     A                                   128
     A                                      '|'
     A                                   134
     A                                      '|'
BIRaMA*           C1DOOR         3S 0O    45EDTCDE(4)
BIRaMA*                                   50'||'
     A                                   135
     A                                      '*'
     A                                      HIGHLIGHT
     A            C4COMP         4A  O   136
     A                                   140
     A                                      '|'
     A            C4PICK         4A  O   141
     A                                      HIGHLIGHT
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
520 DA*           C4STP1         2S 0O    67EDTCDE(4)
     A            C4STPA         3S 0O   147
     A                                      EDTCDE(4)
     A                                   150
     A                                      '-'
520 DA*           C4STP2         2S 0O    70EDTCDE(4)
     A            C4STPB         3S 0O   151
     A                                      EDTCDE(4)
     A                                   154
     A                                      '|'
     A                                   163
     A                                      '|'
740 MA            C4CUBE         7S 2O   167
     A                                      EDTCDE(4)
     A                                   172
     A                                      '|'
     A                                   178
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A*         R DETAIL180
     A*                                     SPACEA(001)
     A*                                    2
     A*                                     '|'
     A*           C1COMP         1A  O     4
     A*                                     HIGHLIGHT
     A*                                    6
     A*                                     '|'
     A*           C1PICK         2S 0O     8
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   11
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C1STPA         3S 0O    12
     A**                                    EDTCDE(4)
     A*                                   15
     A*                                     '-'
     A*           C1STPB         3S 0O    16
     A*                                     EDTCDE(4)
     A*                                   19
     A*                                     '|'
     A*           C1SPCS         5S 0O    20
     A*                                     EDTCDE(4)
     A*                                   26
     A*                                     '|'
740 MA*           C1CUBE         7S 2O    30
     A*                                     EDTCDE(4)
     A*                                   34
     A*                                     '|'
     A*           C1DOOR         3S 0O    36
     A*                                     EDTCDE(4)
     A*                                   39
     A*                                     '|'
     A*                                   40
     A*                                     '**'
     A*                                     HIGHLIGHT
     A*                                   42
     A*                                     '|'
     A*           C2COMP         1A  O    44
     A*                                     HIGHLIGHT
     A*                                   46
     A*                                     '|'
     A*           C2PICK         2S 0O    48
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   51
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C2STPA         3S 0O    52
     A*                                     EDTCDE(4)
     A*                                   55
     A*                                     '-'
     A*           C2STPB         3S 0O    56
     A*                                     EDTCDE(4)
     A*                                   59
     A*                                     '|'
     A*           C2SPCS         5S 0O    60
     A*                                     EDTCDE(4)
     A*                                   66
     A*                                     '|'
740 MA*           C2CUBE         7S 2O    70
     A*                                     EDTCDE(4)
     A*                                   74
     A*                                     '|'
     A*           C2DOOR         3S 0O    76
     A*                                     EDTCDE(4)
     A*                                   79
     A*                                     '|'
     A*
     A*         R DETAIL1ICB
     A*                                     SPACEA(001)
     A*                                    3
     A*                                     '|'
     A*           C1COMP         1A  O     6
     A*                                     HIGHLIGHT
     A*                                   10
     A*                                     '|'
     A*           C1PICK         2S 0O    13
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   17
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C1STPA         3S 0O    18
     A*                                     EDTCDE(4)
     A*                                   21
     A*                                     '-'
     A*           C1STPB         3S 0O    22
     A*                                     EDTCDE(4)
     A*                                   25
     A*                                     '|'
     A*           C1SPCS         5S 0O    28
     A*                                     EDTCDE(4)
     A*                                   34
     A*                                     '**'
     A*                                     HIGHLIGHT
     A*           C2COMP         1A  O    38
     A*                                     HIGHLIGHT
     A*                                   42
     A*                                     '|'
     A*           C2PICK         2S 0O    44
     A*                                     EDTCDE(4)
     A*                                     HIGHLIGHT
     A*                                   47
     A*                                     '|'
     A*                                     HIGHLIGHT
     A*           C2STPA         3S 0O    48
     A*                                     EDTCDE(4)
     A*                                   51
     A*                                     '-'
     A*           C2STPB         3S 0O    52
     A*                                     EDTCDE(4)
     A*                                   55
     A*                                     '|'
     A*           C2SPCS         5S 0O    58
     A*                                     EDTCDE(4)
     A*                                   64
     A*                                     '|'
     A          R LDSD
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            C1LDSD         6A  O     4
     A                                    10
     A                                      '|'
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    25
     A                                      '|'
     A                                    34
     A                                      '|'
     A                                    43
     A                                      '|'
     A                                    50
     A                                      '**'
     A                                      HIGHLIGHT
     A            C2LDSD         6A  O    52
     A                                    58
     A                                      '|'
     A                                    65
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    73
     A                                      '|'
     A                                    82
     A                                      '|'
     A                                    91
     A                                      '|'
     A                                    98
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print Stop detail line
     A*
     A          R DETAIL2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            S1COMP         1A  O     5
     A                                     6
     A                                      '|'
520 DA*           S1STP1         2S 0O    68EDTCDE(4)
     A            S1STPA         2S 0O     8
     A                                      EDTCDE(4)
BIRaDA*           S1PICK         2S 0O    13EDTCDE(4)
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
510aDA*                                   17'*'
     A                                    19
     A                                      '|'
     A                                      HIGHLIGHT
     A            S1SPCS         5S 0O    22
     A                                      EDTCDE(4)
     A                                    28
     A                                      '|'
     A            S1CUBE         5S 2O    30
     A                                      EDTCDE(4)
     A                                    37
     A                                      '|'
BIRaDA*           S1DOOR         3S 0O    45EDTCDE(4)
BIRaAA*                                   50'||'
     A                                    38
     A                                      '*'
     A                                      HIGHLIGHT
     A*
     A            S2COMP         1A  O    40
     A                                    41
     A                                      '|'
520 DA*           S2STP1         2S 0O    68EDTCDE(4)
     A            S2STPA         2S 0O    43
     A                                      EDTCDE(4)
BIRaDA*           S2PICK         2S 0O    61EDTCDE(4)
     A                                    46
     A                                      '|'
510aDA*                                   65'*'
     A                                    54
     A                                      '|'
     A                                      HIGHLIGHT
     A            S2SPCS         5S 0O    57
     A                                      EDTCDE(4)
     A                                    63
     A                                      '|'
     A            S2CUBE         5S 2O    65
     A                                      EDTCDE(4)
     A                                    72
     A                                      '|'
BIRaDA*           S1DOOR         3S 0O    45EDTCDE(4)
BIRaAA*                                   50'||'
     A                                    73
     A                                      '*'
     A                                      HIGHLIGHT
     A*
     A            S3COMP         1A  O    75
     A                                    76
     A                                      '|'
520 DA*           S3STP1         2S 0O    68EDTCDE(4)
     A            S3STPA         2S 0O    78
     A                                      EDTCDE(4)
BIRaDA*                                   77'-'
BIRaDA*           S3STP2         2S 0O    78EDTCDE(4)
     A                                    81
     A                                      '|'
BIRaDA*                                   77'-'
BIRaDA*           S3STP2         2S 0O    78EDTCDE(4)
     A                                    89
     A                                      '|'
     A            S3SPCS         5S 0O    92
     A                                      EDTCDE(4)
     A                                    98
     A                                      '|'
     A            S3CUBE         5S 2O   100
     A                                      EDTCDE(4)
     A                                   107
     A                                      '|'
     A*
     A            S4COMP         1A  O   108
     A                                   109
     A                                      '|'
520 DA*           S4STP1         2S 0O    68EDTCDE(4)
     A            S4STPA         2S 0O   111
     A                                      EDTCDE(4)
BIRaDA*                                   77'-'
BIRaDA*           S4STP2         2S 0O    78EDTCDE(4)
     A                                   114
     A                                      '|'
BIRaDA*                                   77'-'
BIRaDA*           S4STP2         2S 0O    78EDTCDE(4)
     A                                   122
     A                                      '|'
     A            S4SPCS         5S 0O   125
     A                                      EDTCDE(4)
     A                                   131
     A                                      '|'
     A            S4CUBE         5S 2O   133
     A                                      EDTCDE(4)
     A                                   140
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R DETAIL3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            S1COMP         1A  O     5
     A                                    11
     A                                      '|'
510aDA*                                   17'*'
     A                                      HIGHLIGHT
     A**          S1STP1         2S 0O    20EDTCDE(4)
     A            S1STDP         7A  O    12
     A                                    19
     A                                      '|'
     A            S1SPCS         5S 0O    22
     A                                      EDTCDE(4)
     A                                    28
     A                                      '|'
     A            S1CUBE         5S 2O    30
     A                                      EDTCDE(4)
     A                                    37
     A                                      '|'
     A                                    38
     A                                      '*'
     A                                      HIGHLIGHT
     A*
     A            S2COMP         1A  O    40
     A                                    41
     A                                      '|'
     A                                    46
     A                                      '|'
     A***         S2STP1         2S 0O    68EDTCDE(4)
     A            S2STDP         7A  O    47
     A                                    54
     A                                      '|'
     A            S2SPCS         5S 0O    57
     A                                      EDTCDE(4)
510aDA*                                   65'*'
     A                                    63
     A                                      '|'
     A                                      HIGHLIGHT
     A            S2CUBE         5S 2O    65
     A                                      EDTCDE(4)
     A                                    72
     A                                      '|'
     A                                    73
     A                                      '*'
     A                                      HIGHLIGHT
     A*
     A            S3COMP         1A  O    75
     A                                    76
     A                                      '|'
BIRaDA*                                   77'-'
BIRaDA*           S3STP2         2S 0O    78EDTCDE(4)
     A                                    80
     A                                      '|'
     A***         S3STP1         2S 0O    68EDTCDE(4)
     A            S3STDP         7A  O    81
BIRaDA*                                   77'-'
BIRaDA*           S3STP2         2S 0O    78EDTCDE(4)
     A                                    89
     A                                      '|'
     A            S3SPCS         5S 0O    92
     A                                      EDTCDE(4)
     A                                    98
     A                                      '|'
     A            S3CUBE         5S 2O   100
     A                                      EDTCDE(4)
     A                                   107
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
520aAA* Print route and pallet id combination
     A*
WSF  A* Print detail3W line West Side
WSF  A*
     A          R DETAIL3W
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                    10
     A                                      '|'
     A N21                                12
     A                                      'PALLET'
     A N21                                19
     A                                      'Transaction#:'
     A N21        C1TRN#         7S 0O    33
     A                                      EDTCDE(4)
     A                                    43
     A                                      '|'
     A                                    50
     A                                      '||'
     A*
     A                                    58
     A                                      '|'
     A N22                                60
     A                                      'PALLET'
     A N22                                67
     A                                      'Transaction#:'
     A N22        C2TRN#         7S 0O    81
     A                                      EDTCDE(4)
     A                                    91
     A                                      '|'
     A                                    98
     A                                      '||'
     A*
     A                                   106
     A                                      '|'
     A N22                               108
     A                                      'PALLET'
     A N22                               115
     A                                      'Transaction#:'
     A N22        C3TRN#         7S 0O   129
     A                                      EDTCDE(4)
     A                                   139
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
WSF  A
WSFa A* Print detail4W line - bulk pick
WSFa A*
     A          R DETAIL4W
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                    10
     A                                      '|'
     A N23                                12
     A                                      'BLKPCK'
     A N23                                19
     A                                      'Transaction#:'
     A N23        C1BTRN         7S 0O    33
     A                                      EDTCDE(4)
     A                                    43
     A                                      '|'
     A                                    50
     A                                      '||'
WSFa A*
     A                                    58
     A                                      '|'
     A N24                                60
     A                                      'BLKPCK'
     A N24                                67
     A                                      'Transaction#:'
     A N24        C2BTRN         7S 0O    81
     A                                      EDTCDE(4)
     A                                    91
     A                                      '|'
     A                                    98
     A                                      '||'
WSFa A*
     A                                   106
     A                                      '|'
     A N24                               108
     A                                      'BLKPCK'
     A N24                               115
     A                                      'Transaction#:'
     A N24        C3BTRN         7S 0O   129
     A                                      EDTCDE(4)
     A                                   139
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R DETAIL4
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A            C1RTPA         7A  O    18
     A            C2RTPA         7A  O    66
     A            C3RTPA         7A  O   114
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*
     A* Print DASH1
     A*
     A          R DASH1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            C1PCMP         4A  O    +0
     A                                     8
     A                                      '|'
     A            C1PAL#         5S 0O    +0
     A                                      EDTCDE(Z)
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A            C1PLID         7A  O    15
     A                                    22
     A                                      '|'
     A            C1SPCS         5S 0O    24
     A                                      EDTCDE(4)
     A                                    31
     A                                      '|'
     A            C1WGT          6S 0O    32
     A                                      EDTCDE(4)
     A                                    40
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    41
     A                                      '*'
     A                                      HIGHLIGHT
     A            C2PCMP         4A  O    42
     A                                    46
     A                                      '|'
     A            C2PAL#         5S 0O    47
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A            C2PLID         7A  O    53
     A                                    60
     A                                      '|'
     A            C2SPCS         5S 0O    62
     A                                      EDTCDE(4)
     A                                    69
     A                                      '|'
     A            C2WGT          6S 0O    70
     A                                      EDTCDE(4)
     A                                    78
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    79
     A                                      '*'
     A                                      HIGHLIGHT
     A            C3PCMP         4A  O    80
     A                                    84
     A                                      '|'
     A            C3PAL#         5S 0O    85
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A            C3PLID         7A  O    91
     A                                    98
     A                                      '|'
     A            C3SPCS         5S 0O   100
     A                                      EDTCDE(4)
     A                                   107
     A                                      '|'
     A            C3WGT          6S 0O   108
     A                                      EDTCDE(4)
     A                                   116
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   117
     A                                      '*'
     A                                      HIGHLIGHT
     A            C4PCMP         4A  O   118
     A                                   122
     A                                      '|'
     A            C4PAL#         5S 0O   123
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A            C4PLID         7A  O   129
     A                                   136
     A                                      '|'
     A            C4SPCS         5S 0O   138
     A                                      EDTCDE(4)
     A                                   145
     A                                      '|'
     A            C4WGT          6S 0O   146
     A                                      EDTCDE(4)
     A                                   154
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print DASH1DRY
     A*
     A          R DASH1DRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A            C1PCMP         4A  O    +0
     A                                     8
     A                                      '|'
     A            C1PAL#         5S 0O    +0
     A                                      EDTCDE(Z)
418 DA*                                   17'|'
510aDA*                                   17'*'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A            C1PLID         7A  O    15
     A                                    22
     A                                      '|'
     A            C1SPCS         5S 0O    24
     A                                      EDTCDE(4)
     A                                    31
     A                                      '|'
     A            C1WGT          6S 0O    32
     A                                      EDTCDE(4)
     A                                    40
     A                                      '|'
     A                                    46
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    47
     A                                      '*'
     A                                      HIGHLIGHT
     A            C2PCMP         4A  O    48
     A                                    52
     A                                      '|'
     A            C2PAL#         5S 0O    53
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A            C2PLID         7A  O    59
     A                                    66
     A                                      '|'
     A            C2SPCS         5S 0O    68
     A                                      EDTCDE(4)
     A                                    75
     A                                      '|'
     A            C2WGT          6S 0O    76
     A                                      EDTCDE(4)
     A                                    84
     A                                      '|'
     A                                    90
     A                                      '|'
BIRaMA*                                   50'||'
     A                                    91
     A                                      '*'
     A                                      HIGHLIGHT
     A            C3PCMP         4A  O    92
     A                                    96
     A                                      '|'
     A            C3PAL#         5S 0O    97
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A            C3PLID         7A  O   103
     A                                   110
     A                                      '|'
     A            C3SPCS         5S 0O   112
     A                                      EDTCDE(4)
     A                                   119
     A                                      '|'
     A            C3WGT          6S 0O   120
     A                                      EDTCDE(4)
     A                                   128
     A                                      '|'
     A                                   134
     A                                      '|'
BIRaMA*                                   50'||'
     A                                   135
     A                                      '*'
     A                                      HIGHLIGHT
     A            C4PCMP         4A  O   136
     A                                   140
     A                                      '|'
     A            C4PAL#         5S 0O   141
     A                                      EDTCDE(Z)
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A            C4PLID         7A  O   147
     A                                   154
     A                                      '|'
     A            C4SPCS         5S 0O   156
     A                                      EDTCDE(4)
     A                                   163
     A                                      '|'
     A            C4WGT          6S 0O   164
     A                                      EDTCDE(4)
     A                                   172
     A                                      '|'
     A                                   178
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print START OVERFLOW
     A*
     A          R STROVRF
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    44
     A                                      'Start Overflow Pallet Positions'
     A                                    78
     A                                      '|'
     A                                    79
     A                                      '-----'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    91
     A                                      '-------'
     A                                    98
     A                                      '|'
     A                                    99
     A                                      '--------'
     A                                   107
     A                                      '|'
     A                                   108
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   116
     A                                      '|'
     A                                   117
     A                                      '-----'
     A                                   122
     A                                      '|'
     A                                   123
     A                                      '-----'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   129
     A                                      '-------'
     A                                   136
     A                                      '|'
     A                                   137
     A                                      '--------'
     A                                   145
     A                                      '|'
     A                                   146
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   154
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print START OVERFLOW
     A*
     A          R STROVRFDRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    46
     A                                      'Start Overflow Pallet Positions'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                    91
     A                                      '-----'
     A                                    96
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    97
     A                                      '-----'
     A                                   102
     A                                      '|'
     A                                   103
     A                                      '-------'
     A                                   110
     A                                      '|'
     A                                   111
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   119
     A                                      '|'
     A                                   120
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   128
     A                                      '|'
     A                                   129
     A                                      '-----'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   134
     A                                      '|'
     A                                   135
     A                                      '-----'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   140
     A                                      '|'
     A                                   141
     A                                      '-----'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                   147
     A                                      '-------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   154
     A                                      '|'
     A                                   155
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   163
     A                                      '|'
     A                                   164
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   172
     A                                      '|'
     A                                   173
     A                                      '-----'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   178
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R DASH180
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     2
     A                                      '|'
     A                                     6
     A                                      '|'
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    19
     A                                      '|'
     A                                    26
     A                                      '|'
     A            C1WGT          6S 0O    27
     A                                      EDTCDE(4)
     A                                    34
     A                                      '|'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    46
     A                                      '|'
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    59
     A                                      '|'
     A                                    66
     A                                      '|'
     A            C2WGT          6S 0O    67
     A                                      EDTCDE(4)
     A                                    74
     A                                      '|'
     A                                    79
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R DASH1ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                    10
     A                                      '|'
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    25
     A                                      '|'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    57
     A                                      '|'
     A                                    66
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print DASH2
     A*
     A          R DASH2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    41
     A                                      '-----'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '-----'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      '-------'
     A                                    60
     A                                      '|'
     A                                    61
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    69
     A                                      '|'
     A                                    70
     A                                      '--------'
     A                                    78
     A                                      '|'
     A                                    79
     A                                      '-----'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    91
     A                                      '-------'
     A                                    98
     A                                      '|'
     A                                    99
     A                                      '--------'
     A                                   107
     A                                      '|'
     A                                   108
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   116
     A                                      '|'
     A                                   117
     A                                      '-----'
     A                                   122
     A                                      '|'
     A                                   123
     A                                      '-----'
     A                                   128
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   129
     A                                      '-------'
     A                                   136
     A                                      '|'
     A                                   137
     A                                      '--------'
     A                                   145
     A                                      '|'
     A                                   146
     A                                      '--------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   154
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Print DASH2
     A*
     A          R DASH2DRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '----'
     A                                     8
     A                                      '|'
     A                                     9
     A                                      '-----'
     A                                    14
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    15
     A                                      '-------'
418 AA*                                   17'|'
510aDA*                                   17'*'
     A                                    22
     A                                      '|'
     A                                    23
     A                                      '--------'
     A                                    31
     A                                      '|'
     A                                    32
     A                                      '--------'
     A                                    40
     A                                      '|'
     A                                    41
     A                                      '-----'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '-----'
     A                                    52
     A                                      '|'
     A                                    53
     A                                      '-----'
     A                                    58
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    59
     A                                      '-------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                    66
     A                                      '|'
     A                                    67
     A                                      '--------'
     A                                    75
     A                                      '|'
     A                                    76
     A                                      '--------'
     A                                    84
     A                                      '|'
     A                                    85
     A                                      '-----'
     A                                    90
     A                                      '|'
     A                                    91
     A                                      '-----'
     A                                    96
     A                                      '|'
     A                                    97
     A                                      '-----'
     A                                   102
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   103
     A                                      '-------'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   110
     A                                      '|'
     A                                   111
     A                                      '--------'
     A                                   119
     A                                      '|'
     A                                   120
     A                                      '--------'
     A                                   128
     A                                      '|'
     A                                   129
     A                                      '-----'
     A                                   134
     A                                      '|'
     A                                   135
     A                                      '-----'
     A                                   140
     A                                      '|'
     A                                   141
     A                                      '-----'
BIRaMA*                                   65'|'
510aDA*                                   65'*'
     A                                   146
     A                                      '|'
     A                                      HIGHLIGHT
     A                                   147
     A                                      '-------'
     A                                   154
     A                                      '|'
     A                                   155
     A                                      '--------'
     A                                   163
     A                                      '|'
     A                                   164
     A                                      '--------'
     A                                   172
     A                                      '|'
     A                                   173
     A                                      '-----'
     A                                   178
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R DASH1ISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
ISYbAA*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     7
     A                                      '|'
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    20
     A                                      '|'
     A                                    29
     A                                      '|'
     A                                    38
     A                                      '|'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    47
     A                                      '|'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    60
     A                                      '|'
     A                                    69
     A                                      '|'
     A                                    77
     A                                      '|'
     A                                    80
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
ISYbAA*
ISYbAA* Print DASH2
ISYbAA*
     A          R DASH2ISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
ISYbAA*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '---'
     A                                     7
     A                                      '|'
     A                                     8
     A                                      '----'
     A                                    12
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    13
     A                                      '-------'
     A                                    20
     A                                      '|'
     A                                    21
     A                                      '--------'
     A                                    29
     A                                      '|'
     A                                    30
     A                                      '--------'
     A                                    38
     A                                      '|'
     A                                    39
     A                                      '--'
     A                                    41
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    43
     A                                      '|'
     A                                    44
     A                                      '---'
     A                                    47
     A                                      '|'
     A                                    48
     A                                      '----'
     A                                    52
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    53
     A                                      '-------'
     A                                    60
     A                                      '|'
     A                                    61
     A                                      '--------'
     A                                    69
     A                                      '|'
     A                                    70
     A                                      '--------'
     A                                    77
     A                                      '|'
     A                                    78
     A                                      '--'
     A                                    80
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R DASH280
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     2
     A                                      '|'
     A                                     3
     A                                      '---'
     A                                     6
     A                                      '|'
     A                                     7
     A                                      '----'
     A                                    11
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    12
     A                                      '-------'
     A                                    19
     A                                      '|'
     A                                    20
     A                                      '------'
     A                                    26
     A                                      '|'
     A                                    27
     A                                      '-------'
     A                                    34
     A                                      '|'
     A                                    35
     A                                      '----'
     A                                    39
     A                                      '|'
     A                                    40
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    42
     A                                      '|'
     A                                    43
     A                                      '---'
     A                                    46
     A                                      '|'
     A                                    47
     A                                      '----'
     A                                    51
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    52
     A                                      '-------'
     A                                    59
     A                                      '|'
     A                                    60
     A                                      '------'
     A                                    66
     A                                      '|'
     A                                    67
     A                                      '-------'
     A                                    74
     A                                      '|'
     A                                    75
     A                                      '----'
     A                                    79
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R DASH2ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A*
     A                                      SPACEA(001)
     A                                     3
     A                                      '|'
     A                                     4
     A                                      '------'
     A                                    10
     A                                      '|'
     A                                    11
     A                                      '------'
     A                                    17
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    18
     A                                      '-------'
     A                                    25
     A                                      '|'
     A                                    26
     A                                      '--------'
     A                                    34
     A                                      '**'
     A                                      HIGHLIGHT
     A                                    36
     A                                      '------'
     A                                    42
     A                                      '|'
     A                                    43
     A                                      '------'
     A                                    49
     A                                      '|'
     A                                      HIGHLIGHT
     A                                    50
     A                                      '-------'
     A                                    57
     A                                      '|'
     A                                    58
     A                                      '--------'
     A                                    66
     A                                      '|'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A*
     A* Print Stops Summary
     A*
BIRaAA*
     A          R STPCOL
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     5
     A                                      'Pallet Stops Detail'
     A                                     5
     A                                      'Comp'
     A                                      UNDERLINE
     A                                      SPACEB(001)
     A                                    11
     A                                      'Column'
     A                                      UNDERLINE
     A                                    19
     A                                      'Row'
     A                                      UNDERLINE
     A                                    24
     A                                      'Pallet'
     A                                      UNDERLINE
     A                                    32
     A                                      'Stop'
     A                                      UNDERLINE
     A                                    38
     A                                      'Pieces'
     A                                      UNDERLINE
     A                                    47
     A                                      'Cube'
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R STPDTL
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A            STPCMP         1A  O     5
     A            STPCLM         1S 0O    13
     A                                      EDTCDE(4)
     A            STPROW         2S 0O    19
     A                                      EDTCDE(4)
     A            STPPID         7S 0O    23
     A                                      EDTCDE(4)
     A            STPSTP         2S 0O    33
     A                                      EDTCDE(4)
     A            STPPCS         5S 0O    38
     A                                      EDTCDE(4)
     A            STPCUB         7S 3O    46
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
414 AA*
     A*
     A* Print totals
     A*
414 AA*
     A          R TOTCOL
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     5
     A                                      'Totals Summary'
     A                                    39
     A                                      ' RTEID:'
     A            PSRTID    R        O    50
     A                                      REFFLD(PSRTID PLTSUM)
     A                                     5
     A                                      'Comp'
     A                                      UNDERLINE
     A                                      SPACEB(001)
     A                                    +3
     A                                      'Pallet'
     A                                      UNDERLINE
417aDA**                                  +3'Pieces'
     A                                    21
     A                                      'Cases'
     A                                      UNDERLINE
     A                                    28
     A                                      'Eaches'
     A                                      UNDERLINE
     A                                    39
     A                                      'Cube'
     A                                      UNDERLINE
     A                                    49
     A                                      'Weight'
     A                                      UNDERLINE
     A                                    59
     A                                      'SHORTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R TOTCOLISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     5
     A                                      'Totals Summary'
     A                                    39
     A                                      'Route ID:'
     A            PSRTID    R        O    50
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    57
     A                                      'Trailer #:'
     A                                    69
     A                                      '___________'
     A                                     5
     A                                      'Comp'
     A                                      UNDERLINE
     A                                      SPACEB(001)
     A                                    +3
     A                                      'Pallet'
     A                                      UNDERLINE
     A                                    21
     A                                      'Cases'
     A                                      UNDERLINE
     A                                    28
     A                                      'Eaches'
     A                                      UNDERLINE
     A                                    39
     A                                      'Cube'
     A                                      UNDERLINE
     A                                    49
     A                                      'Weight'
     A                                      UNDERLINE
     A                                    +2
     A                                      'Loaded by:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R TOTAL1ISY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A            COMPRT         1A  O     5
     A            TOTCOM         2S 0O    14
     A                                      EDTCDE(4)
     A            TOTPCN         5S 0O    21
     A                                      EDTCDE(4)
     A            TOTPC1         5S 0O    28
     A                                      EDTCDE(4)
     A            TOTCUB         7S 3O    35
     A                                      EDTCDE(4)
     A            TOTWGT         9S 2O    45
     A                                      EDTCDE(4)
     A                                    57
     A                                      '_____________'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
414 AA*
     A          R TOTCOL80
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     5
     A                                      'Totals Summary'
     A                                    31
     A                                      'RTEID:'
     A            PSRTID    R        O    39
     A                                      REFFLD(PSRTID PLTSUM)
     A                                     5
     A                                      'Comp'
     A                                      UNDERLINE
     A                                      SPACEB(001)
     A                                    12
     A                                      'Pallet'
     A                                      UNDERLINE
     A                                    21
     A                                      'Cases'
     A                                      UNDERLINE
     A                                    28
     A                                      'Eaches'
     A                                      UNDERLINE
     A                                    39
     A                                      'Cube'
     A                                      UNDERLINE
     A                                    49
     A                                      'Weight'
     A                                      UNDERLINE
     A                                    59
     A                                      'SHORTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R TOTCOLICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     5
     A                                      'Totals Summary'
     A                                    39
     A                                      'RTEID:'
     A            PSRTID    R        O    50
     A                                      REFFLD(PSRTID PLTSUM)
     A                                     5
     A                                      'Comp'
     A                                      UNDERLINE
     A                                      SPACEB(001)
     A                                    +3
     A                                      'Pallet'
     A                                      UNDERLINE
    DA**                                  +3'Pieces'
     A                                    21
     A                                      'Cases'
     A                                      UNDERLINE
     A                                    28
     A                                      'Eaches'
     A                                      UNDERLINE
     A                                    39
     A                                      'Cube'
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R TOTAL1ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            COMPRT         1A  O     5
     A            TOTCOM         2S 0O    14
     A                                      EDTCDE(4)
     A            TOTPCN         5S 0O    21
     A                                      EDTCDE(4)
     A            TOTPC1         5S 0O    28
     A                                      EDTCDE(4)
     A            TOTCUB         7S 3O    35
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*
     A          R TOTAL2ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            GOTCOM         2S 0O    14
     A                                      EDTCDE(4)
     A            GOTPCN         5S 0O    21
     A                                      EDTCDE(4)
     A            GOTPC1         5S 0O    28
     A                                      EDTCDE(4)
     A            GOTCUB         7S 3O    35
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A          R TOTAL1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            COMPRT         1A  O     2
     A            TPDESC        15A  O     4
     A            TOTCOM         2S 0O    14
     A                                      EDTCDE(4)
     A            TOTPCN         5S 0O    21
     A                                      EDTCDE(4)
     A            TOTPC1         5S 0O    28
     A                                      EDTCDE(4)
417aDA**          TOTPCS         5S 0O    21EDTCDE(4)
     A            TOTCUB         7S 3O    35
     A                                      EDTCDE(4)
     A            TOTWGT         9S 2O    45
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
414 AA*
     A          R TOTAL2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A            GOTCOM         2S 0O    14
     A                                      EDTCDE(4)
     A            GOTPCN         5S 0O    21
     A                                      EDTCDE(4)
     A            GOTPC1         5S 0O    28
     A                                      EDTCDE(4)
417aDA*           GOTPCS         5S 0O    21EDTCDE(4)
     A            GOTCUB         7S 3O    35
     A                                      EDTCDE(4)
     A            GOTWGT         9S 2O    45
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
YHA AA*
     A          R TOTAL3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A                                    12
     A                                      'TOTAL COUNT:'
     A            GOTPCS         5S 0O    25
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R ISY29
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                   103
     A                                      'Trailer #:'
     A                                    +2
     A                                      '____________________'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A          R ISY32
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                   103
     A                                      'Loaded by: FROZ'
     A                                    +2
     A                                      '____________________'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A          R ISY35
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                   103
     A                                      '          COOLR'
     A                                    +2
     A                                      '____________________'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A          R ISY38
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                   103
     A                                      '            DRY'
     A                                    +2
     A                                      '____________________'
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*
     A          R PFC1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     2
     A                                      'Truck clean:  Yes  No'
     A                                     5
     A                                      'If no, explain'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__________________________________-
     A                                      ____________'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R PFC2
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                     2
     A                                      'Refrigeration unit operating'
     A                                    +1
     A                                      'Yes  No'
     A                                     5
     A                                      'If no, action taken'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__________________________________-
     A                                      _______'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R PFC3
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(002)
     A                                     2
     A                                      'Evidence of rodent  Yes  No'
     A                                     5
     A                                      'If yes, action taken'
     A                                      SPACEB(001)
     A                                    +1
     A                                      '__________________________________-
     A                                      ______'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A          R QUALITY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
530 D ***                                103'QUALITY ISSUES:'
     A                                    59
     A                                      'QUALITY ISSUES:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R QUALITY80
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      'QUALITY ISSUES:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R COMENTS
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
530 D ***                                103'COMMENTS:'
     A                                    59
     A                                      'COMMENTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%***********************************************************************
     A*
     A          R COMENTS80
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     7
     A                                      'COMMENTS:'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
CSPbAA**********************************************************
     A          R USDA
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SKIPB(002)
700aMA*           UDATE          6S 0O     3
     A            CURDATE        6S 0O     3
     A                                      EDTCDE(Y)
     A                                    42
     A                                      'Truck Summary'
     A                                    80
     A                                      'Page'
     A            PAGE           4S 0O    84
     A                                      EDTCDE(Z)
     A                                      SPACEA(001)
CSPbAA*
     A            TIME           6S 0O     3
     A                                      EDTWRD('  :  :  ')
     A            WHSE          30A  O    30
     A                                    83
     A                                      'PS314'
     A                                      SPACEA(002)
     A                                     3
     A                                      'ROUTE:'
     A            ROUTE     R        O    10
     A                                      REFFLD(PSRTID PLTSUM)
     A                                    +5
     A                                      'DRIVER:_________'
     A                                    +5
     A                                      'TRUCK#:'
     A            TRUCK     R        O    +1
     A                                      REFFLD(PSTRUK PLTSUM)
     A                                      SPACEA(005)
     A                                     3
     A                                      '1. Slot Inspector: I have verified-
     A                                       that the condition of the truck wa-
     A                                      s fee of debris, '
     A                                      SPACEA(001)
     A                                     3
     A                                      'pest, and other forms of potential-
     A                                       contamination prior to loading.   -
     A                                       '
     A                                    +1
     A                                      '(Initials) ______________________'
     A                                      SPACEA(001)
     A                                     3
     A                                      '2. Trailer is maintaining a temper-
     A                                      ature of between 32 and 40 degrees '
     A                                      SPACEA(002)
     A                                     3
     A                                      'F? Temp: ________ Temp: ________ T-
     A                                      emp: ________ Temp: ________ '
     A                                      SPACEA(002)
     A                                     3
     A                                      '3. Food is free of tampering and i-
     A                                      n compliance with the integrity of -
     A                                      the food safety defense.  '
     A                                      SPACEA(001)
     A                                     3
     A                                      '(Initials) ______________________'
     A                                      SPACEA(001)
     A                                     3
     A                                      'Driver: _________________________'
     A                                    40
     A                                      'Coastal SunBelt Produce'
     A                                      SPACEA(001)
     A                                    40
     A                                      '8704 Bollman Place'
     A                                      SPACEA(001)
     A                                     3
     A                                      'QA Verification: ________________'
     A                                    40
     A                                      'Savage, Maryland  20763'
     A                                      SPACEA(002)
     A                                     3
     A                                      '------'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |  Shorts'
     A                                      SPACEA(001)
     A                                     3
     A                                      '------'
     A                                      SPACEA(002)
     A                                     3
     A                                      '------'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |  Jit'
     A                                      SPACEA(001)
     A                                     3
     A                                      '------'
     A                                      SPACEA(002)
     A                                     3
     A                                      '------'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |'
     A                                      SPACEA(001)
     A                                     3
     A                                      '|    |  Broken'
     A                                      SPACEA(001)
     A                                     3
     A                                      '------'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CL 002
     A*%%CL 005
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A* Skip 1 Line
     A*
     A          R SKIP1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      TEXT('SKIP ONE LINE')
     A                                      SPACEA(001)
     A                                     1
     A                                      ' '
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A          R FOOT1ICB
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                    24
     A                                      '           REAR'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                      SPACEA(002)
     A                                    14
     A                                      'Back Seal# ___________  Yes   No'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                    14
     A                                      'Side Seal# ___________  Yes   No'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                    14
     A                                      'INITIALS:  ___________'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                     4
     A                                      'Vehicle has been inspected and fou-
     A                                      nd to be clean, free of odors,'
     A                                      SPACEA(001)
     A                                    10
     A                                      'leaks and Non-food Freight. Yes   -
     A                                      No'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
ICBdDA*                                   14'Temperature: __________'
     A                                     8
     A                                      'Truck Temperature: __________'
     A                                      HIGHLIGHT
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 002
     A*%%CL 002
     A*%%CL 002
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*
     A*****************************************************************
     A          R HKWVFY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 001
     A*%%***********************************************************************
     A                                      SPACEB(002)
     A                                     6
     A                                      'Circle for Verification'
     A                                      UNDERLINE
     A                                   +10
     A                                      'Setpoint Temperature: __________'
     A                                      SPACEA(002)
HKWbDA***                                  6'P&R     C     O     PS'
     A                                     6
     A                                      'P&R     C     O     PS     L'
     A                                      HIGHLIGHT
HKWbDA***                                +11'Ambient Temperature: __________'
     A                                    +5
     A                                      'Ambient Temperature: __________'
     A                                      SPACEA(002)
     A                                     6
     A                                      'P&R-Truck/Trailer is Pest &'
     A                                    +1
     A                                      'Rodent Free'
     A                                      SPACEA(001)
     A                                     6
     A                                      'C-Truck/Trailer-Clean,'
     A                                    +1
     A                                      'swepted & free of debris'
     A                                      SPACEA(001)
     A                                     6
     A                                      'O-Truck/Trialer odor free'
     A                                      SPACEA(001)
     A                                     6
     A                                      'PS-Proper sealing of all'
     A                                    +1
     A                                      'drain holes in any of the'
     A                                    +1
     A                                      'Truck/Trailer floors'
     A                                      SPACEA(001)
     A                                    +7
     A                                      'that are in temperature'
     A                                    +1
     A                                      'controlled areas of the'
     A                                    +1
     A                                      'trailer if applicable.'
     A                                      SPACEA(001)
     A                                     6
     A                                      'L-Truck is loaded and doors'
     A                                    +1
     A                                      'are locked'
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%***********************************************************************
     A          R FOOT1EFC
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%FS 003
     A*%%***********************************************************************
     A                                      SKIPB(004)
     A                                     2
     A                                      'NOTICE TO ALL TRANSPORTATION PERSO-
     A                                      NNEL'
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A                                     2
     A                                      'Driver and helpers are totally res-
     A                                      ponsible for all equipments assigne-
     A                                      d to this'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     2
     A                                      'delivery.  The cost of any missing-
     A                                       or damaged equipment will be charg-
     A                                      ed to both driver and helper.'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     2
     A                                      'driver and helper.'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '*-----------------------------*'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '*-----------------------------*'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|ASSIGNED LOAD EQUIPMENT      |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|SIGNATURE ___________________|'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|DESCRIPTION|   OUT  |   IN   |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Hand Truck |________|________|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|LOADED BY      CHECKED BY    |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Pallet Jack|________|________|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|_____________  _____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Load Bars  |________|________|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|TIME:                        |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|LOAD            UNLOAD       |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Pallet     |________|________|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Others     |________|________|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------+--------+--------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|DRIVER          UNLOADED BY  |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|ASSIGNED TRANSPORT EQUIPMENT |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Tractor/St Truck ___________ |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|HELPER          CHECKED BY   |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Trailer ____________________ |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|______________  ____________ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|-----------------------------|'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                             |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '|Route No  __________________ |'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '|                Date: ______ |'
     A                                      HIGHLIGHT
     A                                      SPACEA(001)
     A                                     4
     A                                      '*-----------------------------*'
     A                                      HIGHLIGHT
     A                                    46
     A                                      '*-----------------------------*'
     A                                      HIGHLIGHT
     A                                      SPACEA(002)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 001
     A*%%CL 002
     A*%%***********************************************************************
     A*
     A* End of report message
     A*
     A          R FOOT1
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(001)
     A                                     1
     A                                      'PS314: End of Report '
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R TOTWEIGHT
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A                                    25
     A                                      'WGT:'
     A            TOTWGT1        9S 2O    29
     A                                      EDTCDE(4)
     A                                    63
     A                                      'WGT:'
     A            TOTWGT2        9S 2O    67
     A                                      EDTCDE(4)
     A                                   101
     A                                      'WGT:'
     A            TOTWGT3        9S 2O   105
     A                                      EDTCDE(4)
     A                                   139
     A                                      'WGT:'
     A            TOTWGT4        9S 2O   143
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%***********************************************************************
     A*
     A          R TOTWGTDRY
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEA(002)
     A                                    26
     A                                      'WGT:'
     A            TOTWGT1        9S 2O    30
     A                                      EDTCDE(4)
     A                                    70
     A                                      'WGT:'
     A            TOTWGT2        9S 2O    74
     A                                      EDTCDE(4)
     A                                   114
     A                                      'WGT:'
     A            TOTWGT3        9S 2O   118
     A                                      EDTCDE(4)
     A                                   158
     A                                      'WGT:'
     A            TOTWGT4        9S 2O   162
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 002
     A*%%***********************************************************************
650aAA*
     A          R TOTWEIGHT8
     A*%%***********************************************************************
     A*%%RI 00000
     A*%%***********************************************************************
     A                                      SPACEB(001)
     A                                      SPACEA(001)
     A                                    22
     A                                      'WGT:'
     A                                    61
     A                                      'WGT:'
     A            TOTWGT1        9S 2O    26
     A                                      EDTCDE(4)
     A            TOTWGT2        9S 2O    65
     A                                      EDTCDE(4)
     A*%%***********************************************************************
     A*%%SS
     A*%%CL 001
     A*%%CP+999CRTPRTF
     A*%%CP+    FILE(PIRWORKKE/PS314PR)
     A*%%CP+    DEVTYPE(*SCS)
     A*%%CP     PAGESIZE(*N       198      *N     )
     A*%%***********************************************************************
650cAA*
