     A*%%TS  SD  20010727  141426  DAVE        REL-V4R4M0  5769-PW1
     A********************************************************************
     A*   Copyright (C) 2001 BFC Software, Inc. - All Rights Reserved    *
     A*   BFC Software, Inc.                                             *
     A*   799 Roosevelt Rd.  Bldg 6, Suite 108                           *
     A*   Glen Ellyn, IL  60137                                          *
     A*   (312) 790-8383                                                 *
     A********************************************************************
     A*
     A*  RC200VFM     RF Put-Away - Verify scanned slot
     A*  26 July 2001
     A*  David Sommerville
     A*
     A********************************************************************
     A*
     A*  Revisions
     A*
415 AA*    07/27/01  DAS  4.15
     A*      - Created.
     A*
     A********************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R VERIFY
     A*%%TS  SD  20010727  141426  DAVE        REL-V4R4M0  5769-PW1
     A                                      WINDOW(1 2 2 20 *NOMSGLIN)
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A            W1SLOT        12A  O  1  4
     A                                  2  4'Slot Ok?'
     A            W1OPT          1A  B  2 13VALUES('Y' 'N')
     A                                      DSPATR(HI)
     A                                      CHECK(ER)
     A                                  2 18'Y/N'
