     A*%%TS  SD  20140409  174351  RODR        REL-V6R1M0  5761-WDS
     A*----------------------------------------------------------------
     A*   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     A*----------------------------------------------------------------
     A*
     A*  SG112FM    Staging Import/Export Maintenance - Header info
     A*  March 20, 2014
     A*  Rod Roller
     A*
     A*  Revisions
     A*
     A*----------------------------------------------------------------
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CA03
     A                                      CA05
     A                                      CA12
     A          R SCREEN1
     A*%%TS  SD  20140409  174351  RODR        REL-V6R1M0  5761-WDS
     A                                      OVERLAY
     A                                      CLRL(23)
     A                                      CF04
     A  98                                  ALARM
     A                                  1  2'SG112.01'
     A                                  1 24'Staging Import/Export Maintenance'
     A                                      DSPATR(HI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 34'Header Information'
     A                                      DSPATR(HI)
     A                                  5  2'Warehouse . . .'
     A            SBWHSE    R        B  5 18REFFLD(SBREC/SBWHSE *LIBL/STGBATCH)
     A N21N90N91                            DSPATR(HI)
     A N21N90N91                            DSPATR(UL)
     A  01                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  21                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                  5 34'Batch ID  . . . . .'
     A            SBBATID   R        B  5 54REFFLD(SBREC/SBBATID *LIBL/STGBATCH)
     A N22N90N91                            DSPATR(HI)
     A N22N90N91                            DSPATR(UL)
     A  02                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  22                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                  6  2'Batch Type  . .'
     A            SBTYPE    R        B  6 18REFFLD(SBREC/SBTYPE *LIBL/STGBATCH)
     A N23N90N91                            DSPATR(HI)
     A N23N90N91                            DSPATR(UL)
     A  03                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  23                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                  6 34'Added Timestamp . .'
     A            SBADDTS   R        B  6 54REFFLD(SBREC/SBADDTS *LIBL/STGBATCH)
     A N28N90N91                            DSPATR(HI)
     A N28N90N91                            DSPATR(UL)
     A  08                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  28                                  DSPATR(RI)
     A                                  7  2'Route . . . . .'
     A            SBRTE     R        B  7 18REFFLD(SBREC/SBRTE *LIBL/STGBATCH)
     A N31N90N91                            DSPATR(HI)
     A N31N90N91                            DSPATR(UL)
     A  11                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  31                                  DSPATR(RI)
     A                                  7 34'Start Timestamp . .'
     A            SBSTRTS   R        B  7 54REFFLD(SBREC/SBSTRTS *LIBL/STGBATCH)
     A N26N90N91                            DSPATR(HI)
     A N26N90N91                            DSPATR(UL)
     A  06                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  26                                  DSPATR(RI)
     A                                  8  2'Route ID  . . .'
     A            SBRTEID   R        B  8 18REFFLD(SBREC/SBRTEID *LIBL/STGBATCH)
     A N32N90N91                            DSPATR(HI)
     A N32N90N91                            DSPATR(UL)
     A  12                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  32                                  DSPATR(RI)
     A                                  8 34'Ended Timestamp . .'
     A            SBENDTS   R        B  8 54REFFLD(SBREC/SBENDTS *LIBL/STGBATCH)
     A N27N90N91                            DSPATR(HI)
     A N27N90N91                            DSPATR(UL)
     A  07                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  27                                  DSPATR(RI)
     A                                  9  2'Export ID . . .'
     A            SBEXPID   R        B  9 18REFFLD(SBREC/SBEXPID *LIBL/STGBATCH)
     A N30N90N91                            DSPATR(HI)
     A N30N90N91                            DSPATR(UL)
     A  10                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  30                                  DSPATR(RI)
     A                                  9 34'Status Timestamp  .'
     A            SBSTSTS   R        B  9 54REFFLD(SBREC/SBSTSTS *LIBL/STGBATCH)
     A N25N90N91                            DSPATR(HI)
     A N25N90N91                            DSPATR(UL)
     A  05                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  25                                  DSPATR(RI)
     A                                 11  2'Status  . . . .'
     A            SBSTATUS  R        B 11 18REFFLD(SBREC/SBSTATUS *LIBL/STGBATC-
     A                                      H)
     A N24N90N91                            DSPATR(HI)
     A N24N90N91                            DSPATR(UL)
     A  04                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  24                                  DSPATR(RI)
     A                                      CHECK(RB)
     A            SBTEXT    R        B 11 24REFFLD(SBREC/SBTEXT *LIBL/STGBATCH)
     A N29N90N91                            DSPATR(HI)
     A N29N90N91                            DSPATR(UL)
     A  09                                  DSPATR(PC)
     A  91
     AO 90                                  DSPATR(PR)
     A  29                                  DSPATR(RI)
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 11'F4=Prompt'
     A                                      COLOR(BLU)
     A                                 23 22'F5=Refresh'
     A                                      COLOR(BLU)
     A                                 23 34'F12=Cancel'
     A                                      COLOR(BLU)
     A*****************************************************************
     A*
     A* ERROR MESSAGE SUBFILE RECORDS
     A*
     A*    ERROR MESSAGE SUBFILE RECORD
     A*
     A          R MSGREC                    SFL
     A                                      SFLMSGRCD(24)
     A            #MSGK                     SFLMSGKEY
     A            #PGMQ                     SFLPGMQ
     A*
     A*    ERROR MESSAGE SUBFILE CONTROL RECORD
     A*
     A          R MSGCTL                    SFLCTL(MSGREC)
     A  98                                  ALARM
     A                                      LOCK
     A                                      OVERLAY
     A                                      SFLSIZ(2) SFLPAG(1)
     A N97                                  SFLCLR
     A  97                                  SFLDSP
     A  97                                  SFLEND
     A          R MSGCLR
     A                                      OVERLAY
     A                                      LOCK
     A                                      SLNO(24)
     A                                      CLRL(1)
     A          R CLRSCR
     A                                      CLRL(*ALL)
