     A*----------------------------------------------------------------
     A*   Copyright (C) 2011 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   24 N. Washington Ave #203
     A*   Batavia, IL 60510
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... APTDATA1 (LF)
     A*  Description ... APT Outbound Data by Exp file
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
640 AA*    09/30/11  RTR  6.40
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A          R APTREC                    PFILE(APTDATA)
     A*
     A          K APEXPFILE
     A          K APTRN#
     A*
