     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... BATRPTUSRL   (LF)
     A*  Description ... Batch Report User File - By Type/ID
     A*  Creator ....... RTR
     A*
     A*  Revisions
     A*
640 AA*    12/14/12  RTR  6.40
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*  Revisions:
     A*
     A*----------------------------------------------------------------
     A*
     A*  Notes:
     A*
     A*----------------------------------------------------------------
     A
     A          R BRUREC                    PFILE(BATRPTUSR)
     A*
     A          K BRUTYP
     A          K BRURID
     A*
