     A*----------------------------------------------------------------
     A*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   799 Roosevelt Rd.  Bldg 6, Suite 108
     A*   Glen Ellyn, IL  60137
     A*   (630) 790-8383
     A*----------------------------------------------------------------
     A*
     A*  File name ..... CWEXCP3  (LF)
     A*  Description ... Catch Wt.Exception file by whse/gdte/gtim
     A*  Date .......... October 30, 2014
     A*  Creator ....... JGD-CBI
     A*
     A*----------------------------------------------------------------
     A          R CXREC                     PFILE(CWEXCP)
     A*
     A          K CXWHSE
     A          K CXGDTE
     A          K CXGTIM
     A          O CXESTA                    COMP(EQ '4')
