     A*----------------------------------------------------------------
     A*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   799 Roosevelt Rd.  Bldg 6, Suite 108
     A*   Glen Ellyn, IL  60137
     A*   (630) 790-8383
     A*----------------------------------------------------------------
     A*
     A*  File name ..... CWEXCP1  (LF)
     A*  Description ... Catch Wt.Exception file by whse/item/gdte/gtim
     A*  Date .......... Spptember 13, 2004
     A*  Creator ....... RH
     A*
     A*----------------------------------------------------------------
     A          R CXREC                     PFILE(CWEXCP)
     A*
     A          K CXWHSE
     A          K CXITEM
     A          K CXGDTE
     A          K CXGTIM
     A          O CXESTA                    COMP(EQ '4')
