     A*----------------------------------------------------------------
     A*   Copyright (C) 2011 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   24 N. Washington Ave #203
     A*   Batavia, IL 60510
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... ELSSTDDTL1 (LF)
     A*  Description ... ELS STANDARDS FILE
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
750 AA*    03/23/22  KDE  7.50
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A          R EDREC                     PFILE(ELSSTDDTL)
     A*
     A          K EDWHSE
     A          K EDTRAN
     A          K EDLABL
     A*
