     A*----------------------------------------------------------------
     A*   Copyright (C) 2013 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... EXPSORDC2 (LF)
     A*  Description ... Staging Import - C/Wgt's Whse/Batid/Cord/Osq
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
650 AA*   07/18/13  MLB  7.10
     A*     - Created
     A*
     A*----------------------------------------------------------------
     A          R OECREC                    PFILE(EXPSORDAC)
     A*
     A          K OECWHS
     A          K OECORD
     A          K OECITM
