     A*----------------------------------------------------------------
     A*   Copyright (C) 2009 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... FLATFILE (PF)
     A*  Description ... USED IN JOURNAL SCRAPER (JRNSCRAPER)
     A*  Creator ....... KDE
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
780 AA*    02/21/24  KDE  7.80
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A*  NOTES:
     A*    - Uses for blob field from journals
     A*----------------------------------------------------------------
     A          R RFLAT
     A*
     A            FLATFIELD  32766          TEXT('Flat Field')
     A                                      COLHDG('Flat' 'Field')
