     A*----------------------------------------------------------------
     A*   Copyright (C) 2011 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... FLGCSTORD1 (LF)
     A*  Description ... Imported Customer Orders Flag file by whse/batid
     A*  Date .......... March 15, 2011
     A*  Creator ....... MLB
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
640 AA*   03/15/11  MLB  6.40
     A*     - Created
     A*
     A*----------------------------------------------------------------
     A          R EFREC                     PFILE(FLGCSTORD)
     A*
     A          K EFWHSE
     A          K EFBATID
