     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPV1 (PF)
     A*  Description ... HACCPV Validation By Sequence#/value seq#
     A*
     A*  Revisions
     A*
640 AA*    04/10/12  LMC  6.40
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A                                      UNIQUE
     A          R HVREC                     PFILE(HACCPV)
     A*
     A          K HVWHSE
     A          K HVSEQ#
     A          K HVVSQ#
     A*         S HVACTIVE                  COMP(EQ '1')
