     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPLOG1 (LF)
     A*  Description ... HACCPQ LOG FILE -
     A*
     A*  Revisions
     A*
640 AA*    03/26/12  LMC  6.40
     A*      - Created
720aAA*    03/28/18  LMC  7.20a
     A*      - Added new key field.
     A*        Stop Number
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R HLREC                     PFILE(HACCPLOG)
     A*
     A*
     A          K HLWHSE
     A          K HLRTE
     A          K HLSTOP
     A          K HLSEQ#
     A          S HLOBSOLETE                COMP(NE 'Y')
