     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPQ1 (PF)
     A*  Description ... HACCPQ Question File By Sequence#
     A*
     A*  Revisions
     A*
640 AA*    02/29/12  LMC  6.40
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A                                      UNIQUE
     A          R HIREC                     PFILE(HACCPQ)
     A*
     A          K HIWHSE
     A          K HISEQ#
