     A*----------------------------------------------------------------
     A          R HLREC                     PFILE(HACCPLOG)
     A*
     A          K HLWHSE
     A          K HLPO
