     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2021 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPE1   (LF)
     A*  Description ... HACCPE EXCEPTION FILE
     A*
     A*  Revisions
     A*
750aAA*    03/31/21  LMC  7.50
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R HEREC                     PFILE(HACCPE)
     A*
     A*
     A          K HEWHSE
     A          K HELEVL
     A          K HETYPE
     A          K HECODE
     A          K HESEQ#
     A          K HEETYPE
