     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPQT1(LF)
     A*  Description ... USER CONTROLLED File By Sequence#
     A*
     A*  Revisions
     A*
640 AA*    02/29/12  LMC  6.40
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A                                      UNIQUE
     A          R HBREC                     PFILE(HACCPQT)
     A*
     A          K HBWHSE
     A          K HBLEVL
     A          K HBTYPE
     A          S HBUCTL                    COMP(EQ 'Y')
