     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... HACCPLOG3 (LF)
     A*  Description ... HACCPQ LOG FILE - FOR XREF LINK
     A*
     A*  Revisions
     A*
650aAA*    03/22/13  LMC  6.50a
     A*      - Created
     A*----------------------------------------------------------------
     A*
     A*----------------------------------------------------------------
     A          R HLREC                     PFILE(HACCPLOG)
     A*
     A*
     A          K HLWHSE
     A          K HLPO
     A          K HLPOSEQ
     A          K HLSEQ#
     A          K HLADDUC
     A          S HLOBSOLETE                COMP(NE 'Y')
