     A*----------------------------------------------------------------
     A*   Copyright (C) 2015 BFC Associates - All Rights Reserved
     A*   BFC Associates
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... IFSDIR
     A*  Description ... IFS DIRECTORY WORK FILE
     A*  Creator ....... KDE
     A*
     A*  --------------------------------------------------------------
     A*   SPECIAL NOTES:
     A*
     A*  Revisions
     A*
710 AA*    Ver 7.10  10/24/17  KDE
     A*      - Created
     A*
     A*----------------------------------------------------------------
     A          R IFSSRC
     A            IFSFLD       256          COLHDG('QSH RECORD')
