     A*----------------------------------------------------------------
     A*   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     A*----------------------------------------------------------------
     A*
     A*  File name ..... IMPFFLAT1 (PF)
     A*  Description ... FTP Import Flat File 500
     A*  Creator ....... RTR
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
650 AA*    11/12/14  RTR  6.50
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A          R FLREC
     A*
     A            FLDATA       500A         TEXT('DATA')
     A                                      ALWNULL
     A*
