     A*----------------------------------------------------------------
     A*  File Name ..... IMPSORDH3 (LF)
     A*  Description ... Staging Import - Order Header
     A*
     A*  Date .......... November 24, 2015
     A*  Created by .... JGD
     A*
     A*----------------------------------------------------------------
     A          R OIHREC                    PFILE(IMPSORDH)
     A*
     A          K OIHWHS
     A          K OIHRTE
     A          K OIHRTEID
