     A*----------------------------------------------------------------
     A*   Copyright (C) 2020 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... IMPSIVCH3 (LF)
     A*  Description ... Staging Import - Invoices by Whs/Rte/RteID
     A*
     A*----------------------------------------------------------------
     A          R IVHREC                    PFILE(IMPSIVCH)
     A*
     A          K IVHWHS
     A          K IVHRTE
     A          K IVHRTEID
