     A*----------------------------------------------------------------
     A*   Copyright (C) 2020 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... IMPSIVCC1 (LF)
     A*  Description ... Staging Import - C/Wgt's Whse/Batid/Cord/Osq
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
740 AA*   11/09/20  MLB  7.40
     A*     - Created
     A*
     A*----------------------------------------------------------------
     A          R IVCREC                    PFILE(IMPSIVCC)
     A*
     A          K IVCWHS
     A          K IVCORDA
     A          K IVCINVOICE
     A          K IVCITM
