     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*
     A*  File name ..... IMPSRCVP1 (LF)
     A*  Description ... Staging Import - PO Pallets by status
     A*
     A*  Revisions
     A*
CBIAAA*   03/13/18  TDF
     A*     - Created
     A*
     A*----------------------------------------------------------------
     A          R RCPREC                    PFILE(IMPSRCVP)
     A*
     A          K RCPWHSE
     A          K RCPSTATUS
     A          K RCPLCNS
