     A*----------------------------------------------------------------
     A*   Copyright (C) 2019 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
640  A*  File name ..... LABELHW (LF)
     A*  Description ... Label history file w/Whse
     A*  Date .......... October 4, 2019
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A*  Notes
     A*
     A*    All programs using LABELH should be changed to use this file.
     A*
     A*----------------------------------------------------------------
     A          R LBREC                     PFILE(LABELH)
     A*
     A          K LBWHSE
     A          K LBLBL#

