     A*----------------------------------------------------------------
     A*   Copyright (C) 2010 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... LABELNK2(LF)
     A*  Description ... Label link file by transaction
     A*  Date .......... June 16 2010
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A          R LLREC                     PFILE(LABELNK)
     A*
     A          K LLTRN#
