     A*----------------------------------------------------------------
     A*   Copyright (C) 2019 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... LABELW (LF)
     A*  Description ... Label file w/whse.
     A*  Date .......... October 4, 2019
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A*  Notes
     A*
     A*    All programs using LABEL should be changed to use this file.
     A*
     A*----------------------------------------------------------------
     A                                      UNIQUE
     A          R LBREC                     PFILE(LABEL)
     A*
     A          K LBWHSE
     A          K LBLBL#

