     A*----------------------------------------------------------------
     A*
     A*  File name ..... LDRPLTQ3 (LF)
     A*  Description ... Merged items pallet exception file.
     A*
     A*  Creator ....... Jose Duque
     A*
     A*  Revisions:
     A*
     A*----------------------------------------------------------------

     A          R LPREC                     PFILE(LDRPLTQ)


     A          K LPWHSE
     A          K LPLBL#
     A          K LPSEQ

