     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*
     A*  File name ..... LICACTIVET (LF)
     A*  Date .......... 04/23/2018
     A*  Creator ....... TDF  FOR WORK LIST #2016133
     A*
     A*----------------------------------------------------------------
     A          R LAREC                     PFILE(*LIBL/LICACTIVE)
     A*
     A          K LAWHSE
     A          K LAPRTY
     A          K LAEXPD
     A          K LAENTD
     A          K LALCNS
