     A*----------------------------------------------------------------
     A*   Copyright (C) 2009 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... LICLOG7 (LF)
     A*  Description ... License log by whse/SlotItem//addts
     A*  Date .......... February 14, 2013
     A*  Creator ....... LMC
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
650 AA*    02/14/13  LMC  6.50
     A*      - Created
     A*
     A*
     A*----------------------------------------------------------------
     A          R LLREC                     PFILE(LICLOG)
     A*
     A          K LLWHSE
     A          K LLSITEM
     A          K LLADDTS
