     A*----------------------------------------------------------------
     A*   Copyright (C) 2009 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... ORDBSUM1 (LF)
     A*  Description ... Order Batch Pick Summary file by Route
     A*  Creator ....... JCJ
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
     A*    08/12/09  JCJ  5.20
     A*      - Created
     A*
     A*----------------------------------------------------------------
     A          R BPREC                     PFILE(ORDBSUM)
     A*
     A          K BPWHSE
     A          K BPRTE
