     A*----------------------------------------------------------------
     A*
     A*  File name ..... PIRDBR1 (LF)
     A*  Description ... Database relations files by file name
     A*  Date .......... June 19, 1996
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A          R QWHDRDBR                  PFILE(PIRDBR)
     A*
     A          K WHRFI
