     A*----------------------------------------------------------------
     A*   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... PIRTRANHW (LF)
     A*  Description ... Transaction history file w/Whse
     A*  Date .......... October 4, 2019
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A*  Notes
     A*
     A*    All programs using PIRTRANH should be changed to use this file.
     A*
     A*----------------------------------------------------------------
     A          R PTREC                     PFILE(PIRTRANH)
     A*
     A          K PTWHSE
     A          K PTTRN#

