     A*----------------------------------------------------------------
     A*   Copyright (C) 2010 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... PIRTRAND8 (LF)
     A*  Description ... Transaction detail file by shift, crew, emp no
     A*  Date .......... April 14, 2016
     A*  Creator ....... MR
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
700 AA*    04/14/16  MR 7.00
     A*      - Created
     A*----------------------------------------------------------------
     A          R PTDREC                    PFILE(PIRTRAND)
     A*
     A          K PTDSHFT
     A          K PTDCREW
     A          K PTDEMPNUM
