     A*----------------------------------------------------------------
     A*   Copyright (C) 2013 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... POCWEXCP1 (LF)
     A*  Description ... Receiving Catch Weight Overrides by
     A*                  Whse/Trn#/Item
     A*  Date .......... August 05, 2013
     A*  Creator ....... LMC
     A*
     A*----------------------------------------------------------------
     A          R EXREC                     PFILE(POCWEXCP)
     A*
     A          K EXWHSE
     A          K EXTRN#
     A          K EXITEM
