     A*----------------------------------------------------------------
     A*   Copyright (C) 2008 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... PODLOG1 (LF)
     A*  Description ... POD log file by rte/customer order/try
     A*  Date .......... Nov 13, 2008
     A*  Creator ....... RBD
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
520 AF*    11/13/08  RBD  5.20
     F*        Created.
     A*
     A*----------------------------------------------------------------
     A          R PODREC                    PFILE(PODLOG)
     A*
     A          K PODRTE
     A          K PODCORD
     A          K PODTRY
