     A*----------------------------------------------------------------
     A*   Copyright (C) 2008 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... PODLOGP1 (LF)
     A*  Description ... POD pallet(tote) log file by rte/pallet
     A*  Date .......... Nov 13, 2008
     A*  Creator ....... RBD
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
520 AF*    11/13/08  RBD  5.20
     F*        Created.
     A*
     A*----------------------------------------------------------------
     A          R PODPREC                   PFILE(PODLOGP)
     A*
     A          K PDPRTE
     A          K PDPPLID
