     A*----------------------------------------------------------------
     A*
     A*  File name ..... POMFR2 (LF)
     A*  Description ... POMFR file by P.O. and Label number.
     A*  Creator ....... JGD
     A*
     A*----------------------------------------------------------------
     A          R PMREC                     PFILE(POMFR)
     A*
     A          K PMPO
     A          K PMLBL#
