     A*----------------------------------------------------------------
     A*   Copyright (C) 2008 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... POVPCK1 (LF)
     A*  Description ... PO Virtual Whse Pick File by Dept/slot
     A*  Date .......... March 31, 2010
     A*  Creator ....... RH
     A*
     A*----------------------------------------------------------------
     A*  Revisions
     A*
530 AF*    03/31/10  RBD  5.30
     F*        Created.
     A*
     A*----------------------------------------------------------------
     A          R POVREC                    PFILE(POVPCK)
     A*
     A          K POVWHS
     A          K POVWHD
     A          K POVDSP
