     A*----------------------------------------------------------------
     A*  File name ..... RU376B2  (LF)
     A*  Description ... View/Print Route Loading Analisys Report.
     A*
     A*  Date .......... April 14, 2008
     A*  Creator ....... JGD
     A*
     A*----------------------------------------------------------------
     A          R RUREC2                    PFILE(RU376B)
     A*
     A          K RUSTRD
     A          K RUSTRT
