     A*----------------------------------------------------------------
     A*   Copyright (C) 2006 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   245 W. Roosevelt Rd.  Bldg 8, Suite 51
     A*   West Chicago, IL  60185
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... SAPMOVE1 (LF)
     A*  Description ... Item Movement File by BFC adjustment code.
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
510  A*    06/15/06  RMC  5.10
     A*      - Created.
     A*----------------------------------------------------------------
     A          R SPMREC                    PFILE(SAPMOVE)
     A*
     A          K SMBFCC
