     A*  BFC/P SYSTEM CROSS REFERENCE
     A                                      UNIQUE
     A          R XREFR
     A            BFCSLT        12A         TEXT('BFC SLOT DISPLAY')
     A            PSLOT         12A         TEXT('P SYSTEM SLOT')
     A          K BFCSLT
