     A*----------------------------------------------------------------
     A*   Copyright (C) 2011 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   24 N. Washington Ave Suite 203
     A*   Batavia, IL 60510
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... SLOTXRF2 (LF)
     A*  Description ... Slot xref file by Host sltn
     A*  Date .......... August 15,2011
     A*  Creator ....... MLB
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
640 AA*    08/15/11  MLB  6.40
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A*  Notes:
     A*
     A*----------------------------------------------------------------
     A          R XFREC                     PFILE(SLOTXRF)
     A*
     A*  Key fields
     A          K XFSLTN
