     A*----------------------------------------------------------------
     A*   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   P.O. Box 1957
     A*   Batavia, IL 60510
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... SLOT8QDYHT (LF)
     A*  Description ... Slot file by whse/dept/sectyp/aisle/LOC/RLVL/HAND
     A*  Creator ....... MLB
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
YHT AA*  02/07/14  MLB  YHT
     A*    Created.
     A*
     A*----------------------------------------------------------------
     A*  Notes:  This LF created for use with pgm, UTYHT003.
     A*          UTYHT003 re-sequences the PIR slots in aisle 63.
     A*
     A*----------------------------------------------------------------
     A          R SLREC                     PFILE(SLOT)
     A*
     A          K SLWHSE
     A          K SLWHDP
     A          K SLSTYP
     A          K SLAISL
     A          K SLRLVL
     A          K SLLOC
     A          K SLHAND
