     A*  BFC/P SYSTEM CROSS REFERENCE(SLOTREFL-LOGICAL)
     A*
     A          R XREFR                     PFILE(*LIBL/SLOTXREF)
     A          K BFCSLT
