     A*----------------------------------------------------------------
     A*   Copyright (C) 2007 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*   245 W. Roosevelt Rd.  Bldg 8, Suite 52 8
     A*   West Chicago, IL  60185
     A*   (630) 562-0375
     A*----------------------------------------------------------------
     A*
     A*  File name ..... SLOTXRF1 (LF)
     A*  Description ... Slot xref file by BFC whse/dept/slot
     A*  Date .......... August 2, 2007
     A*  Creator ....... RBD
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
510 AA*    08/02/07  RBD  5.10
     A*      - Created.
     A*
     A*----------------------------------------------------------------
     A*  Notes:
     A*
     A*----------------------------------------------------------------
     A          R XFREC                     PFILE(SLOTXRF)
     A*
     A*  Key fields
     A          K XFWHSE
     A          K XFWHDP
     A          K XFDISP
