     A*----------------------------------------------------------------
     A*
     A*  File name ..... TESTFILE (PF)
     A*  Description ... Test file for UPDATE test
     A*  Creator ....... DAS
     A*
     A*  Revisions
     A*
     A*----------------------------------------------------------------
     A          R TSTREC
     A*
     A            TSTBFR         1A         TEXT('Before')
     A            TSTAFT         1A         TEXT('After')
