     A*----------------------------------------------------------------
     A*
     A*  File name ..... TESTFILE2 (LF)
     A*  Description ... Test file by After field
     A*  Date .......... June 19, 1996
     A*  Creator ....... DAS
     A*
     A*----------------------------------------------------------------
     A          R TSTREC                    PFILE(TESTFILE)
     A*
     A          K TSTAFT
