     A*----------------------------------------------------------------***
     A*   Copyright (C) 2006 BFC Software, Inc. - All Rights Reserved    *
     A*   BFC Software, Inc.                                             *
     A*----------------------------------------------------------------***
     A*
     A*  File name ..... TRAILER1   (LF)
     A*  Description ... Trailer file by code.                         sts
     A*  Date .......... April 18, 2016
     A*  Creator ....... MR
     A*
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
700 AA*    04/18/16  MR 7.00
     A*      - Created
     A*----------------------------------------------------------------***
     A          R TLHREC                    PFILE(TRAILER)
     A*
     A          K TLCODE
