     A*----------------------------------------------------------------
     A*   Copyright (C) 2011 BFC Software, Inc. - All Rights Reserved
     A*   BFC Software, Inc.
     A*----------------------------------------------------------------
     A*
     A*  File name ..... UCIINFO5(LF)   **was UCIINFO3**
     A*  Description ... UCI INFO by whse/trn#
     A*  Date .......... FEB 23, 2023
     A*  Creator ....... NLK
     A*
     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*  NOTES:::LF 3 was by ORD# then TRN# then back to ORD#
     A*  At this time we will leave 3 as ORD# and new 5 as TRN#
     A*  Mainly used in RH155AS when needing Extended Cust Order #
     A*----------------------------------------------------------------
     A*----------------------------------------------------------------
     A*  Revisions:
     A*
730 AA*    03/21/19  NLK  7.30  (was in lf 3 now here in lf 5)
     A*      - Created due to Cheney wanting to see
     A*          what Selector skipped item and its trn#
     A*      (orginally keyed with ord# but needs trn#)
     A*      (was uiselord/now uiseltrn#)
     A*
     A*----------------------------------------------------------------
     A          R UIREC                     PFILE(UCIINFO)
     A*
     A          K UIWHSE
730 MA          K UISELTRN#
