/*-------------------------------------------------------------------*/
/*                                                                   */
/*  AGSWTRPREP  Agar Daily Writer Preperation                        */
/*  10 October 2012                                                  */
/*  Max Blacknik                                                     */
/*                                                                   */
/*-------------------------------------------------------------------*/
/*  Revisions                                                        */
/*                                                                   */
/*    10/10/12  MLB  6.40                                            */
/*      - Created.                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*  Notes                                                            */
/*                                                                   */
/*-------------------------------------------------------------------*/

 AGSWTRPREP: PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PBID)       TYPE(*CHAR) LEN(2)
             DCL        VAR(&WTR)        TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

/* Create Work File       */

             CHGVAR     VAR(&WTR) VALUE('*ALL')

             WRKRMTWTR  OUTQ(&WTR) OUTPUT(*FILE) FILE(QTEMP/AGSWTR)

             CALL       PGM(AGSPRCWTR)

/*  Clean up before leaving */

             DLTF       FILE(QTEMP/AGSWTR)

             RCLRSC     LVL(*CALLER)

 END:        ENDPGM
