/*-------------------------------------------------------------------*/
/*                                                                   */
/*  CWDWTRPREP  Agar Daily Writer Preparation                        */
/*  20 September 2013                                                */
/*  Max Blacknik                                                     */
/*                                                                   */
/*-------------------------------------------------------------------*/
/*  Revisions                                                        */
/*                                                                   */
/*    09/20/13  MLB  6.50                                            */
/*      - Created.                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*  Notes                                                            */
/*                                                                   */
/*-------------------------------------------------------------------*/

 CWDWTRPREP: PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PBID)       TYPE(*CHAR) LEN(2)
             DCL        VAR(&WTR)        TYPE(*CHAR) LEN(10)

             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(END))

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

/* Create Work File       */

             CHGVAR     VAR(&WTR) VALUE('*ALL')

             WRKRMTWTR  OUTQ(&WTR) OUTPUT(*FILE) FILE(QTEMP/CWDWTR)

             CALL       PGM(CWDPRCWTR)

/*  Clean up before leaving */

             DLTF       FILE(QTEMP/CWDWTR)

             RCLRSC     LVL(*CALLER)

 END:        ENDPGM
