/*-------------------------------------------------------------------*/
/*                                                                   */
/*  ENDJOBIMED  End Job Immediately                                  */
/*  16 June, 2017                                                    */
/*  Mike Rooker                                                      */
/*                                                                   */
/*-------------------------------------------------------------------*/
/*  Revisions                                                        */
/*                                                                   */
/*    03/28/12  MLB  6.40                                            */
/*-------------------------------------------------------------------*/
  ENDJOBIMED:    PGM PARM(&JOBNAM &USR &JOBNUM)
/*-------------------------------------------------------------------*/
/*  Variable Declarations                                            */
/*-------------------------------------------------------------------*/
             DCL VAR(&JOBNAM) TYPE(*CHAR) LEN(10)
             DCL VAR(&USR) TYPE(*CHAR) LEN(10)
             DCL VAR(&JOBNUM) TYPE(*CHAR) LEN(10)
/*-------------------------------------------------------------------*/
/*  Main Line                                                        */
/*-------------------------------------------------------------------*/
             ENDJOB     JOB(&JOBNUM/&USR/&JOBNAM) OPTION(*IMMED)

             ENDPGM
