/*-------------------------------------------------------------------*/
/*                                                                   */
/*  GETRECCNT   Get file record count                                */
/*  26 May 2010                                                      */
/*  Dave Sommerville                                                 */
/*                                                                   */
/*-------------------------------------------------------------------*/

 GETRECCNT:  PGM        PARM(&FILE &CURRCD &DLTRCD)

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&FILE)   TYPE(*CHAR) LEN(10)
             DCL        VAR(&CURRCD) TYPE(*DEC)  LEN(10 0)
             DCL        VAR(&DLTRCD) TYPE(*DEC)  LEN(10 0)

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

             RTVMBRD    FILE(&FILE) NBRCURRCD(&CURRCD) +
                          NBRDLTRCD(&DLTRCD)

             ENDPGM
