/*-------------------------------------------------------------------*/
/*                                                                   */
/*  IT240CL   RF Item Pick Slot                                      */
/*  29 November, 2000                                                */
/*  Roxanne Harrison                                                 */
/*-------------------------------------------------------------------*/

 IT240CL:    PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PGM)  TYPE(*CHAR) LEN(8)  VALUE(IT240)

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&MEMBER) TYPE(*CHAR) LEN(10)

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/


/*  On with the show ... */

             CALL       PGM(&PGM)

/*  Clean up before leaving */

/*           DLTOVR     FILE(WORKOPT)  */
             RCLRSC     LVL(*CALLER)
/*           CLRPFM     FILE(WORKOPT) MBR(&MEMBER)  */

             ENDPGM
