/*-------------------------------------------------------------------*/
/* **** COMPILE WITH ACTIVATION GROUP *NEW ****                      */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*                                                                   */
/*  LT001CL   Sync LICACTIVE with slots                              */
/*  23 February 2009                                                 */
/*  Dave Sommerville                                                 */
/*                                                                   */
/*-------------------------------------------------------------------*/

 LT001CL:    PGM        PARM(&ACTION &WHSE &WHDP &DISP)

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&ACTION) TYPE(*CHAR) LEN(3)
             DCL        VAR(&DISP)   TYPE(*CHAR) LEN(12)
             DCL        VAR(&DUMMY)  TYPE(*CHAR) LEN(1)
             DCL        VAR(&WHDP)   TYPE(*CHAR) LEN(5)
             DCL        VAR(&WHSE)   TYPE(*DEC)  LEN(3 0)

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

             CALL       PGM(LT001) PARM(&ACTION &WHSE &WHDP &DISP +
                          &DUMMY)

/*  Clean up before leaving */

             RCLRSC     LVL(*CALLER)

             ENDPGM
