/*-------------------------------------------------------------------*/
/*                                                                   */
/*  LTB01CL   Left the Building Maintenance                          */
/*  14 January 2021                                                  */
/*  Kenneth Elder                                                    */
/*                                                                   */
/*  Revisions                                                        */
/*                                                                   */
/*-------------------------------------------------------------------*/

 LTB01CL:    PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PGM)  TYPE(*CHAR) LEN(8)  VALUE(LTB01)

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&RETURN) TYPE(*CHAR) LEN(8)

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

/*  On with the show ... */

REPEAT:
             CALL       PGM(&PGM)  PARM(' ')

DONE:

/*  Clean up before leaving */

             RCLRSC     LVL(*CALLER)

             ENDPGM
