/*-------------------------------------------------------------------*/
/*                                                                   */
/*  PS195CL   Pallet Info                                            */
/*  28 November, 2018                                                */
/*  Ginger Andrews                                                   */
/*                                                                   */
/*-------------------------------------------------------------------*/

 PS195CL:    PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PGM)  TYPE(*CHAR) LEN(8)  VALUE(PS195)

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/


/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/


/*  On with the show ... */

             CALL       PGM(&PGM)

/*  Clean up before leaving */

             RCLRSC     LVL(*CALLER)

             ENDPGM
