/*-------------------------------------------------------------------*/
/*                                                                   */
/*  QDFKL002CL  Zero verify all 'Z' status empty slots.              */
/*                                                                   */
/*  Revisions                                                        */
/*                                                                   */
/*    10/27/08  RH   5.20                                            */
/*      - Created.                                                   */
/*-------------------------------------------------------------------*/

 QDFKL002CL: PGM        PARM(&WHSE)

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

/*-------------------------------------------------------------------*/
/*  Field declarations                                               */
/*-------------------------------------------------------------------*/

             DCL        VAR(&WHSE)       TYPE(*CHAR) LEN(3)

             MONMSG     MSGID(CPF0000)   EXEC(GOTO CMDLBL(GETOUT))
/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

/*  Call program to Zero verify slots.                */

             CALL       PGM(QDFKL002) PARM(&WHSE)

 GETOUT:

   /* Clean up before leaving */

             RCLRSC     LVL(*CALLER)

             ENDPGM
