/*-------------------------------------------------------------------*/
/*                                                                   */
/*  SG110CL   Staging Import/Export Maintenance                      */
/*  11 April 2014                                                    */
/*  Rod Roller                                                       */
/*                                                                   */
/*-------------------------------------------------------------------*/
/*  Revisions:                                                       */
/*                                                                   */
/*-------------------------------------------------------------------*/

 SG110CL:    PGM

/*-------------------------------------------------------------------*/
/*  Constant declarations                                            */
/*-------------------------------------------------------------------*/

             DCL        VAR(&PGM)  TYPE(*CHAR) LEN(8)  VALUE(SG110A)

/*-------------------------------------------------------------------*/
/*  Main line                                                        */
/*-------------------------------------------------------------------*/

/*  On with the show ... */

             CALL       PGM(&PGM)

DONE:
/*  Clean up before leaving */

             RCLRSC     LVL(*CALLER)

             ENDPGM
