/*-------------------------------------------------------------------*/
/*  TSTPHRASEC   CL for TSTPHRASE program                            */
/*  14 July 2008                                                     */
/*  Dave Sommerville                                                 */
/*-------------------------------------------------------------------*/

 TSTPHRASEC: PGM

             CALL       PGM(TSTPHRASE)

             RCLRSC     LVL(*CALLER)

             ENDPGM
