      /COPY *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *   Copyright (C) 2008 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  A9999999  Create records in A9999999 file
     *  04 April 2008
     *  Dave Sommerville
     *
     *  Revisions
     *
520 A*    04/04/08  DAS  5.20
     *      - Created
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     FA9999999  O    E           K DISK

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

     C     1             do        9999999       num
     C                   write(e)  a9999999r
     C                   enddo

     C                   eval      *inlr = *on
     C                   return
