     I* CVTBINDEC- Convert binary to decimal - CPP for CVTBINDEC
     IDS1         DS
     I                                    B   1   20VAR1B
     C           *ENTRY    PLIST
     C                     PARM           DS1     2        From var
     C                     PARM VAR1B     VAR2    50       To var
     C                     SETON                     LR
     C                     RETRN
