      /copy *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  GETEML      Get Report Email Address
     *  24 March 2014
     *  Rod Roller
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Revisions
     *
650 A*   03/24/14  RTR  6.50
     *     - Created.
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     Frpteml    if   e           k disk

     *----------------------------------------------------------------
     *  Standard Variables
     *----------------------------------------------------------------

      /COPY *libl/qcopysrc,c#stdvar

     *----------------------------------------------------------------
     *  Variables
     *----------------------------------------------------------------

     D $prpt           s             10a
     D $pseq           s              3  0
     D $peml           s            100

     *----------------------------------------------------------------
     *  Input parameters
     *
     *     $prpt    - Report ID
     *     $pseq    - Sequence
     *
     *  Output parameters
     *
     *     $peml    - Email Address
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------

     C     *entry        plist
     C                   parm                    $prpt
     C                   parm                    $pseq
     C                   parm                    $peml

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

     c                   exsr      zzgeteml

     C                   eval      *inlr = *on

     *----------------------------------------------------------------
     *  zzgeteml  - get report email
     *----------------------------------------------------------------

      /free
       begsr zzgeteml;

         // get the email record
         chain ($prpt: $pseq) rpteml;
         if %found(rpteml);
           $peml = emladdr;
         else;
           $peml = *blanks;
         endif;

       endsr;
      /end-free
