      /copy *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *   Copyright (C) 2012 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *
     *  GETITQTY   Get Item Quantity - Pgm for GETITQTY function
     *  04 October 2012
     *  Rod Roller
     *
     *----------------------------------------------------------------
     *  Revisions:
     *
640 A*    10/04/12  RTR  6.40
     *      - Created.
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *
     *  Notes
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     * File Specs
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Prototypes
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Variables
     *----------------------------------------------------------------

     d error           s               n
     d infoTipDesc     s             30
     d infoValue       s             30
     d infoTipOnly     s              1
     d infoPercolate   s              1
     d itemLen         s              3  0
     d lastChar        s              1

     *----------------------------------------------------------------
     *  Program info data structure
     *----------------------------------------------------------------

     D/copy qcopysrc,c#pgminfds

     *----------------------------------------------------------------
     *  Parameters
     *
     *    Input Parameters
     *      $pWhse       Warehouse
     *      $pRtid       Route id
     *      $pLbl#       Label number
     *      $pOrd        Order number
     *      $pSeq        Sequence number
     *      $pItem       Item
     *
     *    Returned Parameters
     *      $pInfo      -  client label info  (comma delimited string)
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------

     C     *entry        plist
     C                   parm                    $pWhse            3 0
     C                   parm                    $pItem           15
     C                   parm                    $pQty            10 0

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

      /free

         $pQty = 1;


         *inlr = *on;
         return;
      /end-free

