      /copy *libl/qcopysrc,hspecs
     H DFTACTGRP(*NO) ACTGRP(*CALLER)
     *----------------------------------------------------------------
     *   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *
     *  GETRMUOM    Get Raw Material Unit of Measures
     *  05 Aug 2014
     *  Kenneth Elder
     *
     *  Revisions:
     *
650 A*    08/05/14  KDE  6.50
     *      - Created.
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     Fpiritem   if   e           k disk

     *----------------------------------------------------------------
     *  Standard SQL variables and constants
     *----------------------------------------------------------------

      /copy qcopysrc,c#stdsql

     *----------------------------------------------------------------
     *  Program info data structure
     *----------------------------------------------------------------

      /copy qcopysrc,c#pgminfds

     *----------------------------------------------------------------
     *  Constants
     *----------------------------------------------------------------

     d true            c                   *on
     d false           c                   *off

      *----------------------------------------------------------
      *  Input Parms
      *----------------------------------------------------------

     D  pWhse          s              3p 0
     D  pItem          s             15    varying
     D  pUom           s              6    varying

     *----------------------------------------------------------------
     *  Sub-procedure prototypes
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Parameters
     *
     *    Input Parameters
     *      pWhse       Warehouse
     *      pTran       Item number
     *
     *    Returned Parameters
     *      pUom        Raw Material Unit of Measures
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------

     C     *entry        plist
     C                   parm                    pWhse
     C                   parm                    pItem
     C                   parm                    pUom

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

      /free

        pUom = ' ';

        chain(n) (pWhse: pItem) piritem;
        if %found(piritem);
           pUom = itum1 + itum2 + itum2;
        else;
           pUom = '      ';
        endif;

        *inlr = *on;
        return;

      /end-free

