      /copy *libl/qcopysrc,hspecs
     H DFTACTGRP(*NO) ACTGRP(*CALLER)
     *----------------------------------------------------------------
     *   Copyright (C) 2015 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *
     *  GETSUPER    Get Super PO Number
     *  03 March 2015
     *  Lynn McMahon
     *
     *  Revisions:
     *
650 A*    03/03/15  LMC  6.50
     *      - Created.
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     Fpiritem   if   e           k disk

     *----------------------------------------------------------------
     *  Standard SQL variables and constants
     *----------------------------------------------------------------

      /copy qcopysrc,c#stdsql

     *----------------------------------------------------------------
     *  Program info data structure
     *----------------------------------------------------------------

      /copy qcopysrc,c#pgminfds

     *----------------------------------------------------------------
     *  Constants
     *----------------------------------------------------------------

     d true            c                   *on
     d false           c                   *off

     *----------------------------------------------------------------
     *  Files
     *----------------------------------------------------------------

     D purec         E Ds                  Extname(pospo1)
      *----------------------------------------------------------
      *  Input Parms
      *----------------------------------------------------------

     D  pWhse          s              3p 0
     D  pPO            s              9    varying
     D  pSuperPO       s              9    varying

     *----------------------------------------------------------------
     *  Sub-procedure prototypes
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Parameters
     *
     *    Input Parameters
     *      pWhse       Warehouse
     *      pPO         PO Number
     *
     *    Returned Parameters
     *      pSuperPo    Super PO Number
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------

     C     *entry        plist
     C                   parm                    pWhse
     C                   parm                    pPO
     C                   parm                    pSuperPO

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

      /free

        pSuperPO = ' ';

        exec sql select * into :purec
             from pospo1
             where puwhse = :pWhse
               and pupo   = :pPO;
        If sqlstt = sqlSuccess;
          pSuperPO = %trimr(puspo);
        endif;

        *inlr = *on;
        return;

      /end-free

