      /copy *libl/qcopysrc,hspecs
     H DFTACTGRP(*NO) ACTGRP(*CALLER)
     *----------------------------------------------------------------
     *   Copyright (C) 2014 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *
     *  GETSHFDT    Get shift day date
     *  05 Aug 2014
     *  Retha Davis
     *
     *  Revisions:
     *
650 A*    08/05/14  RBD  6.50
     *      - Created.
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     Fpirtrand3 if   e           k disk

     *----------------------------------------------------------------
     *  Standard SQL variables and constants
     *----------------------------------------------------------------

      /copy qcopysrc,c#stdsql

     *----------------------------------------------------------------
     *  Program info data structure
     *----------------------------------------------------------------

      /copy qcopysrc,c#pgminfds

     *----------------------------------------------------------------
     *  Constants
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Parms
     *----------------------------------------------------------------

     D  pWhse          s              3p 0
     D  pTran          s              7p 0
     D  pShfDt         s              6p 0

     *----------------------------------------------------------------
     *  Standard Variables
     *----------------------------------------------------------------

      /copy qcopysrc,c#stdvar

     *----------------------------------------------------------------
     *  Sub-procedure prototypes
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Parameters
     *
     *    Input Parameters
     *      pWhse       Warehouse
     *      pTran       Tran number
     *
     *    Returned Parameters
     *      pShfDt      Shift Day Date
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------

     C     *entry        plist
     C                   parm                    pWhse
     C                   parm                    pTran
     C                   parm                    pShfDt

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

      /free

        pShfDt = 0;

         setll (pWhse: pTran) pirtrand3;

         dow forever = forever;

           reade (pWhse: pTran) pirtrand3;
           if %eof(pirtrand3);
             leave;
           endif;

           pShfDt = ptdshftday;

         enddo;

        *inlr = *on;
        return;

      /end-free

