520aA /COPY *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *  HELLOW    Hello World
     *  24 January 2008
     *  Dave Sommerville
     *----------------------------------------------------------------

     Fhellowfm  cf   e             workstn

     C                   exfmt     screen1                              50
     C                   eval      *inlr = *on
