     F*----------------------------------------------------------------
     F*
     F*  IV111P    Remove non-pick slots from INVSLOT.
     F*  09 August 2000
     F*  Roxanne Harrison
     F*
     F*  Revisions
     F*
415aAF*    06/10/00  RH    4.15a
     F*      - Added RCNT
416 AF*  09/25/01  RH   4.16
     F*    - Recompile - INVSLOT file changed.
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FINVSLOT UP  E           K        DISK
     F            IVSREC                            KRENAMERECORD
     FSLOT2   IF  E           K        DISK
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C           *ENTRY    PLIST
     C                     PARM           $PWHSE  30
     C                     PARM           $PCNT   50
     C                     PARM           $PRTRN  8
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C*  Skip if not correct warehouse.
     C*
     C           IVSWHS    IFNE $PWHSE
     C                     GOTO BOTTOM
     C                     ENDIF
     C*
     C*  Check if pick slot
     C*
     C           KEYSP     CHAINSLOT2                79
     C           *IN79     CABEQ*ON       BOTTOM
     C*  Skip if pick slot
     C*
     C           SLPICK    IFEQ 'Y'
     C                     GOTO BOTTOM
     C                     ELSE
     C                     DELETRECORD
415a C                     ADD  1         RCNT
     C                     ENDIF
     C*
     C*
     C           BOTTOM    TAG
415a C                     Z-ADDRCNT      $PCNT
     C*
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     CSR                   MOVE *ON       FOREVR  1
415a CSR                   Z-ADD0         RCNT    50
     C*
     C*  Define key for SLOT2
     C*
     C           KEYSP     KLIST
     C                     KFLD           IVSWHS
     C                     KFLD           IVSWHD
     C                     KFLD           IVSDSP
     C*
     C*
     CSR                   ENDSR
     C*---------------------------------------------------------------
