     F*----------------------------------------------------------------
     F*   Copyright (C) 1994 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  IV301     Inventory Unentered slots sheet - Process
     F*  04 January, 2017
     F*  Ginger Andrews
     F*
     F*  Revisions:
     F*   01/04/17  GJA  7.00
     F*     - Created and copied from IV171
     F*
     F*
     F*----------------------------------------------------------------
     F*  Indicator usage
     F*
     F*  79        Not on file/End of file indicator
     F*  90        Overflow Indicator
     F*  9X        Top of page and level X continues.
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FIV301   UP  E           K        DISK
     FIV302   UF  E           K        DISK                      A
     F            WKREC                             KRENAMERECORD
     FIV303   O   E           K        DISK                      A
     F            WKREC                             KRENAMERECB
     FINVSLOT4IF  E           K        DISK
     E*----------------------------------------------------------------
     E*
     E*  Table and array
     E*
     E*
     E                    A22        22  1
     E*
     E*
     I*----------------------------------------------------------------
     IWKREC
     I                                              WKSWHS
     I                                              WKSWHD
     I                                              WKSITM
     I*----------------------------------------------------------------
     I*  Program info data structure
     I*
     I           SDS
     I                                     *PROGRAM #PROG
     I                                      244 253 #JOB
     I                                      254 263 #USER
     I                                      264 269 #JOBN
     I                                      276 2810#JOBDT
     I                                      282 2870#JOBTM
     I*----------------------------------------------------------------
     I*  Called programs
     I*
     I              'CVTDTE'              C         @CVTDT
     I$CVTDT      DS
     I                                        1   8 $CVCMD
     I                                        9  18 $CVPRG
     I                                       19  24 $CVD6I
     I                                       25  32 $CVD8I
     I                                       33  380$CVD6O
     I                                       39  460$CVD8O
     I                                       47  64 $CVSTO
     I                                       65  72 $CVRTN
     I                                       73 132 $CVERM
     I                                       73  76 $CVMSG
     I            DS
     I                                        1   60T#DATE
     I                                        1   20MONTH
     I                                        3   40DAY
     I                                        5   60YEAR
     I*----------------------------------------------------------------
     C*  Parameters
     C*
     C*    Input Parameters
     C*      $PWHSE  Warehouse #
     C*      $PITM   Item # or *ALL
     C*      $PVAR   Minimum variance
     C*
     C*    Returned Parameters
     C*      None
     C*
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C           *ENTRY    PLIST
     C                     PARM           $PWHS   3
     C                     PARM           $PITM  15
     C                     PARM           $PVAR   5
     C                     PARM           $PASL   4
     C                     MOVE $PWHS     $PWHSE  30
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C*
     C*
     C*  Calculate difference of NEW qty's SUB OLD qyt's.
     C*
     C           WKSQT1    SUB  WKSTK1    WKDQT1  50
     C           WKSQT2    SUB  WKSTK2    WKDQT2  50
     C           WKSQT3    SUB  WKSTK3    WKDQT3  50
     C*
     C*  If *ALL item, write if variance is ok else delete from IV301
     C           $PITM     IFEQ '*ALL'
     C           $PASL     ORNE *BLANKS
     C           WKDQT1    IFGE PMVAR
     C           WKDQT2    ORGE PMVAR
     C           WKDQT3    ORGE PMVAR
     C           WKDQT1    ORLE PNVAR
     C           WKDQT2    ORLE PNVAR
     C           WKDQT3    ORLE PNVAR
     C                     EXSR ZZUPD
     C                     ELSE
     C                     DELETWKREC
     C                     ENDIF
     C                     ELSE
     C                     EXSR ZZUPD
     C                     ENDIF
     C*
     C*
     C           SKIPEX    TAG
     C*
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     C           *INZSR    BEGSR
     C*
     C           WKKEY1    KLIST
     C                     KFLD           $PWHSE
     C                     KFLD           WKSWHD
     C                     KFLD           WKSSTP
     C                     KFLD           WKSITM
     C*
     C           EXKEY2    KLIST
     C                     KFLD           $PWHSE
     C                     KFLD           WKSWHD
     C                     KFLD           WKSDSP
     C*
     C*
     C           ISKEY4    KLIST
     C                     KFLD           $PWHSE
     C                     KFLD           WKSWHD
     C                     KFLD           WKSDSP
     C*
     C**                   TIME           TIME
     C                     MOVE *ON       FIRST   1
     C                     MOVE #PROG     $CVPRG
     C                     MOVE $PVAR     PMVAR   50
     C           PMVAR     MULT -1        PNVAR   50
     C                     ENDSR
     C*----------------------------------------------------------------
     C*----------------------------------------------------------------
     C*
     C*  ZZUPD   Update work file.
     C*
     C           ZZUPD     BEGSR
     C*  If selecting for slot.
     C           $PASL     IFNE *BLANKS
     C           ISKEY4    CHAININVSLOT4             76
     C           *IN76     IFEQ *OFF
     C                     MOVE IVSEBY    WKSEBY
     C                     ENDIF
     C                     WRITERECB
     C                     ENDIF
     C*
     C           WKKEY1    CHAINRECORD               77
     C           *IN77     IFEQ *ON
     C                     WRITERECORD
     C                     ENDIF
     C*
     C                     ENDSR
      *----------------------------------------------------------------
      *
      * Compile time tables
      *
