     F*----------------------------------------------------------------
     F*   Copyright (C) 1993 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  IV325     Inventory scope listing
     F*  21 April, 1999
     F*  Roxanne Harrison
     F*
     F*
     F*  Revisions:
414aAF*    05/15/00  RH   4.14a
     F*      - Recompiled, file INVSLOT changed.
416 AF*  09/25/01  RH   4.16
     F*    - Recompile - INVSLOT file changed.
     F*
     F*
     F*----------------------------------------------------------------
     F*  Indicator usage
     F*
     F*  79        Not on file/End of file indicator
     F*  90        Overflow Indicator
     F*  9X        Top of page and level X continues.
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FINVSLOT IP  E           K        DISK
     FWAREHS  IF  E           K        DISK
     FWHDEPT  IF  E           K        DISK
     FIV325PR O   E             90     PRINTER
     E*----------------------------------------------------------------
     E*
     E*  Table and array
     E*
     E*                   RPD     1   3 30
     E                    RECK        3  7 0
     E*
     I*----------------------------------------------------------------
     IIVSREC
     I                                              IVSWHSL1
     I                                              IVSWHDL1
     I                                              IVSASLL1
     I*----------------------------------------------------------------
     I*
     I$PERM       DS
     I                                        1  60 XXERM
     I                                        1   4 $PMSG
     C*----------------------------------------------------------------
     C*
     C*  Report Heading
     C*
     C*
     C*  Start new page if one of following happened.
     C*     - Level break occurred.
     C*     - Page overflow.
     C*
     C           *INL1     IFEQ *ON
     C           *IN90     OREQ *ON
     C                     EXSR ZRHEAD
     C                     ENDIF
     C*
     C*  Init total levels
     C*
     C*
     C*  Level 1 break - Slot type
     C*
     C           *INL1     IFEQ *ON
     C                     Z-ADD1         L
     C                     EXSR ZRZERO
     C                     ENDIF
     C*
     C*----------------------------------------------------------------
     C*
     C* Detail Calcs
     C*
     C*
     C*  Get item description.
     C*
     C*          KEYIT     CHAINPIRITEM              79
     C*          *IN79     IFEQ *ON
     C*                    MOVEL*BLANKS   ITDESC
     C*                    ENDIF
     C*
     C*  Write detail line.
     C*
     C                     WRITEDETAIL1
     C*
     C*  Increment record counters
     C*
     C                     ADD  1         RECK,1
     C*
     C*  Set off top-of-page indicators
     C*
     C                     MOVE *OFF      *IN91
     C*----------------------------------------------------------------
     C*
     C* Slot type totals
     C*
     CL1                   Z-ADD1         L
     CL1                   EXSR ZRROLL
     C*
     C*----------------------------------------------------------------
     C*
     C* REPORT TOTALS
     C*
     CLR                   Z-ADD2         L
     C*
     CLR         RECK,L    IFGT 0
     CLR                   WRITESKIP1
     CLR                   WRITEFOOT1
     CLR                   ENDIF
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     C           *INZSR    BEGSR
     C*
     C*  Define key for main file.
     C*
411 DC*R         KEYIT     KLIST
     C*R                   KFLD           IVSWHS
     C*R                   KFLD           IVSWHD
     C*
     C*    File WHDEPT
     C*
     CSR         KEYWD     KLIST
     CSR                   KFLD           IVSWHS
     CSR                   KFLD           IVSWHD
     C*
     C                     TIME           TIME
     C                     MOVE *ON       FIRST   1
     C                     Z-ADD3         L       10
     C                     EXSR ZRZERO
     C                     ENDSR
     C*----------------------------------------------------------------
     C*
     C           ZRFRMT    BEGSR
     C*
     C*   Get warehouse description.
     C*
     C                     MOVE *BLANKS   WHSE
     C                     MOVE *BLANKS   $PSTR
     C           IVSWHS    CHAINWAREHS               79
     C           *IN79     IFEQ *OFF
     C                     MOVELWHDESC    $PSTR  60
     C                     ELSE
     C                     MOVE *BLANKS   $PSTR
     C                     ENDIF
     C                     Z-ADD30        $PLEN   30
     C*
     C*   Center warehouse description.
     C*
     C                     CALL 'CENTER'
     C                     PARM           $PSTR
     C                     PARM           $PLEN
     C                     MOVEL$PSTR     WHSE
     C*
     C*   Get warehouse department description.
     C*
411 DC*R         IVSWHD    IFNE LSTWHD
     CSR                   MOVE *BLANKS   W1WHDP
     CSR                   MOVE *BLANKS   $PSTR
     CSR         KEYWD     CHAINWHDEPT               79
     CSR         *IN79     IFEQ *ON
     CSR                   MOVE *BLANKS   WDDESC
     CSR                   ENDIF
     CSR         IVSWHD    CAT  '-':1     W1WHDP
     CSR         W1WHDP    CAT  WDDESC:1  W1WHDP
411 DC*R                   ENDIF
     C*
     C*   Convert section into a word.
     C*
     CSR         IVSSTP    IFEQ 'P'
     CSR                   MOVE 'PIR  '   W1STYP
     CSR                   ELSE
     CSR                   MOVE 'Fixed'   W1STYP
     CSR                   ENDIF
     C*
     C*  Format department/section.
     C*
411 DC*                    MOVE *BLANKS   TYPE
     C*          IVSWHD    CAT  '/':0     TYPE
     C*          IVSSTP    IFEQ 'P'
     C*          TYPE      CAT  'PIR':0   TYPE
     C*                    ELSE
     C*          TYPE      CAT  'FIXED':0 TYPE
     C*                    ENDIF
     C                     ENDSR
     C*----------------------------------------------------------------
     C*
     C           ZRHEAD    BEGSR
     C*
     C           *INL1     IFEQ *ON
     C                     EXSR ZRFRMT
     C                     ELSE
     C                     MOVE *ON       *IN91
     C                     END
     C*
     C                     MOVE *OFF      *IN90
     C*
     C                     WRITEHEAD1
     C                     WRITEHEAD2
     C                     WRITECOLUMNS
     C*
     C                     ENDSR
     C*----------------------------------------------------------------
     C*
     C           ZRROLL    BEGSR
     C*
     C           *LIKE     DEFN L         M
     C           L         ADD  1         M
     C*
     C*                    ADD  1         LVLK,M
     C                     ADD  RECK,L    RECK,M
     C*
     C                     ENDSR
     C*----------------------------------------------------------------
     C*
     C           ZRZERO    BEGSR
     C*
     C*                    Z-ADD0         LVLK,L
     C                     Z-ADD0         RECK,L
     C*
     C                     ENDSR
     O*----------------------------------------------------------------
     O*
     O* Compile time tables
     O*
