     F*----------------------------------------------------------------
     F*   Copyright (C) 1999 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  LDI170    Change LAYSLOT item numbers to 6-digit with zero pad
     F*  09 April 2007
     F*  Dave Sommerville
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FLAYSLOT UP  E           K        DISK
     E*----------------------------------------------------------------
     E*  Table and array definitions
     E*
     E                    A15        15  1
     C*----------------------------------------------------------------
     C*  Main Line
     C*
     C           LLITEM    IFNE ' '
     C                     CALL 'ADJUST'
     C                     PARM '*RIGHT'  $PCMD   8
     C                     PARM LLITEM    $PSTR  30
     C                     MOVE $PSTR     TEMP15
     C                     MOVEATEMP15    A15
     C           1         DO   15        I       30
     C           A15,I     IFNE ' '
     C                     LEAVE
     C                     ENDIF
     C                     MOVE '0'       A15,I
     C                     ENDDO
     C                     MOVEAA15       TEMP15 15
     C                     MOVE TEMP15    TEMP6   6
     C                     MOVELTEMP6     LLITEM    P
     C                     UPDATLLREC                  49
     C                     ENDIF
