     F*----------------------------------------------------------------
     F*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (630) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  LT110D    Priority replenishment - Verify warehouse.
     F*  Max Blacknik
     F*  07 January 2000
     F*
     F*----------------------------------------------------------------
     F*  Revisions:
     F*
     F*
     F*  Note: This program is identical to IT380D.
     F*----------------------------------------------------------------
     F*  Indicator usage
     F*
     F*  79        Chain indicator
     F*  99        Universal record indicator (Very temporary usage)
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FWAREHS  IF  E           K        DISK
     F            WHREC                             KRENAMERECORD
     I*----------------------------------------------------------------
     I*  Called programs
     I*
     I*----------------------------------------------------------------
     I*  Called program parameters
     I*
     I*----------------------------------------------------------------
     I*  Program info data structure
     I*
     I           SDS
     I                                     *PROGRAM #PROG
     I                                      244 253 #JOB
     I                                      254 263 #USER
     I                                      264 269 #JOBN
     I                                      276 2810#JOBDT
     I                                      282 2870#JOBTM
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C           *ENTRY    PLIST
     C                     PARM           $PWHSA  3
     C                     PARM           $PRTN   8
     C*----------------------------------------------------------------
     C*
     C*   Verify warehouse code.
     C*
     C                     MOVE $PWHSA    KEYWH   30
     C           KEYWH     CHAINRECORD               79
     C           *IN79     IFEQ '1'
     C                     MOVE '*ERROR  '$PRTN
     C                     ELSE
     C                     MOVE '*OK     '$PRTN
     C                     END
     C*
     C                     RETRN
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     C*
     CSR                   ENDSR
     C*----------------------------------------------------------------
