     F*----------------------------------------------------------------
     F*   Copyright (C) 2001 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (630) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  PIRPLCN#    Get next PIR Single order pallet license #
     F*  31 October 2005
     F*  Roxanne Harrison
     F*
     F*----------------------------------------------------------------
     F*
     F*  File specs
     F*
     C*----------------------------------------------------------------
     C*
     C*  Subprogram parameters
     C*
     C*    Input Parameters
     C*    - None -
     C*
     C*    Returned Parameters
     C*    $NXTNM  Next PIR Single order pal license (guarenteed to be
     C*            unique; not guarenteed to be the next used in
     C*            sequence; 000000 is not used)
     C*
     C*----------------------------------------------------------------
     C* Main Line
     C*
     C           *ENTRY    PLIST
     C                     PARM           $NXTNM  70
     C           *NAMVAR   DEFN PIRPLCN   NEXT#   70
     C           *LOCK     IN   NEXT#
     C*
     C*  Return the unique sequence number.
     C*
     C                     Z-ADDNEXT#     $NXTNM
     C*
     C*  Update the data area with the next number to be used.
     C*
     C                     ADD  1         NEXT#
     C*
     C           NEXT#     IFEQ *ZEROS
     C                     ADD  1         NEXT#
     C                     ENDIF
     C*
     C                     OUT  NEXT#
     C                     RETRN
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     C*
     CSR                   ENDSR
