      /COPY *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *
     *  QDLT002     Fix slot entered date
     *  20 May 2009
     *  Dave Sommerville
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     * Files
     *----------------------------------------------------------------

     Flicactive1up   e           k disk

600dAD larecds       e ds                  extname(licactive1)

     *----------------------------------------------------------------
     *  Standard variables and constants
     *----------------------------------------------------------------

      /copy qcopysrc,c#stdvar

     *----------------------------------------------------------------
     *  Program information data structure
     *----------------------------------------------------------------

     D/copy qcopysrc,c#pgminfds

     *----------------------------------------------------------------
     *  Let the show begin .....
     *----------------------------------------------------------------
     C     *entry        plist
     C                   parm                    $cmd              8

     *----------------------------------------------------------------
     * Main line
     *----------------------------------------------------------------

      /free

         if $cmd <> '*UPDATE';
           return;
         endif;

         if laentd > 20090520;
           i += 1;
           laentd = 20090519;
           update(e) larec;
         endif;

      /end-free
