     F*----------------------------------------------------------------
     F*   Copyright (C) 2001 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  QDQTY1    Update designation codes from old file.
     F*  Davd Sommerville
     F*  30 April 2001
     F*
     F*  Revisions
     F*
     F*    04/30/01  DAS 4.15
     F*      - Created.
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FPIRITEMOIP  E           K        DISK
     FPIRITEM UF  E           K        DISK
     F            ITREC                             KRENAMERECORD
     I*----------------------------------------------------------------
     I*
     I            DS
     I                                        1   5 ITDESG
     I                                        5   5 ASTRK
     C*----------------------------------------------------------------
     C*
     C*  Update designation if old one had an '*'
     C*
     C           ASTRK     IFEQ '*'
     C                     MOVE ITDESG    SVDESG  5
     C           ITKEY     CHAINPIRITEM              79
     C           *IN79     IFEQ *OFF
     C                     MOVE SVDESG    ITDESG
     C                     UPDATRECORD
     C                     ENDIF
     C                     ENDIF
     C*****************************************************************
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     C*
     C*  Key fields
     C*
     C           ITKEY     KLIST
     C                     KFLD           ITWHSE
     C                     KFLD           ITITEM
     CSR                   ENDSR
