     F*----------------------------------------------------------------
     F*   Copyright (C) 1999 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  QDT001    Copy IMPWILH/D into IMPORDH/D multiple times
     F*  03 May 1999
     F*  Dave Sommerville
     F*
     F*  Revisions
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FIMPWILH IF  E           K        DISK
     F            OIHREC                            KRENAMERECH
     FIMPWILD IF  E           K        DISK
     F            OIDREC                            KRENAMERECD
     FIMPORDH O   E           K        DISK                      A
     FIMPORDD O   E           K        DISK                      A
     I*----------------------------------------------------------------
     I*  Program info data structure
     I*
     I           SDS
     I                                     *PROGRAM #PROG
     I                                      244 253 #JOB
     I                                      254 263 #USER
     I                                      264 269 #JOBN
     I                                      276 2810#JOBDT
     I                                      282 2870#JOBTM
     I*----------------------------------------------------------------
     C*  Parameters
     C*
     C*    Input Parameters
     C*      None
     C*    Returned Parameters
     C*      None
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C*  Create 1000 duplicates
     C*
     C                     MOVEL'R'       NEWRID  5 P
     C                     Z-ADD0         NEWORD  40
     C           1         DO   1000      I       40
     C*
     C*    Loop through header records.
     C*
     C           *LOVAL    SETLLIMPWILH
     C           FOREVR    DOUNEFOREVR
     C                     READ IMPWILH                  79
     C           *IN79     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C                     ADD  1         NEWORD
     C                     MOVE NEWORD    NEWRID
     C*
     C*      Loop through detail records for header.
     C*
     C*
     C           KEYOID    SETLLIMPWILD
     C           FOREVR    DOUNEFOREVR
     C                     READ IMPWILD                  78
     C           *IN78     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C*
     C                     Z-ADDNEWORD    OIDORD
     C                     WRITEOIDREC                 49
     C           *IN49     CABEQ*ON       BOTTOM
     C                     ENDDO
     C*
     C                     MOVE NEWRID    OIHRTE
     C                     Z-ADDNEWORD    OIHORD
     C                     WRITEOIHREC                 49
     C           *IN49     CABEQ*ON       BOTTOM
     C                     ENDDO
     C*
     C                     ENDDO
     C*
     C           BOTTOM    TAG
     C                     MOVE *ON       *INLR
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     C*
     C*  Initialize variables
     C*
     CSR                   MOVE *ON       FOREVR  1
     CSR                   MOVE *OFF      ERROR   1
     C*
     C*   Define keys
     C*
     CSR         KEYOID    KLIST
     CSR                   KFLD           OIHWHS
     CSR                   KFLD           OIHORD
     C*
     CSR                   MOVE #PROG     $PPRG  10
     CSR                   ENDSR
