      /copy *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *  File Specs
     *
     FRTRTS1FM  cf   e             workstn
     *----------------------------------------------------------------
     *  Program info data structure
     *
     D                sds
     D  #prog            *proc
     D  #job                 244    253
     D  #user                254    263
     D  #jobn                264    269
     D  #jobdt               276    281  0
     D  #jobtm               282    287  0
     *----------------------------------------------------------------
     *  Parameters
     *
     *----------------------------------------------------------------
     *  Let the show begin .....
     *
     *----------------------------------------------------------------
     *  Main line
     *
     C                   exfmt     title
     *
     C                   eval      *inlr = *on
     *
