     F*----------------------------------------------------------------
     F*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  SI252     FTP StuffIt Import Type
     F*  08 June 2004
     F*  Roxanne Harrison
     F*
     F*  NOTE:
     F*      - SITYPE = 'I' - Inventory quantity need to manually run
     F*        recalculate *ALL when finished, replaces slot quantity.
     F*      - SITYPE = 'P' - Pick quantity, update slot and itemqty
     F*
     F*  Revisions
     F*
     F*
     F*----------------------------------------------------------------
     F* Indicators
     F*
     F*  91        - Overflow indicator
     F*
     F*----------------------------------------------------------------
     F* File Specs
     F*
     FIMPFSTUFIF  E           K        DISK
     E*----------------------------------------------------------------
     E*  Table and array definitions
     E*
     I*----------------------------------------------------------------
     I*  Called programs
     I*
     I*----------------------------------------------------------------
     I*  Called program parameters
     I*
     I*----------------------------------------------------------------
     I*  Called program parameters
     I*
     I$LPARM      DS
     I                                        1   8 $LCMD
     I                                        9  18 $LPRG
     I                                       19  68 $LUKY
     I                                       69  76 $LRTN
     I                                       77 136 $LERM
     I                                       77  80 $LMSG
     I*
     I*   Redefine key
     I*
     I*----------------------------------------------------------------
     I*  Program info data structure
     I*
     I           SDS
     I                                     *PROGRAM #PROG
     I                                      244 253 #JOB
     I                                      254 263 #USER
     I                                      264 269 #JOBN
     I                                      276 2810#JOBDT
     I                                      282 2870#JOBTM
     C*----------------------------------------------------------------
     C*  Parameters
     C*
     C*    Input Parameters
     C*      None
     C*
     C*    Returned Parameters
     C*      $STYPE  Stuffit type I=Inventory, P=Pick
     C*
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C           *ENTRY    PLIST
     C                     PARM           $PSTYP  1
     C*----------------------------------------------------------------
     C* Main line
     C*
     C* Whip through all the download records
     C*
     C                     MOVE *OFF      PFLAG   1
     C                     MOVE *ON       FOREVR  1
     C*
     C           FOREVR    DOWEQFOREVR
     C*
     C                     READ IMPFSTUF                 79
     C           *IN79     IFEQ *ON
     C                     LEAVE
     C                     ENDIF
     C*
     C                     MOVE SITYPE    $PSTYP
     C                     LEAVE
     C*
     C                     ENDDO
     C*
     C*  We are finished so get out
     C*
     C                     MOVE *ON       *INLR
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     CSR                   MOVE *OFF      ERROR   1
     C*
     C* Key definitions
     C*
     CSR                   MOVE #PROG     $LPRG
     C*
     CSR                   ENDSR
     C*----------------------------------------------------------------
     O*
     O*  COMPILE TIME TABLES
     O*
