      /copy *libl/qcopysrc,hspecs
     *----------------------------------------------------------------
     *
     *  TESTJIT   Test CCJITCL
     *  02 November 2004
     *  Dave Sommerville
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  File Specs
     *----------------------------------------------------------------

     Fpirtran   ip   e           k disk

     *----------------------------------------------------------------
     *  Variables
     *----------------------------------------------------------------

     D count           s              5  0

     *----------------------------------------------------------------
     *  Main line
     *----------------------------------------------------------------

     C                   if        ptstat = '1'
     C                             and pttask = 'FIXED'
     C                             and ptgdte >= 20041101
     C                   eval      count = count + 1

     C****               if        count > 1200

     C                   call      'CCJITCL'
     C                   parm      ptwhse        $xwhse           15 5
     C                   parm      pttrn#        $xtrn#           15 5

     C****               endif

     C                   endif
