     F*----------------------------------------------------------------
     F*
     F*  TSTGETBASE    Test GETBASE program.
     F*  27 July 2004
     F*  Dave Sommerville
     F*
     F*----------------------------------------------------------------
     C*----------------------------------------------------------------
     C*  Parameters
     C*
     C*    Input Parameters
     C*      $PWHSE  Warehouse
     C*      $PITEM  Item number
     C*
     C*    Returned Parameters
     C*      None
     C*
     C*----------------------------------------------------------------
     C*  Let the show begin .....
     C*
     C           *ENTRY    PLIST
     C                     PARM           $PWHSE 155
     C                     PARM           $PITEM 15
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C                     CALL 'GETBASE'
     C                     PARM $PWHSE    $GWHSE  30
     C                     PARM $PITEM    $GITEM 15
     C                     PARM ' '       #BITEM 15
     C                     PARM           #BITYP  1
     C                     PARM           #BDESC 30
     C                     PARM           #BPDSC 15
     C                     PARM           #BWHDP  5
     C                     PARM           #BSTYP  1
     C                     PARM           #BUM1   2
     C                     PARM           #BUM2   2
     C                     PARM           #BUMQ2  30
     C                     PARM           #BUM3   2
     C                     PARM           #BUMQ3  30
     C                     PARM ' '       #BCITM 15
     C                     PARM           #BCTYP  1
     C                     PARM           #BCDSC 30
     C                     PARM           #BCPDS 15
     C                     PARM           #BCWDP  5
     C                     PARM           #BCSTP  1
     C                     PARM           #BCUM1  2
     C                     PARM           #BCUM2  2
     C                     PARM           #BCUQ2  30
     C                     PARM           #BCUM3  2
     C                     PARM           #BCUQ3  30
     C                     PARM           #BRTN   8
     C*
     C                     MOVE *BLANKS   MSG    50
     C           'Item: '  CAT  #BITEM    MSG
     C           MSG       CAT  'TYPE:':2 MSG
     C           MSG       CAT  #BITYP:1  MSG
     C           MSG       DSPLY
     C*
     C                     MOVE *ON       *INLR
