     F*----------------------------------------------------------------
     C*  Main line
     C*
     C                     CALL 'GETADDON'
     C                     PARM 900       $PWHSE  30
     C                     PARM '00004'   $PRTID  5
     C                     PARM           $PPAR   5
     C                     PARM           $PRTN  10
     C*
     C                     MOVE *ON       *INLR
