      /copy qcopysrc,hspecs
     *----------------------------------------------------------------
     *  TSTM11300H   Test M11300H
     *  22 April 2014
     *  Dave Sommerville
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     *  Variables
     *----------------------------------------------------------------

     D whse            s              3p 0
     D lbl             s              7p 0
     D outStr          s            512    varying
     D chrUser         s             10

     *----------------------------------------------------------------
     *  Prototypes
     *----------------------------------------------------------------

     D m11300H         pr                  extpgm('M11300H')
     D  pWhse                         3p 0
     D  pLbl                          7p 0
     D  pUser                        10
     D  pOutStr                     512    varying

     *----------------------------------------------------------------
     *  Main Line
     *----------------------------------------------------------------

      /free

         *inlr = *on;

         outStr = '';
         chrUser = 'dave';
         whse = 900;
         lbl = 1011;

         m11300H(whse :
                 lbl :
                 chrUser :
                 outStr);

         return;
      /end-free
