     F*----------------------------------------------------------------
     F*   Copyright (C) 1996 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  UPD221A   Initialize Rcv. use generic license option V-2.21
     F*  Roxanne Harrison
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FOPTIONS UP  E           K        DISK
     I*----------------------------------------------------------------
     I*
     I*
     I*
     I*----------------------------------------------------------------
     I*
     I* Fields
     I*    OPLPGM  -  Receiving label program.
     I*    OPUPCT  -  Ideal slot usage percentage.
     I*    OPPDEF  -  PIR minimum number of slots priority.
     I*    OPPBLD  -  PIR same build code priority.
     I*    OPPACT  -  PIR same activity zone priority.
     I*    OPFDEF  -  Fixed minimum number or slots priority.
     I*    OPFASL  -  Fixed same aisle priority.
     I*    OPFSID  -  Fixed same side priority.
     I*    OPFLVL  -  Fixed highest level priority.
    AI*    OPPASL  -  PIR same aisle priority.
    AI*    OPPFRC  -  Force PIR same aisle priority.
221 AI*    OPPLCN  -  Use generic license plates.
     I*
     I*
     I* Data structure
     I*
     IOPDATA      DS
221 AI                                        1  10 OPLPGM
221 AI                                       11  130OPUPCT
221 AI                                       14  140OPPDEF
221 AI                                       15  150OPPBLD
221 AI                                       16  160OPPACT
221 AI                                       17  170OPFDEF
221 AI                                       18  180OPFASL
221 AI                                       19  190OPFSID
221 AI                                       20  200OPFLVL
221 AI                                       21  210OPPASL
221 AI                                       22  22 OPPFRC
221 AI                                       23  23 OPPLCN
     I                                      117 117 OPTEND
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C           OPCODE    IFEQ '*RCVLBL '
     C                     MOVE 'N'       OPPLCN
     C                     UPDATOPREC
     C                     ENDIF
