     F*----------------------------------------------------------------
     F*   Copyright (C) 1996 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  UPD213A   Initialize new DESIG fields - Ver 2.13
     F*  Dave Sommeville
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FDESIG   UP  E           K        DISK
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C*  Set all blank DSTYPE's to 'H' (Hardcode).
     C*
     C           DSTYPE    IFEQ ' '
     C                     MOVE 'H'       DSTYPE
     C                     UPDATDSREC
     C                     ENDIF
