     F*----------------------------------------------------------------
     F*   Copyright (C) 1996 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  UPD412A   Initialize OPICW - *SYSTEM in OPTIONS V-4.12
     F*  Roxanne Harrison   07-02-99
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FOPTIONS UF  E           K        DISK
     I*----------------------------------------------------------------
     I*
     I*  *SYSTEM  -  System options.
     I*----------------------------------------------------------------
     I* Fields
     I*
     I* Fields
     I*
     I*    OPEPM   -  Using EPM module (Y,N).
     I*    OPRF    -  Using RF module (Y,N).
     I*    OPCAPC  -  Capture catch weights at pick closing (Y,N).
     I*    OPLETD  -  Print letdown labels (Y,N).
     I*    OPWRNC  -  Perform catch weight variance check (Y,N).
     I*    OPRG1C  -  Catch weight low variance percentage.
     I*    OPRG2C  -  Catch weight high variance percentage.
     I*    OPIMPI  -  Import Item fields (Y,N).
412 AI*    OPICW   -  Individual catch weight entry (Y,N).
     I*
     I* Data structure
     I*
     IOPDATA      DS
     I                                        1   1 OPEPM
     I                                        2   2 OPRF
     I                                        3   3 OPCAPC
     I                                        4   4 OPLETD
     I                                        5   5 OPWRNC
     I                                        6   81OPRG1C
     I                                        9  111OPRG2C
     I                                       12  12 OPIMPI
412 AI                                       13  13 OPICW
     I*----------------------------------------------------------------
     I*  *IMPITEM  -  Import Item options.
     I*----------------------------------------------------------------
     I*
     I*    Y = Maintained by Host, imported to FSWMS
     I* Fields
     I*
     I*    OPITYP  -  Item type
     I*    OPDESC  -  Item description
     I*    OPWHDP  -  Warehouse department
     I*    OPSTYP  -  Section type
     I*    OPWHDP  -  Default warehouse department
     I*    OPDESG  -  Designation
     I*    OPACTV  -  Activity
     I*    OPBLD   -  Build code
     I*    OPVEN#  -  Vendor number
     I*    OPVIT#  -  Vendor item number
     I*    OPPDSC  -  Pack description
     I*    OPUM1   -  Normal unit of measure
     I*    OPUM2   -  Breakdown 1 unit of measure
     I*    OPUMQ2  -  Breakdown 1 UM quantity
     I*    OPFLG1  -  Allow Breakdown 1 Sale
     I*    OPUM3   -  Breakdown 2 unit of measure
     I*    OPUMQ3  -  Breakdown 2 UM quantity
     I*    OPFLG2  -  Allow Breakdown 2 Sale
     I*    OPULEN  -  Unit length
     I*    OPUWDT  -  Unit width
     I*    OPUHGT  -  Unit height
     I*    OPCUBE  -  Cube/Unit
     I*    OPSWGT  -  Shipping weight
     I*    OPCWGT  -  Catch weight
     I*    OPREPL  -  Replenish level
     I*    OPFLGD  -  Date sensitive
     I*    OPFLGB  -  Allow bulk pick
     I*    OPSLIF  -  Shelf life days
     I*    OPNDAY  -  Notice days
     I*    OPTIE   -  Mfr. Tie
     I*    OPHIGH  -  Mfr. High
     I*    OPMFLG  -  Manufacturing date
     I*    OPDDAY  -  Distributor days
     I*    OPUDAY  -  End user days
     I*    OPMDAY  -  Mfr. shelf life days
     I*    OPMITM  -  Master item number
     I*
     I                                        1   1 OPITYP
     I                                        2   2 OPDESC
     I                                        3   3 OPWHDP
     I                                        4   4 OPSTYP
     I                                        5   5 OPDESG
     I                                        6   6 OPACTV
     I                                        7   7 OPBLD
     I                                        8   8 OPVEN#
     I                                        9   9 OPVIT#
     I                                       10  10 OPPDSC
     I                                       11  11 OPUM1
     I                                       12  12 OPUM2
     I                                       13  13 OPUMQ2
     I                                       14  14 OPFLG1
     I                                       15  15 OPUM3
     I                                       16  16 OPUMQ3
     I                                       17  17 OPFLG2
     I                                       18  18 OPULEN
     I                                       19  19 OPUWDT
     I                                       20  20 OPUHGT
     I                                       21  21 OPCUBE
     I                                       22  22 OPSWGT
     I                                       23  23 OPCWGT
     I                                       24  24 OPREPL
     I                                       25  25 OPFLGD
     I                                       26  26 OPFLGB
     I                                       27  27 OPSLIF
     I                                       28  28 OPNDAY
     I                                       29  29 OPTIE
     I                                       30  30 OPHIGH
     I                                       31  31 OPMFLG
     I                                       32  32 OPDDAY
     I                                       33  33 OPUDAY
     I                                       34  34 OPMDAY
     I                                       35  35 OPMITM
     I                                      117 117 OPTEND
     I*----------------------------------------------------------------
     I*  Program info data structure
     I*
     I           SDS
     I                                     *PROGRAM #PROG
     I                                      244 253 #JOB
     I                                      254 263 #USER
     I                                      264 269 #JOBN
     I                                      276 2810#JOBDT
     I                                      282 2870#JOBTM
     I*----------------------------------------------------------------
     C*  Main line
     C*
     C*
     C                     EXSR ZZINZ
     C*
     C                     Z-ADD0         KYWHSE  30
     C                     MOVEL'*SYSTEM' KYCODE  8
     C           FILEKY    CHAINOPTIONS              79
     C           OPCODE    IFEQ '*SYSTEM '
     C                     MOVE 'N'       OPICW
     C                     UPDATOPREC
     C                     ENDIF
     C*
     C           OUT       TAG
     C                     RETRN
     C*----------------------------------------------------------------
     C*
     C*  ZZINZ    Extra program initialization. Called from *INZSR.
     C*
     CSR         ZZINZ     BEGSR
     C*
     C*  Define key for main file.
     C*
     CSR         FILEKY    KLIST
     CSR                   KFLD           KYWHSE
     CSR                   KFLD           KYCODE
     C*
     C                     CALL 'GETWHSE'
     C                     PARM           #USER
     C                     PARM 0         #WHSE   30
     C*
     CSR                   ENDSR
     C*----------------------------------------------------------------
