     F*----------------------------------------------------------------
     F*   Copyright (C) 2000 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (630) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  UPD414I   Initialize new field LHSINC in file LAYOUTH.
     F*  Dave Sommerville
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FLAYOUTH UP  E           K        DISK
     I*----------------------------------------------------------------
     I*
     I*
     I*
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C           LHSINC    IFEQ 0
     C                     Z-ADD2         LHSINC
     C                     UPDATLHREC
     C                     ENDIF
     C*
