     *----------------------------------------------------------------
     *   Copyright (C) 2006 BFC Software, Inc. - All Rights Reserved
     *   BFC Software, Inc.
     *----------------------------------------------------------------
     *
     *  UPD500DSB   Create UNMESRV records.
     *  13 February 2006
     *  Dave Sommerville
     *
500  *    02/13/06  DAS  5.00
     *      - Created
     *
     *----------------------------------------------------------------

     *----------------------------------------------------------------
     * File Specs
     *----------------------------------------------------------------

     Funmesr    ip   e           k disk
     Funmesrv   o    e           k disk

     *----------------------------------------------------------------
     * Main line
     *----------------------------------------------------------------

     C                   eval      uvcode = umcode
     C                   eval      uvdscs = umdesc
     C                   eval      uvdscp = umdesc

     C                   write     uvrec                                79
