     F*----------------------------------------------------------------
     F*   Copyright (C) 2005 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   245 W. Roosevelt Rd.  Bldg 8, Suite 51
     F*   West Chicago, IL  60185
     F*   (630) 562-0375
     F*----------------------------------------------------------------
     F*
     F*  UPD500MBD  Update *VOICE options
     F*  01 November 2005
     F*  Max Blacknik
     F*
     F*----------------------------------------------------------------
     F*  Revisions
     F*
500 AF*    11/01/05  MLB  5.00
     F*      - Update *VOICE options record with new field defaults.
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FOPTIONS UF  E           K        DISK                      A
     I*----------------------------------------------------------------
     I*
417iAI*----------------------------------------------------------------
417iAI*  *VOICE  -  PIR Voice options (Y/N)
417iAI*----------------------------------------------------------------
417iAI*
417iAI* Fields
417iAI*
417iAI*    OPINCP  -  Include pack description.
500dAI*    OPCRTR  -  Create RUNNER entries for shorts/outs (Y/N)
500gAI*    OPUPDL  -  Update Label with quantity picked during Voice
500gAI*               selection (Y/N)
500gAI*               NOTE: Any change to this field will cause the same
500gAI*                     field in the *RUNNER options record to be
500gAI*                     updated.
500gAI*    OPVMRG  -  Create Runner entries for Merge records? (Y/N)
417iAI*
417iAI* Data structure
417iAI*
417iAIOPDATA      DS
417iAI                                        1   1 OPINCP
500dAI                                        2   2 OPCRTR
500gAI                                        3   3 OPUPDL
500gAI                                        4   4 OPVMRG
417iAI                                      117 117 OPTEND
     I*
500gAI*----------------------------------------------------------------
500gAI*  *RUNNER  -  PIR Runner Flag Options
500gAI*----------------------------------------------------------------
500gAI*
500gAI* Fields
500gAI*
500gAI*    OPCRTM  -  Create Manual Runner entries for shorts/outs (Y/N)
500gAI*    OPUPLB  -  Update Label with quantity shorted during manual
500gAI*               flag entry (Y/N)
500gAI*               NOTE: Any change to this field will cause the same
500gAI*                     field in the *VOICE options record to be
500gAI*                     updated.
500gAI*    OPRPLF  -  Replenish flagged items before print report? (Y/N)
500gAI*    OPMRGF  -  Create Runner entries for Merge records? (Y/N)
500gAI*    OPCLRF  -  Clear Runner flags if qty still short/out? (Y/N)
500gAI*    OPRNRM  -  Send break message to user when new Runner
500gAI*               task has been assigned. (Y/N)
500gAI*    OPCLSF  -  Update Label quantity at flag close (Y/N).
500gAI*
500gAI* Data structure
500gAI*
500gAIOPDTA2      DS
500gAI                                        1   1 OPCRTM
500gAI                                        2   2 OPUPLB
500gAI                                        3   3 OPRPLF
500gAI                                        4   4 OPMRGF
500gAI                                        5   5 OPCLRF
500gAI                                        6   6 OPRNRM
500gAI                                        7   7 OPCLSF
500gAI                                      117 117 OPTEN2
500gAI*
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C                     MOVE *OFF      *IN79
     C           *LIKE     DEFN OPCODE    KYCODE
     C           OPKEY     KLIST
     C                     KFLD           WHCODE
     C                     KFLD           KYCODE
     C*
     C*
     C*    Retrieve Runner options rcd. Save Update Label option
     C*    Update Label option must match in both *RUNNER and
     C*    *VOICE options records.
     C                     MOVE 001       WHCODE  30
     C                     MOVE '*RUNNER 'KYCODE
     C                     MOVE 'N'       SVUPLB  1
     C           OPKEY     CHAINOPTIONS             N78
     C                     SELEC
     C           *IN78     WHEQ *OFF
     C                     MOVELOPDATA    OPDTA2
     C                     MOVE OPUPLB    SVUPLB  1
     C                     ENDSL
     C*
     C                     MOVE *ZEROS    WHCODE
     C                     MOVE '*VOICE  'KYCODE
     C           OPKEY     CHAINOPTIONS              78
     C                     SELEC
     C*
     C*    Create new Voice options record. Set defaults.
     C           *IN78     WHEQ *ON
     C                     MOVE WHCODE    OPWHSE
     C                     MOVE KYCODE    OPCODE
     C                     MOVE 'Y'       OPINCP
     C                     MOVE 'N'       OPCRTR
     C                     MOVE SVUPLB    OPUPDL
     C                     MOVE 'N'       OPVMRG
     C*
     C                     WRITEOPREC
     C*
     C*    Update new fields if blank.
     C           *IN78     WHEQ *OFF
     C                     MOVE SVUPLB    OPUPDL
     C*
     C           OPVMRG    IFEQ ' '
     C                     MOVE 'N'       OPVMRG
     C                     ENDIF
     C*
     C                     UPDATOPREC
     C*
     C                     ENDSL
     C*
     C                     MOVE *ON       *INLR
     C*
