     F*----------------------------------------------------------------
     F*
     F*  UPDRPTE   Copy new records from NREPORTE to REPORTE file.
     F*            Taken from UT160.
     F*  19 June 1996
     F*  Hemant Kapadia
     F*  Dave Sommerville
     F*
     F*  Revisions
     F*
     F*----------------------------------------------------------------
     F*  Indicator usage
     F*
     F*  50        Record exists
     F*  79        Error indicator
     F*
     F*----------------------------------------------------------------
     F*  File Specs
     F*
     FNREPORTEIP  E           K        DISK
     FREPORTE UF  E           K        DISK                      A
     F            ERREC                             KRENAMERECORD
     C*----------------------------------------------------------------
     C*  Main line
     C*
     C           ERPRTF    SETLLREPORTE                  50
     C           *IN50     IFEQ *OFF
     C                     WRITERECORD                 79
     C                     ENDIF
