     F*----------------------------------------------------------------
     F*   Copyright (C) 1994 BFC Software, Inc. - All Rights Reserved
     F*   BFC Software, Inc.
     F*   799 Roosevelt Rd.  Bldg 6, Suite 108
     F*   Glen Ellyn, IL  60137
     F*   (708) 790-8383
     F*----------------------------------------------------------------
     F*
     F*  UTIUPD1   Set values in PIRITEM.
     F*  22 September, 1999
     F*  Roxanne Harrison
     F*
     F*  Notes:
     F*      - Set Date sensitive, Bulk Pick, Mfg Date, and            L,
     F*        BrkDn. allow entry = N.
     F*
     F*----------------------------------------------------------------
     F* Indicators
     F*
     F*  79        - EOF for FILES
     F*
     F*----------------------------------------------------------------
     F* File Specs
     F*
     FPIRITEM UP  E           K        DISK
     FITEMMSC UF  E           K        DISK
     E*----------------------------------------------------------------
     E*  Table and array definitions
     E*
     E                    $MD       128  1
     E*                   DESC    1   1 50
     I*----------------------------------------------------------------
     I*  Data structure for error message parameters
     I*
     I$MDT        DS
     I                                        1  50 ERRMSG
     I*
     I                                    P   1   30ERRECS
     I                                        4  48 ERDESC
     I            DS
     I                                    P   1   20$EC
     I*----------------------------------------------------------------
     I*  Message control
     I*
     I              'PIRMSGF   '          C         #MSGF
     I*
     I            DS
     I                                        1 128 #MSGDT
     I                                        1 128 $MD
     C*----------------------------------------------------------------
     C*  Parameters
     C*
     C*    Input Parameters
     C*      $PPRG   - Program to send message back to.
     C*      &PWHSE  - Warehouse
     C*      &PDATE  - Export date
     C*
     C*    Returned Parameters
     C*      None
     C*
     C*----------------------------------------------------------------
     C*
     C*          *ENTRY    PLIST
     C*                    PARM           $PPRG  10
     C*                    PARM           $PWHSE  3
     C*                    PARM           $PDATE  8
     C*                    MOVE $PWHSE    $KWHSE  30
     C*                    MOVE $PDATE    $KDATE  80
     C*----------------------------------------------------------------
     C* Main line
     C*
     C*  Read PIRTRAN file, if value = ' ' move 'N' to value.
     C*  Set Date Sensitive.
412 AC           ITFLGD    IFEQ ' '
412 AC                     MOVE 'N'       ITFLGD
412 AC                     ENDIF
     C*  Set Allow bulk picks.
412 AC           ITFLGB    IFEQ ' '
412 AC                     MOVE 'N'       ITFLGB
412 AC                     ENDIF
     C*  Set Allow Brk2 Sale.
412 AC           ITFLG2    IFEQ ' '
412 AC                     MOVE 'N'       ITFLG2
412 AC                     ENDIF
     C*
     C           IMKEY     CHAINITEMMSC              78
     C           *IN78     IFEQ *OFF
     C*  Set Mfg. Date Flag.
412 AC           IMMFLG    IFEQ ' '
412 AC                     MOVE 'N'       IMMFLG
412 AC                     ENDIF
     C                     UPDATIMREC                  78
     C                     ENDIF
     C                     UPDATITREC                  79
     C*
     C*
     C           BOTTOM    TAG
     C*
     CLR                   EXSR ZM0750
     C*----------------------------------------------------------------
     C*
     C*          SUBROUTINES IN ALPHABETICAL ORDER
     C*
     C*----------------------------------------------------------------
     C*
     C*  *INZSR  Initialization subrotine
     C*
     CSR         *INZSR    BEGSR
     C*
     C*
     C*  Define key for ITEMMSC file.
     C*
     CSR         IMKEY     KLIST
     CSR                   KFLD           ITWHSE
     CSR                   KFLD           ITITEM
     C*
     CSR                   ENDSR
     C*---------------------------------------------------------------
     C*
     C*  SUBROUTINE ZMxxxx  Control message display subfile
     C*
     C*    ZMSMSG  Send program message to a different program msgq
     C*
     CSR         ZMSMSG    BEGSR
     CSR         $MSGF     IFEQ *BLANKS
     CSR                   MOVE #MSGF     $MSGF  10
     CSR                   END
     CSR                   MOVEL'UTIUPD1' $PPRG  10
     CSR                   CALL 'PUTMSG'
     CSR                   PARM           $MSGF
     CSR                   PARM           #MSGID  7
     CSR                   PARM           #MSGTP  7
     CSR                   PARM           #MSGDT
     CSR                   PARM $PPRG     #PGMQ2 10
     CSR                   PARM           #MSGK   4
     CSR                   MOVE *BLANKS   #MSGDT
     CSR                   MOVE *BLANKS   $MSGF
     CSR                   ENDSR
     C*----------------------------------------------------------------
     C*    ZMnnnn  Build and send message nnnn to this program
     C*----------------------------------------------------------------
     C*     PIR0750  Records removed.
     C*
     CSR         ZM0750    BEGSR
     CSR                   MOVE 'PIR0750' #MSGID
     CSR                   MOVE '*DIAG  ' #MSGTP
     CSR                   MOVEAERRMSG    $MD,1
     CSR                   EXSR ZMSMSG
     CSR                   ENDSR
     C*---------------------------------------------------------------
     O*----------------------------------------------------------------
     O*
     O*  Compile time tables
     O*
