     *----------------------------------------------------------------
     * Begin ID#ANDREWS - Client id for Andrews
     *                    01/13/05  MLB  5.00  Created
520 A*                    07/10/08  MLB  5.20  Added ANDREW entry.
     *----------------------------------------------------------------
     D andrews         c                   'ANDREWS'
520 AD andrew          c                   'ANDREWS'
     *** End ID#ANDREWS ***
