
     *----------------------------------------------------------------
     * Begin ID#AVALON - Client id for Avalon Foodservice
     *                09/13/11  MLB  6.40  Created
640 A*                                     Client initials: AVL
     *----------------------------------------------------------------
     D avalon          c                   'AVALON    '
     *** End ID#AVALON ***
