
     *----------------------------------------------------------------
     * Begin ID#ALLEN - Client id for Allen
     *                  06/03/04  DAS  4.17  Created
     *----------------------------------------------------------------
     D allen           c                   'ALLEN'
     *** End ID#ALLEN ***
