
     *----------------------------------------------------------------
     * Begin ID#AGAR - Client id for Agar Supply Co.
     *                02/03/12  MLB  6.40  Created
640 A*                                     Client initials: ASC!
     *----------------------------------------------------------------
     D agar            c                   'AGAR      '
     *** End ID#AGAR ***
