
     *----------------------------------------------------------------
     * Begin ID#ADC - Client id for Anderson-DuBose Company
     *                06/09/17  MLB  7.10  Created
     *                                     Client initials: ADC
     *----------------------------------------------------------------
     D adc             c                   'ANDERSONDU'
     D andersondubose  c                   'ANDERSONDU'
     *** End ID#ADC ***
