
     *----------------------------------------------------------------
     * Begin ID#ACC - Client id for Accardi Foods
     *                04/26/17  MLB  7.10  Created
     *                                     Client initials: ACC
     *----------------------------------------------------------------
     D acc             c                   'ACCARDI   '
     D accardi         c                   'ACCARDI   '
     *** End ID#ACC ***
