
     *----------------------------------------------------------------
     * Begin ID#ADF     - Client id for A&D Foods
     *                    05/13/16  MLB  7.00  Created
     *                                   Client initials: ADF
     *----------------------------------------------------------------
     D AandDFoods      c                   'AANDDFOODS'
     D AandDF          c                   'AANDDFOODS'
700 A*
     *** End ID#ADF **
