
     *----------------------------------------------------------------
     * Begin ID#BFCDEMO - Client id for BFCDEMO     A
     *                    10/06/10  JCJ  6.10  Created
     *                    Client abbreviation: BD
     *----------------------------------------------------------------
     D bfcdemo         c                   'BFCDEMO  '
     *** End ID#DAIRYLA ***
