
     *----------------------------------------------------------------
     * Begin ID#BFCTEST - Client id for BFC testing
     *                    06/13/07  DAS  5.10  Created
     *----------------------------------------------------------------
     D bfctest         c                   'BFCTEST'
     *** End ID#BFCTEST ***
