
     *----------------------------------------------------------------
     * Begin ID#BAL     - Client id for Balford
740 A*                    12/11/20  MLB  7.30  Created
     *                    Client abbreviation: BAL
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D balford         c                   'BALFORD  '
     D balfrd          c                   'BALFORD  '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     *
     *----------------------------------------------------------------
     *** End ID#BAL ***
     *
