
     *----------------------------------------------------------------
     * Begin ID#BIRITE  - Client id for BiRite
     *                    12/03/04  DAS  5.00  Created
     *----------------------------------------------------------------
     D birite          c                   'BIRITE'
     *** End ID#BIRITE ***
