
     *----------------------------------------------------------------
     * Begin ID#COASTAL - Client id for Coastal Sunbelt Produce
     *                02/19/10  MLB  5.30  Created
520aA*                                     Client initials: CSP
     *----------------------------------------------------------------
     D coastalsunbelt  c                   'COASTALSUN'
     D coastl          c                   'COASTALSUN'
     *** End ID#COASTAL ***
