
     *----------------------------------------------------------------
     * Begin ID#COT - Client id for Cotati Foodservice
     *                12/21/17  MLB  7.10  Created
     *                                     Client initials: COT
     *----------------------------------------------------------------
     D cotati          c                   'COTATIFOOD'
     *** End ID#COT ***
