
     *----------------------------------------------------------------
     * Begin ID#CHENEYR - PIRCLIENT2 location id for Cheney Riviera
     *                    01/10/06  DAS  5.00  Created
     *                    07/14/07  DAS  5.10a Added cbiriv
     *----------------------------------------------------------------
     D cheneyriviera   c                   'RIVIERA'
510aAD cbiriv          c                   'RIVIERA'
     *** End ID#CHENEYR ***
