
     *----------------------------------------------------------------
     * Begin ID#CHENEYP - PIRCLIENT2 location id for Cheney Punta Gorda
     *                    09/03/15  JGD  7.00  Created
     *----------------------------------------------------------------
     D cheneypntgr     c                   'PNTGRD'
700 AD cbipg           c                   'PNTGRD'
700 AD cbipntgr        c                   'PNTGRD'
     *** End ID#CHENEYP ***
