
     *----------------------------------------------------------------
     * Begin ID#CDIJAX - PIRCLIENT2 location id for CDI Jacksonville
     *                    01/13/10  MLB  5.30  Created
     *----------------------------------------------------------------
     D cdijax          c                   'CDIJAX'
     *** End ID#CDIJAX ***
