
     *----------------------------------------------------------------
     * Begin ID#CDIATL - PIRCLIENT2 location id for CDI Atlanta
     *                    01/13/10  MLB  5.30  Created
     *----------------------------------------------------------------
     D cdiatl          c                   'CDIATL'
     *** End ID#CDIATL ***
