
     *----------------------------------------------------------------
     * Begin ID#CAPITOL - Client id for Capitol City Produce
     *                02/19/10  MLB  5.30  Created
520aA*                                     Client initials: CCP
     *----------------------------------------------------------------
     D capitolcity     c                   'CAPITOLCTY'
     D capcty          c                   'CAPITOLCTY'
     *** End ID#CAPITOL ***
