
     *----------------------------------------------------------------
     * Begin ID#CDIJAC - PIRCLIENT2 location id for CDI Jackson, MS
     *                    06/02/14  MLB  6.50  Created
     *                                         Client initials: CDI
     *----------------------------------------------------------------
     D cdijacksonms    c                   'CDIJACKMS '
     D cdijac          c                   'CDIJACKMS '
     *** End ID#CDIJAC ***
