
     *----------------------------------------------------------------
     * Begin ID#CITYLIN - Client id for CityLine
     *                    06/04/04  DAS  4.17  Created
     *                    08/30/07  DAS  5.10  Added cityln
     *----------------------------------------------------------------
     D cityline        c                   'CITYLINE'
     D cityln          c                   'CITYLINE'
     *** End ID#CITYLIN ***
