
     *----------------------------------------------------------------
     * Begin ID#CFI - Client id for Colony Foods
     *                01/29/17  MLB  7.10  Created
     *                                     Client initials: CFI
     *----------------------------------------------------------------
     D cfi             c                   'COLONYFOOD'
     D colony          c                   'COLONYFOOD'
     *** End ID#CFI ***
