
     *----------------------------------------------------------------
     * Begin ID#CITYWHO - Client id for City Wholesale
     *                    09/20/07  RBD  5.10  Created
     *----------------------------------------------------------------
     D citywholesale   c                   'CITYWHO'
     D citywho         c                   'CITYWHO'
     D citywh          c                   'CITYWHO'
     *** End ID#CITYWHO ***
