
     *----------------------------------------------------------------
     * Begin ID#CDI - Client id for Customized Distribution
     *                03/11/08  DAS  5.20  Created
     *----------------------------------------------------------------
     D cdi             c                   'CDI'
     *** End ID#CDI ***
