
     *----------------------------------------------------------------
     * Begin ID#CHENEYO - PIRCLIENT2 location id for Cheney Ocala
     *                    01/10/06  DAS  5.00  Created
     *                    07/14/07  DAS  5.10a Added cbiocl
     *----------------------------------------------------------------
     D cheneyocala     c                   'OCALA'
510aAD cbiocl          c                   'OCALA'
     *** End ID#CHENEYO ***
