
     *----------------------------------------------------------------
     * Begin ID#DIC     - Client id for DiCarlo Foodservice
740 A*                    12/16/20  MLB  7.40  Created
     *                    Client abbreviation: BAL
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D dicarlo         c                   'DICARLO  '
     D dicarl          c                   'DICARLO  '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     *
     *----------------------------------------------------------------
     *** End ID#DIC ***
     *
