
     *----------------------------------------------------------------
     * Begin ID#DFC - Client id for Dependable Food
     *                11/07/17  MLB  7.10  Created
     *                                     Client initials: DFC
     *----------------------------------------------------------------
     D dfc             c                   'DEPENDABLE'
     D dependable      c                   'DEPENDABLE'
     *** End ID#DFC ***
