
     *----------------------------------------------------------------
     * Begin ID#DRYQCHI - PIRCLIENT2 location id for Dairyland Qzina Chicago
     *                    08/08/14  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryqznchicago   c                   'QZNCHICAGO'
     D dryqch          c                   'QZNCHICAGO'
     *** End ID#DRYQCHI ***
