
     *----------------------------------------------------------------
     * Begin ID#DIERKS  - Client id for Dierks/Waukesha
     *                    02/12/10  JCJ  5.30  Created
     *                    Client abbreviation: DRK
     *----------------------------------------------------------------
     D dierks          c                   'DIERKS'
     *** End ID#DIERKS ***
