
     *----------------------------------------------------------------
     * Begin ID#DRYLV - PIRCLIENT2 location id for Dairyland Las Vegas
     *                    05/16/13  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drylv           c                   'LASVEGAS  '
     *** End ID#DRYLV ***
