
     *----------------------------------------------------------------
     * Begin ID#DRYQNJ - PIRCLIENT2 location id for Dairyland Qzina NJ
     *                    08/08/14  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryqznnj        c                   'QZNNJ     '
     D dryqnj          c                   'QZNNJ     '
     *** End ID#DRYQNJ ***
