
     *----------------------------------------------------------------
     * Begin ID#DRYQMIA - PIRCLIENT2 location id for Dairyland Qzina Miami
     *                    08/08/14  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryqznmiami     c                   'QZNMIAMI  '
     D dryqfl          c                   'QZNMIAMI  '
     *** End ID#DRYQMIA ***
