
     *----------------------------------------------------------------
     * Begin ID#DRYQSF - PIRCLIENT2 location id for Dairyland Qzina SF
     *                    08/08/14  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryqznsf        c                   'QZNSF     '
     D dryqsf          c                   'QZNSF     '
     *** End ID#DRYQSF ***
