
     *----------------------------------------------------------------
     * Begin ID#DFF     - Client id for Dilgard Frozen Foods
730 A*                    01/15/19  MLB  7.30  Created
     *                    Client abbreviation: DFF
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D dilgard         c                   'DILGARD  '
     D dilgrd          c                   'DILGARD  '
     *
     *----------------------------------------------------------------
      * PIRCLIENT2 Entries
      *
     *
     *----------------------------------------------------------------
     *** End ID#DFF ***
     *
