
     *----------------------------------------------------------------
     * Begin ID#DRYCOL - PIRCLIENT2 location id for Dairyland Columbus
     *                    05/16/13  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drycolumbus     c                   'COLUMBUS  '
     D drycol          c                   'COLUMBUS  '
     *** End ID#DRYCOL ***
