
     *----------------------------------------------------------------
     * Begin ID#DRYHANO - PIRCLIENT2 location id for Dairyland Hanover
     *                    07/11/11  MLB  6.40  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryhanover      c                   'HANOVER'
     *** End ID#DRYHANO ***
