
     *----------------------------------------------------------------
     * Begin ID#DRYQLA - PIRCLIENT2 location id for Dairyland Qzina LA
     *                    08/08/14  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D dryqznla        c                   'QZNLOSANGL'
     D dryqla          c                   'QZNLOSANGL'
     *** End ID#DRYQLA ***
