
     *----------------------------------------------------------------
     * Begin ID#DONSONS - Client id for Donsons
     *                    12/03/04  DAS  5.00  Created
     *----------------------------------------------------------------
     D Donsons         c                   'DONSONS'
     *** End ID#DONSONS ***
