
     *----------------------------------------------------------------
     * Begin ID#DRYSF - PIRCLIENT2 location id for Dairyland San Francisco
     *                    12/20/11  MLB  6.40  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drysanfran      c                   'SANFRAN'
     *** End ID#DRYSF ***
