
     *----------------------------------------------------------------
     * Begin ID#DRYLA - PIRCLIENT2 location id for Dairyland Los Angeles
     *                    12/20/11  MLB  6.40  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drylosangeles   c                   'LOSANGELES'
     *** End ID#DRYLA ***
