
     *----------------------------------------------------------------
     * Begin ID#DRYBRON - PIRCLIENT2 location id for Dairyland Bronx
     *                    07/11/11  MLB  6.40  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drybronx        c                   'BRONX'
     *** End ID#DRYBRON ***
