
     *----------------------------------------------------------------
     * Begin ID#DRYCINC - PIRCLIENT2 location id for Dairyland Cincinnati
     *                    04/01/13  MLB  6.50  Created
     *                                     Client initials: DRY
     *----------------------------------------------------------------
     D drycincy        c                   'CINCINNATI'
     D drycin          c                   'CINCINNATI'
     *** End ID#DRYCINC ***
