
     *----------------------------------------------------------------
     * Begin ID#EI  - Client id for European Imports
     *                  01/18/06  MLB  5.00  Created
     *----------------------------------------------------------------
     D ei              c                   'EI'
     *** End ID#EI ***
