
     *----------------------------------------------------------------
     * Begin ID#EGF - Client id for EG Forrest
     *                12/09/08  MLB  5.20  Created
     *----------------------------------------------------------------
     D egf             c                   'EGFORREST'
     *** End ID#EGF ***
