
     *----------------------------------------------------------------
     * Begin ID#EASTLAN - Client id for Eastland Food Corp.
     *                12/28/10  MLB  6.40  Created
520aA*                                     Client initials: EFC
     *----------------------------------------------------------------
     D eastland        c                   'EASTLAND'
     D eastln          c                   'EASTLAND'
     *** End ID#EASTLAN ***
