
     *----------------------------------------------------------------
     * Begin ID#EOP     - Client id for Earls Organic Produce
     *                    05/25/18  MLB  7.20  Created
     *                                   Client initials: EOP
     *----------------------------------------------------------------
     D EarlsOrganic    c                   'EARLS     '
     D Earls           c                   'EARLS     '
     *
     *** End ID#EOP **
