
     *----------------------------------------------------------------
     * Begin ID#ELLENBE - Client id for Ellenbee-Leggett@
     *                    04/21/07  MLB  5.10  Created
     *----------------------------------------------------------------
     D ellenbe         c                   'ELLENBEE'
     D ellenbee        c                   'ELLENBEE'
     *** End ID#ELLENBE ***
