
     *----------------------------------------------------------------
     * Begin ID#ETTLINE - Client id for Ettline Foods
     *                04/10/08  MLB  5.20  Created
520aA*                07/10/08  MLB  5.20a Added ETTLIN entry.
     *----------------------------------------------------------------
     D Ettline         c                   'ETTLINE'
520aAD Ettlin          c                   'ETTLINE'
     *** End ID#ETTLINE ***
