
     *----------------------------------------------------------------
     * Begin ID#FGL - Client id for Foods Galore
     *                07/30/14  MLB  6.50  Created
650 A*                                     Client initials: FGL
     *----------------------------------------------------------------
     D foodsgalore     c                   'FOODSGALOR'
     D fodgal          c                   'FOODSGALOR'
     *** End ID#FGL ***
