
     *----------------------------------------------------------------
     * Begin ID#FISCHER - Client id for Fischer Foods Company
     *                02/19/10  MLB  5.30  Created
520aA*                                     Client initials: FFC
     *----------------------------------------------------------------
     D fischerfoods    c                   'FISCHER'
     D fischr          c                   'FISCHER'
     *** End ID#FISCHER ***
