
     *----------------------------------------------------------------
     * Begin ID#FRC - Client id for Fresh Cuts
     *                04/25/18  MLB  7.20  Created
720 A*                                     Client initials: FRC
     *----------------------------------------------------------------
     D freshcuts       c                   'FRESHCUTS '
     D frcuts          c                   'FRESHCUTS '
     *** End ID#GFS ***
