
     *----------------------------------------------------------------
     * Begin ID#FPR - Client id for FoodPro
     *                12/15/14  MLB  6.50  Created
650 A*                                     Client initials: FPR
     *----------------------------------------------------------------
     D foodpro         c                   'FOODPRO   '
     D fodpro          c                   'FOODPRO   '
     *** End ID#FPR ***
