
     *----------------------------------------------------------------
     * Begin ID#FRF - Client id for Fox River Foods
     *                04/07/08  MLB  5.20  Created
     *----------------------------------------------------------------
     D frf             c                   'FRF'
     *** End ID#FRF ***
