
     *----------------------------------------------------------------
     * Begin ID#FBY     - Client id for Farm Boy
     *                    03/30/16  MLB  7.00  Created
     *                                   Client initials: FBY
     *----------------------------------------------------------------
     D farmboy         c                   'FARMBOY'
     D frmboy          c                   'FARMBOY'
700 A*
     *** End ID#FBY **
