     *----------------------------------------------------------------
     * Begin ID#FINKLE  - Client id for Finkle
     *                    05/22/08  CWM  5.20  Created
     *----------------------------------------------------------------
     D finkle          c                   'FINKLE'
     *** End ID#FINKLE ***
