
     *----------------------------------------------------------------
     * Begin ID#GMM - Client id for Grave's Menu Maker
     *                03/13/12  MLB  6.40  Created
640 A*                                     Client initials: GMM
     *----------------------------------------------------------------
     D menumaker       c                   'MENUMAKER '
     D mnumkr          c                   'MENUMAKER '
     *** End ID#GMM ***
