
     *----------------------------------------------------------------
     * Begin ID#GFS - Client id for Get Fresh Sales
     *                10/03/12  MLB  6.40  Created
640 A*                                     Client initials: GFS
     *----------------------------------------------------------------
     D getfresh        c                   'GETFRESH  '
     D gtfrsh          c                   'GETFRESH  '
     *** End ID#GFS ***
