     *----------------------------------------------------------------
     * Begin ID#GSC     - Client id for Grocery Supply Company
     *                    01/05/06  DAS  5.00  Created
     *----------------------------------------------------------------
     D gsc             c                   'GSC'
     *** End ID#GSC ***
