
     *----------------------------------------------------------------
     * Begin ID#GMMVINI - Client id for Grave's Menu Maker - Vinita
     *                06/13/12  MLB  6.40  Created
640 A*                                     Client initials: GMM
     *----------------------------------------------------------------
     D gmmvinita       c                   'VINITA    '
     D gmmvin          c                   'VINITA    '
     *** End ID#GMMVINI ***
