
     *----------------------------------------------------------------
     * Begin ID#GFK - Client id for Get Fresh Kitchen
     *                12/13/18  MLB  7.20  Created
720 A*                                     Client initials: GFK
     *----------------------------------------------------------------
     D gfkkitchen      c                   'GFKKITCHEN'
     D gfkkit          c                   'GFKKITCHEN'
     *** End ID#GFK ***
