
     *----------------------------------------------------------------
     * Begin ID#GLP - Client id for Greenleaf Produce
     *                01/16/13  MLB  6.50  Created
650 A*                                     Client initials: GLP
     *----------------------------------------------------------------
     D greenleaf       c                   'GREENLEAF '
     D grnlef          c                   'GREENLEAF '
     *** End ID#GLP ***
