
     *----------------------------------------------------------------
     * Begin ID#HMWAGNE - Client id for H&M Wagner
     *                01/19/12  MLB  6.40  Created
640 A*                                     Client initials: HMW
     *----------------------------------------------------------------
     D hmwagner        c                   'HMWAGNER  '
     D hmwagn          c                   'HMWAGNER  '
     *** End ID#HMWAGNE ***
