
     *----------------------------------------------------------------
     * Begin ID#HKW - Client id for Hearn Kirkwood
     *                07/20/12  MLB  6.40  Created
640 A*                                     Client initials: HKW
     *----------------------------------------------------------------
     D Hearnkirkwood   c                   'HEARNKIRKW'
     D HKW             c                   'HEARNKIRKW'
     *** End ID#HKW ***
