
     *----------------------------------------------------------------
     * Begin ID#HPC     - Client id for Holt Paper Company
730 A*                    10/11/19  MLB  7.30  Created
     *                    Client abbreviation: HPC
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D holtpaper       c                   'HOLTPAPER '
     D holt            c                   'HOLTPAPER '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     D*hpc???????      c                   '         '
     *
     *----------------------------------------------------------------
     *** End ID#HPC ***
     *
