
     *----------------------------------------------------------------
     * Begin ID#HALSEY - Client id for Halsey Foodservice
     *                06/17/09  MLB  5.20  Created
     *----------------------------------------------------------------
     D halsey          c                   'HALSEY'
     *** End ID#HALSEY ***
