
     *----------------------------------------------------------------
     * Begin ID#ICB - Client id for Inter County Bakers
     *                11/29/11  MLB  6.40  Created
640 A*                                     Client initials: ICB
     *----------------------------------------------------------------
     D icb             c                   'ICB       '
     *** End ID#ICB ***
