
     *----------------------------------------------------------------
     * Begin ID#JTD - Client id for JT Davenport
     *                09/23/10  MLB  5.30  Created
520aA*                                     Client initials: JTD
     *----------------------------------------------------------------
     D jtdavenport     c                   'JTD'
     D jtd             c                   'JTD'
     *** End ID#JTD ***
