
     *----------------------------------------------------------------
     * Begin ID#JAC     - Client id for Jacmar
740 A*                    07/28/21  MLB  7.40  Created
     *                                   Client initials: JAC
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D Jacmar          c                   'JACMAR    '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     * Whse xxx
      *
     *
     *** End ID#JAC **
