
     *----------------------------------------------------------------
     * Begin ID#JFF     - Client id for Jake's Finer Foods
     *                    02/12/18  MLB  7.20  Created
     *                                   Client initials: JFF
     *----------------------------------------------------------------
     D Jakes           c                   'JAKESFOODS'
     *
     *** End ID#JFF **
