
     *----------------------------------------------------------------
     * Begin ID#JSL - Client id for Julius Silvert
     *                12/10/14  MLB  6.50  Created
650 A*                                     Client initials: JSL
     *----------------------------------------------------------------
     D jsilvert        c                   'JULIUSSILV'
     D jslvrt          c                   'JULIUSSILV'
     *** End ID#JSL ***
