
     *----------------------------------------------------------------
     * Begin ID#JORDANO - Client id for Jordanos
     *                    12/03/04  DAS  5.00  Created
     *----------------------------------------------------------------
     D jordanos        c                   'JORDANOS'
     *** End ID#JORDANO ***
