
     *----------------------------------------------------------------
     * Begin ID#KFS - Client id for Kelly's Foodservice
     *                04/10/12  MLB  6.40  Created
520aA*                                     Client initials: KFS
     *----------------------------------------------------------------
     D kellys          c                   'KELLYS'
     *** End ID#KFS ***
