
     *----------------------------------------------------------------
     * Begin ID#KUN - Client id for Kuna Foodservice
     *                03/24/15  MLB  6.50  Created
650 A*                                     Client initials: KUN
     *----------------------------------------------------------------
     D kunafoodsvc     c                   'KUNA      '
     D kuna            c                   'KUNA      '
     *** End ID#KUN ***
