
     *----------------------------------------------------------------
     * Begin ID#KHL - Client id for Kohl Wholesale
     *                06/24/14  MLB  6.50  Created
650 A*                                     Client initials: KHL
     *----------------------------------------------------------------
     D kohlwholesale   c                   'KOHL      '
     D kohl            c                   'KOHL      '
     *** End ID#KHL!***
