
     *----------------------------------------------------------------
     * Begin ID#KWIKTRP - Client id for Kwik Trip
     *                    06/03/04  DAS  4.17  Created
     *----------------------------------------------------------------
     D kwiktrip        c                   'KWIKTRIP'
     *** End ID#KWIKTRP ***
