
     *----------------------------------------------------------------
     * Begin ID#LINCOLN - Client id for Lincoln Poultry
     *                    01/15/07  RH   5.10  Created
     *----------------------------------------------------------------
     D lincoln         c                   'LINCOLN'
     *** End ID#LINCOLN ***
