
     *----------------------------------------------------------------
     * Begin ID#LKF     - Client id for Liebers Kosher Foods
     *                    12/21/18  MLB  7.20  Created
     *                                   Client initials: LKF
     *----------------------------------------------------------------
720 AD Liebers         c                   'LIEBERS   '
720 AD Lieber          c                   'LIEBERS   '
     *
     *** End ID#LKF **
