
     *----------------------------------------------------------------
     * Begin ID#MJKELLN - Client id for MJ Kellner
     *                    12/14/07  MLB  5.10  Created
520 A*                    07/10/08  MLB  5.20  Added MJKELN entry.
     *----------------------------------------------------------------
     D mjkellner       c                   'MJKELLNER'
     D mjkeln          c                   'MJKELLNER'
     *** End ID#MJKELLN ***
