
     *----------------------------------------------------------------
     * Begin ID#MATT    - Client id for Mattingly Foods
     *                    03/18/09  MLB  5.20  Created
     *----------------------------------------------------------------
     D mattfoods       c                   'MATTINGLY '
     D mattfd          c                   'MATTINGLY '
     *** End ID#MATT    ***
