
     *----------------------------------------------------------------
     * Begin ID#MQS - Client id for Marques Foods
     *                11/07/17  MLB  7.10  Created
     *                                     Client initials: MQS
     *----------------------------------------------------------------
     D mqs             c                   'MARQUES   '
     D marques         c                   'MARQUES   '
     *** End ID#MQS ***
