
     *----------------------------------------------------------------
     * Begin ID#NBX     - Client id for NECS Sandbox
     *                    08/06/18  MLB  7.20  Created
     *                                   Client initials: NBX
     *----------------------------------------------------------------
     D Necs            c                   'NECSANDBOX'
     *
     *** End ID#NBX **
