
     *----------------------------------------------------------------
     * Begin ID#NOJ     - Client id for Natalies Orchid Island Juice
740 A*                    06/11/20  MLB  7.40  Created
     *                    Client abbreviation: NOJ
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D natalies        c                   'NATALIES  '
     D noj             c                   'NATALIES  '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     *
     *----------------------------------------------------------------
     *** End ID#NOJ ***
     *
