
     *----------------------------------------------------------------
     * Begin ID#NICHOLA - Client id for Nicholas & Co.
     *                01/21/11  MLB  6.40  Created
520aA*                                     Client initials: NCH
     *----------------------------------------------------------------
     D nicholas        c                   'NICHOLAS'
     D nichol          c                   'NICHOLAS'
     *** End ID#NICHOLA ***
