
     *----------------------------------------------------------------
     * Begin ID#PIRDEMO - Client id for PIRDEMO
     *                11/24/08  DAS  5.20  Created
     *----------------------------------------------------------------
     D pirdemo         c                   'PIRDEMO'
     *** End ID#PIRDEMO ***
