
     *----------------------------------------------------------------
     * Begin ID#PAN     - Client id for Panos Foods
     *                    01/25/16  MLB  7.00  Created
     *                                   Client initials: PAN
     *----------------------------------------------------------------
     D panos           c                   'PANOS'
700 A*
     *** End ID#PAN **
