
     *----------------------------------------------------------------
     * Begin ID#PALMER  - Client id for Jack Palmer Foodservice
     *                    03/14/06  MLB  5.10  Created
     *----------------------------------------------------------------
     D palmer          c                   'PALMER'
     *** End ID#PALMER ***
