
     *----------------------------------------------------------------
     * Begin ID#RFSAGAR - PIRCLIENT2 location id for RFS Agar
     *                    11/20/12  MLB  6.40  Created
     *                                     Client initials: RFS
     *----------------------------------------------------------------
     D rfsagar         c                   'AGAR'
     D rfsagr          c                   'AGAR'
     *** End ID#RFSAGAR ***
