
     *----------------------------------------------------------------
     * Begin ID#SGC     - Client id for SGC
     *                    04/29/07  MLB  5.10  Created
     *----------------------------------------------------------------
     D sgc             c                   'SGC'
     *** End ID#SGC **
