
     *----------------------------------------------------------------
     * Begin ID#SUN     - Client id for Sunrise Foodservice
740 A*                    07/29/20  MLB  7.40  Created
     *                    Client abbreviation: SUN
     *
     *----------------------------------------------------------------
     * PIRCLIENT Entries
     *
     D sunrise         c                   'SUNRISE   '
     D sunris          c                   'SUNRISE   '
     *
     *----------------------------------------------------------------
     * PIRCLIENT2 Entries
     *
     *
     *----------------------------------------------------------------
     *** End ID#SUN ***
     *
