
     *----------------------------------------------------------------
     * Begin ID#SPI - Client id for Stern Produce Inc
     *                10/01/12  MLB  6.40  Created
520aA*                                     Client initials: SPI
     *----------------------------------------------------------------
     D SternProduce    c                   'STERN'
     D SternP          c                   'STERN'
     *** End ID#SPI ***
