
     *----------------------------------------------------------------
     * Begin ID#SFP - Client id for Seashore Fruit & Produce
     *                11/07/17  MLB  7.10  Created
     *                                     Client initials: SFP
     *----------------------------------------------------------------
     D sfp             c                   'SEASHORE  '
     D seashore        c                   'SEASHORE  '
     *** End ID#SFP ***
