
     *----------------------------------------------------------------
     * Begin ID#SAVAL - Client id for Saval Foods
     *                02/24/09  MLB  5.20  Created
     *----------------------------------------------------------------
     D savalfoods      c                   'SAVALFOODS'
     D saval           c                   'SAVALFOODS'
     *** End ID#SAVAL ***
