
     *----------------------------------------------------------------
     * Begin ID#SBR - Client id for S Bertram
     *                12/10/14  MLB  6.50  Created
650 A*                                     Client initials: SBR
     *----------------------------------------------------------------
     D sbertram        c                   'SBERTRAM  '
     D sbrtrm          c                   'SBERTRAM  '
     *** End ID#SBR ***
