
     *----------------------------------------------------------------
     * Begin ID#TNT - Client id for T&T Produce
     *                03/15/13  MLB  6.50  Created
650 A*                                     Client initials: TNT
     *----------------------------------------------------------------
     D tntproduce      c                   'T&TPRODUCE'
     D tntprd          c                   'T&TPRODUCE'
     *** End ID#TNT ***
