     *----------------------------------------------------------------
     * Begin ID#USFCORP - Client id for USF Corp
     *                    06/14/05  MLB  5.00  Created
     *----------------------------------------------------------------
     D usfcorp         c                   'USFCORP'
     *** End ID#USFCORP ***
