     *----------------------------------------------------------------
     * Begin ID#USFASYS - Client Location id for USF A-Sys
     *                    11/29/06  MLB  5.10  Created
     *----------------------------------------------------------------
     D usfasys         c                   'USFASYS'
     *** End ID#USFASYS ***
