     *----------------------------------------------------------------
     * Begin ID#USFPSYS - Client Location id for USF P-Sys
     *                    11/29/06  MLB  5.10  Created
     *----------------------------------------------------------------
     D usfpsys         c                   'USFPSYS'
     *** End ID#USFPSYS ***
