     *----------------------------------------------------------------
     * Begin ID#USFGFG  - Client id for USF-GFG
     *                    01/15/06  MLB  5.00  Created
     *----------------------------------------------------------------
     D usfgfg          c                   'USFGFG'
     *** End ID#USFGFG ***
