     *----------------------------------------------------------------
     * Begin ID#USFCRP - Client id for USF-Corp
     *                    07/05/05  MLB  5.00  Created
     *----------------------------------------------------------------
     D usfcrp          c                   'USFCORP'
     *** End ID#USFCRP ***
