
     *----------------------------------------------------------------
     * Begin ID#VIP   - Client id for VIP Foodservice
     *                  01/27/06  MLB  5.00  Created
     *----------------------------------------------------------------
     D vip             c                   'VIP'
     *** End ID#VIP  ***
