
     *----------------------------------------------------------------
     * Begin ID#VIGO  - Client id for Vigo Importing
     *                  08/02/05  RH   5.00  Created
     *----------------------------------------------------------------
     D vigo            c                   'VIGO'
     *** End ID#VIGO ***
