
     *----------------------------------------------------------------
     * Begin ID#WIL - Client id for Williams Foods
     *                06/30/14  MLB  6.50  Created
650 A*                                     Client initials: WIL
     *----------------------------------------------------------------
     D willfoods       c                   'WILLFOODS '
     D willfo          c                   'WILLFOODS '
     *** End ID#WIL ***
