
     *----------------------------------------------------------------
     * Begin ID#WIF - Client id for Williams Foods
     *                04/24/14  MLB  6.50  Created
650 A*                                     Client initials: WIF
     *----------------------------------------------------------------
     D williamsfoods   c                   'WILLIAMS  '
     D wiffod          c                   'WILLIAMS  '
     *** End ID#WIF ***
