
     *----------------------------------------------------------------
     * Begin ID#WESTSID - Client id for WestSide
     *                    06/03/04  DAS  4.17  Created
     *----------------------------------------------------------------
     D westside        c                   'WESTSIDE'
     *** End ID#WESTSID ***
