
     *----------------------------------------------------------------
     * Begin ID#YHAHILO - PIRCLIENT2 location id for Y.Hata Hilo
     *                    11/26/12  MLB  6.40  Created
     *                                     Client initials: YHA
     *----------------------------------------------------------------
     D yhahilo         c                   'HILO'
     D yhahil          c                   'HILO'
     *** End ID#YHAHILO ***
