
     *----------------------------------------------------------------
     * Begin ID#YHAOAHU - PIRCLIENT2 location id for Y.Hata Oahu
     *                    11/26/12  MLB  6.40  Created
     *                                     Client initials: YHA
     *----------------------------------------------------------------
     D yhaoahu         c                   'OAHU'
     D yhaoah          c                   'OAHU'
     *** End ID#YHAOAHU ***
