      ****************************************************************
      * You must include the ###DSP Line in your Program
      ****************************************************************
     D*###DSP          DS
     D  DSPSTS           *STATUS
     D  KEYPRS               369    369
     D  bCRPOS               370    371B 0
     D  bSFLRN               378    379B 0
      ****************************************************************
