      ****************************************************************
      * Error Message API Data Structure.
      ****************************************************************
     D                 DS                  INZ
     D  bSTK                   1      4B 0
     D  bLEN                   5      8B 0
     D  bERR                   9     12B 0
      ****************************************************************
