     *----------------------------------------------------------------
     * Begin P.CHKIFSOB - Prototypes for CHKIFSOBJ
     *
     *   06/09/17  DAS  7.10
     *     - Created
     *
     *----------------------------------------------------------------

     D ChkIfsObj       pr                  extpgm('CHKIFSOBJ')
     D  pPath                       640
     D  pAuthority                   10

     *** End P.CHKIFDOB ***
