     *----------------------------------------------------------------
     * Begin P.CHKOBJCL - Prototypes for CHKOBJCL
     *
     *   02/07/16  DAS  7.00
     *     - Created
     *
     *----------------------------------------------------------------

     D chkobjcl        pr                  extpgm('CHKOBJCL')
     D  pObject                      10
     D  pType                        10
     D  pReturn                       8

     *** End P.CHKOBJCL ***
