
     *----------------------------------------------------------------
     * Begin P.CLCDUR - Prototypes for CLCDUR
     *
     *   04/14/17  DAS  7.10
     *     - Created
     *
     *----------------------------------------------------------------

     D clcdur          pr                  extpgm('CLCDUR')
     D  pDataStruc                  132

     *** End P.CLCDUR ***
