
     *----------------------------------------------------------------
     * Begin P.CVTDTE  - Prototypes for CVTDTE
     *
     *   02/26/08  DAS  6.00  P#00045
     *     - Created
     *
     *----------------------------------------------------------------

     D cvtDte          pr                  extpgm('CVTDTE')
     D  pDataStruc                  132

     *** End P.CVTDTE ***
