
     *----------------------------------------------------------------
     * Begin P.CVTTEXT- Prototypes for CVTTEXT
     *
     *   04/19/17  DAS  7.10
     *     - Created
     *
     *----------------------------------------------------------------

     D cvttext         pr                  extpgm('CVTTEXT')
     D  pCmd                         10
     D  pIn                         500
     D  pOut                        500

     *** End P.CVTTEXT ***
