     *----------------------------------------------------------------
     * Begin P.DLYJOBCL - Prototypes for DLYJOBCL
     *
     *   12/06/17  DAS  7.10
     *     - Created
     *
     *----------------------------------------------------------------

     D DlyJobCl        pr                  extpgm('DLYJOBCL')
     D  pSeconds                      5  0 const

     *** End P.DLYJOBCL ***
