     *----------------------------------------------------------------
     * Begin P.GETTRKTM - Prototypes for GETTRKTMPL
     *
     *   06/22/15  DAS  7.00
     *     - Created
     *
     *----------------------------------------------------------------

     D gettrktmpl      pr                  extpgm('GETTRKTMPL')
     D  pWhse                         3  0
     D  pRtId                         5
     D  pTrkTmpl                     10

     *** End P.GETTRKTMPL ***
