     *----------------------------------------------------------------
     * Begin P.GETZONTM - Prototypes for GETZONTMPL
     *
     *   06/22/15  DAS  7.00
     *     - Created
     *
     *----------------------------------------------------------------

     D getzontmpl      pr                  extpgm('GETZONTMPL')
     D  pWhse                         3  0
     D  pTrkTmpl                     10
     D  pZoneTmpl                    10

     *** End P.GETZONTMPL ***
