
     *----------------------------------------------------------------
     * Begin P.GETIMUOM - Prototypes for GETIMUOM
     *
     *   03/28/16  LMC  7.00
     *     - Created
     *
     *----------------------------------------------------------------

     D getimuom        pr                  extpgm('GETIMUOM')
     D  pWhse                         3  0
     D  pkilolbs                      1
     D  pIMUom                        3

     *** End P.GETIMUOM ***
