
     *----------------------------------------------------------------
     * Begin P.LB830  - Prototypes for LB830
     *
     *   05/27/08  DAS  6.00  P#00045
     *     - Created
     *
     *----------------------------------------------------------------

     D lb830           pr                  extpgm('LB830')
     D  pCmd                          8    const
     D  plbl#a                        7    const

     *** End P.LB830 ***
