     *----------------------------------------------------------------
     * Begin P.LBLPRNT - Prototypes for LBLPRNT
     *
     *   06/18/21  KDE  7.50
     *     - Created
     *
     *----------------------------------------------------------------

     D lblPRNT         pr                  extpgm('LBLPRNT')
     D  pfilePath                   384    varying
     D  pMessage                    100    varying

     *** End P.LBLPRNT ***
