     *----------------------------------------------------------------
     * Begin P.LOADR9  - Prototype for LOADR9
     *
     *   02/28/22  JIC  7.50
     *     - Created
     *
     *----------------------------------------------------------------

     D LOADR9          pr                  extpgm('LOADR9')
     D  pJsonStr                  64512    varying options(*nopass)
     *** End P.LOADR9***
