
     *----------------------------------------------------------------
     * Begin P.LP130  - Prototypes for LP130
     *
     *   02/26/08  DAS  6.00  P#00045
     *     - Created
     *
     *----------------------------------------------------------------

     D lp130           pr                  extpgm('LP130')
     D  pCmd                          8    const
     D  pLcns                        15    const

     *** End P.LP130 ***
