     *----------------------------------------------------------------
     * Begin P.OR627   - Prototypes for OR627
     *
     *   05/08/18  DAS  7.20
     *     - Created
     *
     *----------------------------------------------------------------

     D OR627           pr                  extpgm('OR627')
     D  pWhse                         3p 0 const
     D  pRtid                         5    const

     *** End P.OR627 ***
