     *----------------------------------------------------------------
     * Begin P.PIRLBL# - Prototypes for PIRLBL#
     *
     *   05/05/18  DAS  7.20
     *     - Created
     *
     *----------------------------------------------------------------

     D PIRLBL#         pr                  extpgm('PIRLBL#')
     D  pNxtLbl#                      7  0

     *** End P.PIRLBL# **
