     *----------------------------------------------------------------
     * Begin P.PIRLBL#W - Prototypes for PIRLBL#W
     *
     *   12/05/18  DAS  7.30
     *     - Created
     *
     *----------------------------------------------------------------

     D PirLbl#W        pr                  extpgm('PIRLBL#W')
     D  pWhse                         3  0 const
     D  pNextLbl#                    11  0

     *** End P.PIRLBL#W ***
