     *----------------------------------------------------------------
     * Begin P.PIRTRN#W - Prototypes for PIRTRN#W
     *
     *   12/05/18  DAS  7.30
     *     - Created
     *
     *----------------------------------------------------------------

     D PirTrn#W        pr                  extpgm('PIRTRN#W')
     D  pWhse                         3  0 const
     D  pNextTrn#                    11  0

     *** End P.PIRTRN#W ***
