     *----------------------------------------------------------------
     * Begin P.PIRRTC# - Prototypes for PIRRTC#
     *
     *   05/28/19  DAS  7.30
     *     - Created
     *
     *----------------------------------------------------------------

     D PIRRTC#         pr                  extpgm('PIRRTC#')
     D  pNxtRTC#                      7  0

     *** End P.PIRRTC# **
