     *----------------------------------------------------------------
     * Begin P.PIRTRN# - Prototypes for PIRTRN#
     *
     *   01/08/19  DAS  7.30
     *     - Created
     *
     *----------------------------------------------------------------

     D PIRTRN#         pr                  extpgm('PIRTRN#')
     D  pNxtTrn#                      7  0

     *** End P.PIRTRN# **
