
     *----------------------------------------------------------------
     * Begin P.PT830  - Prototypes for PT830
     *
     *   05/27/08  DAS  6.00  P#00045
     *     - Created
     *
     *----------------------------------------------------------------

     D pt830           pr                  extpgm('PT830')
     D  pCmd                          8    const
     D  ptrn#a                        7    const

     *** End P.PT130 ***
