
     *----------------------------------------------------------------
     * Begin P.PT132  - Prototypes for PT132
     *
     *   03/17/17  DAS  7.10
     *     - Created
     *
     *----------------------------------------------------------------

     D pt132           pr                  extpgm('PT132')
     D  parms                       102

     *** End P.PT132 ***
