
     *----------------------------------------------------------------
     * Begin P.QCMDEXC - Prototypes for QCMDEXC
     *
     *   07/13/10  DAS  5.30
     *     - Created
     *
     *----------------------------------------------------------------

     D qcmdexc         pr                  extpgm('QCMDEXC')
     D  command                    3000A   const options(*varsize)
     D  length                       15P 5 const

     *** End P.QCMDEXC ***
