
     *----------------------------------------------------------------
     * Begin P.RECALL# - Prototypes for RECALL#
     *
     *   10/16/15  RBD  7.00
     *     - Created
     *
     *----------------------------------------------------------------

     D Recall#         pr                  extpgm('RECALL#')
     D  pWhse                         3  0
     D  pReportId                     7  0

     *** End P.RECALL# ***
