
     *----------------------------------------------------------------
     * Begin P.TM910  - Prototypes for TM910
     *
     *   09/15/19  DAS  6.40
     *     - Created
     *
     *----------------------------------------------------------------

     D tm910           pr                  extpgm('TM910')
     D  $lparm                      136

     *** End P.TM910 ***
