     *----------------------------------------------------------------
     * Begin P.WINTLOG  - Prototypes for WINTLOG
     *
     *   11/08/23  KDE  7.60
     *     - Created
     *
     *----------------------------------------------------------------

     D wintlog         pr                  extpgm('WINTLOG')
     D  pWhse                         3p 0 const
     D  pBatid                       11    const

     *** End P.WINTLOG ***
